mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ================================================================================
     Project     :   ADuCM410
     File        :   ADuCM410_addr_rdef.h
     Description :   C header file contains macros for Registers' address relative to instances and plain bit-fields.

     Copyright (c) 2020 Analog Devices, Inc.  All Rights Reserved.
     This software is proprietary and confidential to Analog Devices, Inc. and
     its licensors.

     This file was auto-generated. Do not make local changes to this file.
   ================================================================================ */

#ifndef ADUCM410_ADDR_RDEF_H
#define ADUCM410_ADDR_RDEF_H


#if defined(_LANGUAGE_C) || (defined(__GNUC__) && !defined(__ASSEMBLER__))
#include <stdint.h>
#endif /* _LANGUAGE_C */


#ifndef TMR_ADDR_RDEF_H_
#define TMR_ADDR_RDEF_H_    /* TMR: GPT0 */

/* ====================================================================================================
        TMR Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_GPT0                                                (0X40000000U)    /* gpt0: */
#define INST_GPT1                                                (0X40000400U)    /* gpt1: */
#define INST_GPT2                                                (0X40000800U)    /* gpt2: */

#define MASK_TMR                                                 (0XFFFFFFFFU)    /* TMR: GPT0 */

/* ====================================================================================================
        TMR Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_TMR_LD                                              (0X00000000U)    /* 16-bit Load Value Register */
#define IDX_TMR_VAL                                             (0X00000004U)    /* 16-bit Timer Value Register */
#define IDX_TMR_CON                                             (0X00000008U)    /* Control Register */
#define IDX_TMR_CLRI                                            (0X0000000CU)    /* Clear Interrupt Register */
#define IDX_TMR_STA                                             (0X0000001CU)    /* Status Register */

/* ====================================================================================================
        TMR Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_TMR_LD                                              (0X0) 
#define RSTVAL_TMR_VAL                                             (0X0) 
#define RSTVAL_TMR_CON                                             (0XA) 
#define RSTVAL_TMR_CLRI                                            (0X0) 
#define RSTVAL_TMR_STA                                             (0X0) 

/* ====================================================================================================
        TMR Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          LD                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TMR_LD_LOAD                                      (0U)           /* Load Value */
#define BITL_TMR_LD_LOAD                                      (16U)          /* Load Value */
#define BITM_TMR_LD_LOAD                                      (0XFFFFU)      /* Load Value */

/* ----------------------------------------------------------------------------------------------------
          VAL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TMR_VAL_COUNT_VAL                                (0U)           /* Current Count */
#define BITL_TMR_VAL_COUNT_VAL                                (16U)          /* Current Count */
#define BITM_TMR_VAL_COUNT_VAL                                (0XFFFFU)      /* Current Count */

/* ----------------------------------------------------------------------------------------------------
          CON                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TMR_CON_PRE                                      (0U)           /* Prescaler */
#define BITL_TMR_CON_PRE                                      (2U)           /* Prescaler */
#define BITM_TMR_CON_PRE                                      (0X0003U)      /* Prescaler */
#define BITP_TMR_CON_UP                                       (2U)           /* Count up */
#define BITL_TMR_CON_UP                                       (1U)           /* Count up */
#define BITM_TMR_CON_UP                                       (0X0004U)      /* Count up */
#define BITP_TMR_CON_MOD                                      (3U)           /* Timer Mode */
#define BITL_TMR_CON_MOD                                      (1U)           /* Timer Mode */
#define BITM_TMR_CON_MOD                                      (0X0008U)      /* Timer Mode */
#define BITP_TMR_CON_ENABLE                                   (4U)           /* Timer Enable */
#define BITL_TMR_CON_ENABLE                                   (1U)           /* Timer Enable */
#define BITM_TMR_CON_ENABLE                                   (0X0010U)      /* Timer Enable */
#define BITP_TMR_CON_CLK                                      (5U)           /* Clock Select */
#define BITL_TMR_CON_CLK                                      (2U)           /* Clock Select */
#define BITM_TMR_CON_CLK                                      (0X0060U)      /* Clock Select */
#define BITP_TMR_CON_RLD                                      (7U)           /* Reload Control */
#define BITL_TMR_CON_RLD                                      (1U)           /* Reload Control */
#define BITM_TMR_CON_RLD                                      (0X0080U)      /* Reload Control */

#define ENUM_TMR_CON_RLD_EN                                   (0X0001U)      /* Resets the Up/down Counter When GPTCLRI[0] is Set */
#define ENUM_TMR_CON_RLD_DIS                                  (0X0000U)      /* Up/Down Counter is Only Reset on a Timeout Event */
#define ENUM_TMR_CON_CLK_PCLK0                                (0X0000U)      /* PCLK. */
#define ENUM_TMR_CON_CLK_HCLK                                 (0X0001U)      /* ROOT_CLK */
#define ENUM_TMR_CON_CLK_LFOSC                                (0X0002U)      /* LFOSC. 32 KHz OSC */
#define ENUM_TMR_CON_CLK_HFXTAL                               (0X0003U)      /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */
#define ENUM_TMR_CON_ENABLE_DIS                               (0X0000U)      /* DIS. Timer is Disabled (default) */
#define ENUM_TMR_CON_ENABLE_EN                                (0X0001U)      /* EN. Timer is Enabled */
#define ENUM_TMR_CON_MOD_FREERUN                              (0X0000U)      /* FREERUN.Timer Runs in Free Running Mode */
#define ENUM_TMR_CON_MOD_PERIODIC                             (0X0001U)      /* PERIODIC. Timer Runs in Periodic Mode (default) */
#define ENUM_TMR_CON_UP_DIS                                   (0X0000U)      /* DIS. Timer is Set to Count Down (default) */
#define ENUM_TMR_CON_UP_EN                                    (0X0001U)      /* EN. Timer is Set to Count up */
#define ENUM_TMR_CON_PRE_DIV1OR4                              (0X0000U)      /* Source_clock / [1 or 4] */
#define ENUM_TMR_CON_PRE_DIV16                                (0X0001U)      /* Source_clock / 16 */
#define ENUM_TMR_CON_PRE_DIV256                               (0X0002U)      /* Source_clock / 256 */
#define ENUM_TMR_CON_PRE_DIV32768                             (0X0003U)      /* Source_clock / 32,768 */

