mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          CTL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TIMER_CTL_EN                                     (0U)           /* Timer Enable */
#define BITL_TIMER_CTL_EN                                     (1U)           /* Timer Enable */
#define BITM_TIMER_CTL_EN                                     (0X00000001U)  /* Timer Enable */
#define BITP_TIMER_CTL_SEL                                    (2U)           /* Clock Source Select */
#define BITL_TIMER_CTL_SEL                                    (2U)           /* Clock Source Select */
#define BITM_TIMER_CTL_SEL                                    (0X0000000CU)  /* Clock Source Select */
#define BITP_TIMER_CTL_PRE                                    (4U)           /* Timer Prescale */
#define BITL_TIMER_CTL_PRE                                    (5U)           /* Timer Prescale */
#define BITM_TIMER_CTL_PRE                                    (0X000001F0U)  /* Timer Prescale */

#define ENUM_TIMER_CTL_SEL_PCLK                               (0X00000000U)  /* PCLK */
#define ENUM_TIMER_CTL_SEL_SYSCLK                             (0X00000001U)  /* HCLK */
#define ENUM_TIMER_CTL_SEL_LFOSC                              (0X00000002U)  /* High Frequency Oscillator */
#define ENUM_TIMER_CTL_SEL_HFXSTAL                            (0X00000003U)  /* High Frequency XTALL */

/* ----------------------------------------------------------------------------------------------------
          CNT                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TIMER_CNT_CNT                                    (0U)           /* Current Counter Value. */
#define BITL_TIMER_CNT_CNT                                    (32U)          /* Current Counter Value. */
#define BITM_TIMER_CNT_CNT                                    (0XFFFFFFFFU)  /* Current Counter Value. */

/* ----------------------------------------------------------------------------------------------------
          STATUS                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TIMER_STATUS_CC0_STATUS                          (0U)           /* CC0 Status */
#define BITL_TIMER_STATUS_CC0_STATUS                          (1U)           /* CC0 Status */
#define BITM_TIMER_STATUS_CC0_STATUS                          (0X00000001U)  /* CC0 Status */
#define BITP_TIMER_STATUS_CC1_STATUS                          (1U)           /* CC1 Status */
#define BITL_TIMER_STATUS_CC1_STATUS                          (1U)           /* CC1 Status */
#define BITM_TIMER_STATUS_CC1_STATUS                          (0X00000002U)  /* CC1 Status */
#define BITP_TIMER_STATUS_CC2_STATUS                          (2U)           /* CC2 Status */
#define BITL_TIMER_STATUS_CC2_STATUS                          (1U)           /* CC2 Status */
#define BITM_TIMER_STATUS_CC2_STATUS                          (0X00000004U)  /* CC2 Status */
#define BITP_TIMER_STATUS_CC3_STATUS                          (3U)           /* CC3 Status */
#define BITL_TIMER_STATUS_CC3_STATUS                          (1U)           /* CC3 Status */
#define BITM_TIMER_STATUS_CC3_STATUS                          (0X00000008U)  /* CC3 Status */

/* ----------------------------------------------------------------------------------------------------
          CFG0                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TIMER_CFG_N__MODE                                (0U)           /* Capture or Compare Mode */
#define BITL_TIMER_CFG_N__MODE                                (1U)           /* Capture or Compare Mode */
#define BITM_TIMER_CFG_N__MODE                                (0X00000001U)  /* Capture or Compare Mode */
#define BITP_TIMER_CFG_N__CC_EN                               (1U)           /* Capture Compare Enabled */
#define BITL_TIMER_CFG_N__CC_EN                               (1U)           /* Capture Compare Enabled */
#define BITM_TIMER_CFG_N__CC_EN                               (0X00000002U)  /* Capture Compare Enabled */
#define BITP_TIMER_CFG_N__EVENT_SEL                           (2U)           /* Capture Events Select */
#define BITL_TIMER_CFG_N__EVENT_SEL                           (4U)           /* Capture Events Select */
#define BITM_TIMER_CFG_N__EVENT_SEL                           (0X0000003CU)  /* Capture Events Select */

#define ENUM_TIMER_CFG_N__MODE_CMP                            (0X00000000U)  /* Compare */
#define ENUM_TIMER_CFG_N__MODE_CAP                            (0X00000001U)  /* Capture */

/* ----------------------------------------------------------------------------------------------------
          CC0                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TIMER_CC_N__CC                                   (0U)           /* Capture or Compare Value */
#define BITL_TIMER_CC_N__CC                                   (32U)          /* Capture or Compare Value */
#define BITM_TIMER_CC_N__CC                                   (0XFFFFFFFFU)  /* Capture or Compare Value */

#endif  /* end ifndef TIMER_ADDR_RDEF_H_ */


#ifndef MISC16_ADDR_RDEF_H_
#define MISC16_ADDR_RDEF_H_    /* MISC16: Your module description, here. */

/* ====================================================================================================
        MISC16 Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_MISC                                                (0X40002000U)    /* misc: */

#define MASK_MISC16                                              (0X00000FFFU)    /* MISC16: Your module description, here. */

