mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          T4INC                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4INC_INTERVAL                               (0U)           /* Interval for Wakeup Field a */
#define BITL_WUT_T4INC_INTERVAL                               (12U)          /* Interval for Wakeup Field a */
#define BITM_WUT_T4INC_INTERVAL                               (0X0FFFU)      /* Interval for Wakeup Field a */

/* ----------------------------------------------------------------------------------------------------
          T4WUFB0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFB0_T4WUFBL                              (0U)           /* Wakeup Field B Low */
#define BITL_WUT_T4WUFB0_T4WUFBL                              (16U)          /* Wakeup Field B Low */
#define BITM_WUT_T4WUFB0_T4WUFBL                              (0XFFFFU)      /* Wakeup Field B Low */

/* ----------------------------------------------------------------------------------------------------
          T4WUFB1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFB1_T4WUFBH                              (0U)           /* Wakeup Field B High */
#define BITL_WUT_T4WUFB1_T4WUFBH                              (16U)          /* Wakeup Field B High */
#define BITM_WUT_T4WUFB1_T4WUFBH                              (0XFFFFU)      /* Wakeup Field B High */

/* ----------------------------------------------------------------------------------------------------
          T4WUFC0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFC0_T4WUFCL                              (0U)           /* Wakeup Field C Low */
#define BITL_WUT_T4WUFC0_T4WUFCL                              (16U)          /* Wakeup Field C Low */
#define BITM_WUT_T4WUFC0_T4WUFCL                              (0XFFFFU)      /* Wakeup Field C Low */

/* ----------------------------------------------------------------------------------------------------
          T4WUFC1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFC1_T4WUFCH                              (0U)           /* Wakeup Field C High */
#define BITL_WUT_T4WUFC1_T4WUFCH                              (16U)          /* Wakeup Field C High */
#define BITM_WUT_T4WUFC1_T4WUFCH                              (0XFFFFU)      /* Wakeup Field C High */

/* ----------------------------------------------------------------------------------------------------
          T4WUFD0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFD0_T4WUFD0                              (0U)           /* Wakeup Field D Low */
#define BITL_WUT_T4WUFD0_T4WUFD0                              (16U)          /* Wakeup Field D Low */
#define BITM_WUT_T4WUFD0_T4WUFD0                              (0XFFFFU)      /* Wakeup Field D Low */

/* ----------------------------------------------------------------------------------------------------
          T4WUFD1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFD1_T4WUFDH                              (0U)           /* Wakeup Field D High */
#define BITL_WUT_T4WUFD1_T4WUFDH                              (16U)          /* Wakeup Field D High */
#define BITM_WUT_T4WUFD1_T4WUFDH                              (0XFFFFU)      /* Wakeup Field D High */

/* ----------------------------------------------------------------------------------------------------
          T4IEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4IEN_WUFA                                   (0U)           /* T4WUFA Interrupt Enable */
#define BITL_WUT_T4IEN_WUFA                                   (1U)           /* T4WUFA Interrupt Enable */
#define BITM_WUT_T4IEN_WUFA                                   (0X0001U)      /* T4WUFA Interrupt Enable */
#define BITP_WUT_T4IEN_WUFB                                   (1U)           /* T4WUFB Interrupt Enable */
#define BITL_WUT_T4IEN_WUFB                                   (1U)           /* T4WUFB Interrupt Enable */
#define BITM_WUT_T4IEN_WUFB                                   (0X0002U)      /* T4WUFB Interrupt Enable */
#define BITP_WUT_T4IEN_WUFC                                   (2U)           /* T4WUFC Interrupt Enable */
#define BITL_WUT_T4IEN_WUFC                                   (1U)           /* T4WUFC Interrupt Enable */
#define BITM_WUT_T4IEN_WUFC                                   (0X0004U)      /* T4WUFC Interrupt Enable */
#define BITP_WUT_T4IEN_WUFD                                   (3U)           /* T4WUFD Interrupt Enable */
#define BITL_WUT_T4IEN_WUFD                                   (1U)           /* T4WUFD Interrupt Enable */
#define BITM_WUT_T4IEN_WUFD                                   (0X0008U)      /* T4WUFD Interrupt Enable */
#define BITP_WUT_T4IEN_ROLL                                   (4U)           /* Rollover Interrupt Enable */
#define BITL_WUT_T4IEN_ROLL                                   (1U)           /* Rollover Interrupt Enable */
#define BITM_WUT_T4IEN_ROLL                                   (0X0010U)      /* Rollover Interrupt Enable */

