mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        WDT Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_WDT                                                 (0X40004000U)    /* wdt: */

#define MASK_WDT                                                 (0X000000FFU)    /* WDT: Watchdog Timer Register Map */

/* ====================================================================================================
        WDT Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_WDT_LD                                              (0X00U)    /* Watchdog Timer Load Value */
#define IDX_WDT_VALS                                            (0X04U)    /* Current Count Value */
#define IDX_WDT_CON                                             (0X08U)    /* Watchdog Timer Control Register */
#define IDX_WDT_CLRI                                            (0X0CU)    /* Refresh Watchdog Register */
#define IDX_WDT_STA                                             (0X18U)    /* Timer Status */
#define IDX_WDT_MINLD                                           (0X1CU)    /* Minimum Load Value */

/* ====================================================================================================
        WDT Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_WDT_LD                                              (0X1000) 
#define RSTVAL_WDT_VALS                                            (0X1000) 
#define RSTVAL_WDT_CON                                             (0X69) 
#define RSTVAL_WDT_CLRI                                            (0X0) 
#define RSTVAL_WDT_STA                                             (0X0) 
#define RSTVAL_WDT_MINLD                                           (0X800) 

/* ====================================================================================================
        WDT Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          LD                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WDT_LD_LOAD                                      (0U)           /* WDT Load Value */
#define BITL_WDT_LD_LOAD                                      (16U)          /* WDT Load Value */
#define BITM_WDT_LD_LOAD                                      (0XFFFFU)      /* WDT Load Value */

/* ----------------------------------------------------------------------------------------------------
          VALS                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WDT_VALS_CCOUNT                                  (0U)           /* Current WDT Count Value. */
#define BITL_WDT_VALS_CCOUNT                                  (16U)          /* Current WDT Count Value. */
#define BITM_WDT_VALS_CCOUNT                                  (0XFFFFU)      /* Current WDT Count Value. */

/* ----------------------------------------------------------------------------------------------------
          CON                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WDT_CON_PDSTOP                                   (0U)           /* Power Down Stop Enable */
#define BITL_WDT_CON_PDSTOP                                   (1U)           /* Power Down Stop Enable */
#define BITM_WDT_CON_PDSTOP                                   (0X0001U)      /* Power Down Stop Enable */
#define BITP_WDT_CON_IRQ                                      (1U)           /* WDT Interrupt Enable */
#define BITL_WDT_CON_IRQ                                      (1U)           /* WDT Interrupt Enable */
#define BITM_WDT_CON_IRQ                                      (0X0002U)      /* WDT Interrupt Enable */
#define BITP_WDT_CON_PRE                                      (2U)           /* Prescaler. */
#define BITL_WDT_CON_PRE                                      (2U)           /* Prescaler. */
#define BITM_WDT_CON_PRE                                      (0X000CU)      /* Prescaler. */
#define BITP_WDT_CON_EN                                       (5U)           /* Timer Enable */
#define BITL_WDT_CON_EN                                       (1U)           /* Timer Enable */
#define BITM_WDT_CON_EN                                       (0X0020U)      /* Timer Enable */
#define BITP_WDT_CON_MDE                                      (6U)           /* Timer Mode Select */
#define BITL_WDT_CON_MDE                                      (1U)           /* Timer Mode Select */
#define BITM_WDT_CON_MDE                                      (0X0040U)      /* Timer Mode Select */
#define BITP_WDT_CON_CLKDIV2                                  (8U)           /* Clock Source */
#define BITL_WDT_CON_CLKDIV2                                  (1U)           /* Clock Source */
#define BITM_WDT_CON_CLKDIV2                                  (0X0100U)      /* Clock Source */
#define BITP_WDT_CON_MINLOADEN                                (9U)           /* Timer Window Control */
#define BITL_WDT_CON_MINLOADEN                                (1U)           /* Timer Window Control */
#define BITM_WDT_CON_MINLOADEN                                (0X0200U)      /* Timer Window Control */
#define BITP_WDT_CON_WDTIRQEN                                 (10U)          /* WDT Interrupt Enable */
#define BITL_WDT_CON_WDTIRQEN                                 (1U)           /* WDT Interrupt Enable */
#define BITM_WDT_CON_WDTIRQEN                                 (0X0400U)      /* WDT Interrupt Enable */

#define ENUM_WDT_CON_MDE_FREE                                 (0X0000U)      /* Free-running Mode */
#define ENUM_WDT_CON_MDE_PERIODIC                             (0X0001U)      /* Periodic Mode (default) */
#define ENUM_WDT_CON_PRE_DIV1                                 (0X0000U)      /* Source Clock/1 */
#define ENUM_WDT_CON_PRE_DIV16                                (0X0001U)      /* Source Clock/16. */
#define ENUM_WDT_CON_PRE_DIV256                               (0X0002U)      /* Source Clock/256 (default). */
#define ENUM_WDT_CON_PRE_DIV4096                              (0X0003U)      /* Source Clock/4096 */
#define ENUM_WDT_CON_IRQ_RESET                                (0X0000U)      /* Watchdog Timer Timeout Creates a Reset. */
#define ENUM_WDT_CON_IRQ_INTERRUPT                            (0X0001U)      /* Watchdog Timer Timeout Creates an Interrupt Instead of Reset. */
#define ENUM_WDT_CON_PDSTOP_CONTINUE                          (0X0000U)      /* Continue Counting When in Hibernate */
#define ENUM_WDT_CON_PDSTOP_STOPED                            (0X0001U)      /* Stop Counter When in Hibernate. */

