mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        ALWAYS_ON Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_ALWAYS_ON_PWRMOD                                    (0X0) 
#define RSTVAL_ALWAYS_ON_PWRKEY                                    (0X0) 
#define RSTVAL_ALWAYS_ON_RSTCFG                                    (0X0) 
#define RSTVAL_ALWAYS_ON_RSTKEY                                    (0X0) 
#define RSTVAL_ALWAYS_ON_EI0CFG                                    (0X0) 
#define RSTVAL_ALWAYS_ON_EI1CFG                                    (0X0) 
#define RSTVAL_ALWAYS_ON_EI2CFG                                    (0X0) 
#define RSTVAL_ALWAYS_ON_EICLR                                     (0X0) 
#define RSTVAL_ALWAYS_ON_RSTSTA                                    (0X0) 

/* ====================================================================================================
        ALWAYS_ON Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          PWRMOD                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_PWRMOD_PWRMOD                          (0U)           /* Power Modes Control Bits */
#define BITL_ALWAYS_ON_PWRMOD_PWRMOD                          (2U)           /* Power Modes Control Bits */
#define BITM_ALWAYS_ON_PWRMOD_PWRMOD                          (0X0003U)      /* Power Modes Control Bits */
#define BITP_ALWAYS_ON_PWRMOD_WICENACK                        (3U)           /* WIC Acknowledgment for SLEEPDEEP */
#define BITL_ALWAYS_ON_PWRMOD_WICENACK                        (1U)           /* WIC Acknowledgment for SLEEPDEEP */
#define BITM_ALWAYS_ON_PWRMOD_WICENACK                        (0X0008U)      /* WIC Acknowledgment for SLEEPDEEP */

#define ENUM_ALWAYS_ON_PWRMOD_WICENACK_NOACK                  (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_PWRMOD_WICENACK_ACK                    (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_PWRMOD_PWRMOD_FULLACTIVE               (0X0000U)      /* Active Mode */
#define ENUM_ALWAYS_ON_PWRMOD_PWRMOD_CORESLEEP                (0X0001U)      /* CORE_SLEEP Mode */
#define ENUM_ALWAYS_ON_PWRMOD_PWRMOD_SYSSLEEP                 (0X0002U)      /* SYS_SLEEP Mode */
#define ENUM_ALWAYS_ON_PWRMOD_PWRMOD_HIBERNATE                (0X0003U)      /* Hibernate Mode */

/* ----------------------------------------------------------------------------------------------------
          PWRKEY                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_PWRKEY_PWRKEY                          (0U)           /* Power Control Key Register */
#define BITL_ALWAYS_ON_PWRKEY_PWRKEY                          (16U)          /* Power Control Key Register */
#define BITM_ALWAYS_ON_PWRKEY_PWRKEY                          (0XFFFFU)      /* Power Control Key Register */

/* ----------------------------------------------------------------------------------------------------
          RSTCFG                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_RSTCFG_GPIO_PLA_RETAIN                 (0U)           /* GPIO/PLA Retain Their Status After WDT and Software Reset */
#define BITL_ALWAYS_ON_RSTCFG_GPIO_PLA_RETAIN                 (1U)           /* GPIO/PLA Retain Their Status After WDT and Software Reset */
#define BITM_ALWAYS_ON_RSTCFG_GPIO_PLA_RETAIN                 (0X0001U)      /* GPIO/PLA Retain Their Status After WDT and Software Reset */
#define BITP_ALWAYS_ON_RSTCFG_LV_RETAIN                       (2U)           /* LV Die Retain Status After Watchdog or Software Reset */
#define BITL_ALWAYS_ON_RSTCFG_LV_RETAIN                       (1U)           /* LV Die Retain Status After Watchdog or Software Reset */
#define BITM_ALWAYS_ON_RSTCFG_LV_RETAIN                       (0X0004U)      /* LV Die Retain Status After Watchdog or Software Reset */
#define BITP_ALWAYS_ON_RSTCFG_ANA_RETAIN                      (3U)           /* Analog Block Retain Status After Watchdog or Software Reset */
#define BITL_ALWAYS_ON_RSTCFG_ANA_RETAIN                      (1U)           /* Analog Block Retain Status After Watchdog or Software Reset */
#define BITM_ALWAYS_ON_RSTCFG_ANA_RETAIN                      (0X0008U)      /* Analog Block Retain Status After Watchdog or Software Reset */

#define ENUM_ALWAYS_ON_RSTCFG_ANA_RETAIN_DIS                  (0X0000U)      /* GPIO/PLA Retain Status After Watchdog or Software Reset. */
#define ENUM_ALWAYS_ON_RSTCFG_ANA_RETAIN_EN                   (0X0001U)      /* GPIO/PLA not Retain Status After Watchdog or Software Reset */
#define ENUM_ALWAYS_ON_RSTCFG_LV_RETAIN_DIS                   (0X0000U)      /* LV Die Retain Status After Watchdog or Software Reset. */
#define ENUM_ALWAYS_ON_RSTCFG_LV_RETAIN_EN                    (0X0001U)      /* LV Die not Retain Status After Watchdog or Software Reset */
#define ENUM_ALWAYS_ON_RSTCFG_GPIO_PLA_RETAIN_DIS             (0X0000U)      /* GPIO/PLA  Retain Status After Watchdog or Software Reset. */
#define ENUM_ALWAYS_ON_RSTCFG_GPIO_PLA_RETAIN_EN              (0X0001U)      /* GPIO/PLA not Retain Status After Watchdog or Software Reset */

/* ----------------------------------------------------------------------------------------------------
          RSTKEY                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_RSTKEY_RSTKEY                          (0U)           /* Reset Configuration Key Register */
#define BITL_ALWAYS_ON_RSTKEY_RSTKEY                          (16U)          /* Reset Configuration Key Register */
#define BITM_ALWAYS_ON_RSTKEY_RSTKEY                          (0XFFFFU)      /* Reset Configuration Key Register */

#define ENUM_ALWAYS_ON_RSTKEY_RSTKEY_RSTKEY1                  (0X2009U)      /* First Key to Write Reset Configuration */
#define ENUM_ALWAYS_ON_RSTKEY_RSTKEY_RSTKEY2                  (0X0426U)      /* Second Key to Write Reset Configuration */

