mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        PLA Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_PLA_PLA_ELEM0                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM1                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM2                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM3                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM4                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM5                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM6                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM7                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM8                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM9                                       (0X0) 
#define RSTVAL_PLA_PLA_ELEM10                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM11                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM12                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM13                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM14                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM15                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM16                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM17                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM18                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM19                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM20                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM21                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM22                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM23                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM24                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM25                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM26                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM27                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM28                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM29                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM30                                      (0X0) 
#define RSTVAL_PLA_PLA_ELEM31                                      (0X0) 
#define RSTVAL_PLA_PLA_CLK                                         (0X0) 
#define RSTVAL_PLA_PLA_IRQ0                                        (0X0) 
#define RSTVAL_PLA_PLA_IRQ1                                        (0X0) 
#define RSTVAL_PLA_PLA_ADC                                         (0X0) 
#define RSTVAL_PLA_PLA_DIN0                                        (0X0) 
#define RSTVAL_PLA_PLA_DOUT0                                       (0X0) 
#define RSTVAL_PLA_PLA_DOUT1                                       (0X0) 
#define RSTVAL_PLA_PLA_LCK                                         (0X0) 
#define RSTVAL_PLA_PLA_IRQTYPE                                     (0X0) 

/* ====================================================================================================
        PLA Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          PLA_ELEM0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_ELEM_N__MUX4                             (0U)           /* Select or Bypass Flip-flop Output */
#define BITL_PLA_PLA_ELEM_N__MUX4                             (1U)           /* Select or Bypass Flip-flop Output */
#define BITM_PLA_PLA_ELEM_N__MUX4                             (0X0001U)      /* Select or Bypass Flip-flop Output */
#define BITP_PLA_PLA_ELEM_N__TBL                              (1U)           /* Configures Output */
#define BITL_PLA_PLA_ELEM_N__TBL                              (4U)           /* Configures Output */
#define BITM_PLA_PLA_ELEM_N__TBL                              (0X001EU)      /* Configures Output */
#define BITP_PLA_PLA_ELEM_N__MUX3                             (5U)           /* Mux Between GPIO Bus Input or Odd Feedback Input */
#define BITL_PLA_PLA_ELEM_N__MUX3                             (1U)           /* Mux Between GPIO Bus Input or Odd Feedback Input */
#define BITM_PLA_PLA_ELEM_N__MUX3                             (0X0020U)      /* Mux Between GPIO Bus Input or Odd Feedback Input */
#define BITP_PLA_PLA_ELEM_N__MUX2                             (6U)           /* Mux Between PLA_DINx Register/Block0 Output or Even Feedback */
#define BITL_PLA_PLA_ELEM_N__MUX2                             (1U)           /* Mux Between PLA_DINx Register/Block0 Output or Even Feedback */
#define BITM_PLA_PLA_ELEM_N__MUX2                             (0X0040U)      /* Mux Between PLA_DINx Register/Block0 Output or Even Feedback */
#define BITP_PLA_PLA_ELEM_N__MUX1                             (7U)           /* Mux for Odd Element Feedback (In Respective Block) */
#define BITL_PLA_PLA_ELEM_N__MUX1                             (3U)           /* Mux for Odd Element Feedback (In Respective Block) */
#define BITM_PLA_PLA_ELEM_N__MUX1                             (0X0380U)      /* Mux for Odd Element Feedback (In Respective Block) */
#define BITP_PLA_PLA_ELEM_N__MUX0                             (10U)          /* Mux for Even Element Feedback(in Respective Block) */
#define BITL_PLA_PLA_ELEM_N__MUX0                             (3U)           /* Mux for Even Element Feedback(in Respective Block) */
#define BITM_PLA_PLA_ELEM_N__MUX0                             (0X1C00U)      /* Mux for Even Element Feedback(in Respective Block) */

#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM0                       (0X0000U)      /* Feedback from Element 0 (all Except Element 0) / Input from Other Block (Element 0 Only) */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM2                       (0X0001U)      /* Feedback from Element 2 */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM4                       (0X0002U)      /* Feedback from Element 4 */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM6                       (0X0003U)      /* Feedback from Element 6 */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM8                       (0X0004U)      /* Feedback from Element 8 */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM10                      (0X0005U)      /* Feedback from Element 10 */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM12                      (0X0006U)      /* Feedback from Element 12 */
#define ENUM_PLA_PLA_ELEM_N__MUX0_ELEM14                      (0X0007U)      /* Feedback from Element 14 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM1                       (0X0000U)      /* Feedback from Element 1 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM3                       (0X0001U)      /* Feedback from Element 3 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM5                       (0X0002U)      /* Feedback from Element 5 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM7                       (0X0003U)      /* Feedback from Element 7 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM9                       (0X0004U)      /* Feedback from Element 9 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM11                      (0X0005U)      /* Feedback from Element 11 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM13                      (0X0006U)      /* Feedback from Element 13 */
#define ENUM_PLA_PLA_ELEM_N__MUX1_ELEM15                      (0X0007U)      /* Feedback from Element 15 */
#define ENUM_PLA_PLA_ELEM_N__MUX2_MMR                         (0X0000U)      /* PLA_DINx Input */
#define ENUM_PLA_PLA_ELEM_N__MUX2_EVEN                        (0X0001U)      /* Even Feedback Mux */
#define ENUM_PLA_PLA_ELEM_N__MUX3_ODD                         (0X0000U)      /* Odd Feedback Mux */
#define ENUM_PLA_PLA_ELEM_N__MUX3_GPIO                        (0X0001U)      /* GPIO Input */
#define ENUM_PLA_PLA_ELEM_N__TBL_LOW                          (0X0000U)      /* 0. */
#define ENUM_PLA_PLA_ELEM_N__TBL_FUN_NOR                      (0X0001U)      /* NOR. */
#define ENUM_PLA_PLA_ELEM_N__TBL_BANDNOTA                     (0X0002U)      /* B and Not A. */
#define ENUM_PLA_PLA_ELEM_N__TBL_NOTA                         (0X0003U)      /* NOT A. */
#define ENUM_PLA_PLA_ELEM_N__TBL_AANDNOTB                     (0X0004U)      /* A and Not B. */
#define ENUM_PLA_PLA_ELEM_N__TBL_NOTB                         (0X0005U)      /* Not B. */
#define ENUM_PLA_PLA_ELEM_N__TBL_EXOR                         (0X0006U)      /* EXOR. */
#define ENUM_PLA_PLA_ELEM_N__TBL_FUN_NAND                     (0X0007U)      /* NAND. */
#define ENUM_PLA_PLA_ELEM_N__TBL_FUN_AND                      (0X0008U)      /* AND. */
#define ENUM_PLA_PLA_ELEM_N__TBL_EXNOR                        (0X0009U)      /* EXNOR. */
#define ENUM_PLA_PLA_ELEM_N__TBL_B                            (0X000AU)      /* B. */
#define ENUM_PLA_PLA_ELEM_N__TBL_BORNOTA                      (0X000BU)      /* B or Not A. */
#define ENUM_PLA_PLA_ELEM_N__TBL_A                            (0X000CU)      /* A. */
#define ENUM_PLA_PLA_ELEM_N__TBL_AORNOTB                      (0X000DU)      /* A or Not B. */
#define ENUM_PLA_PLA_ELEM_N__TBL_FUN_OR                       (0X000EU)      /* OR */
#define ENUM_PLA_PLA_ELEM_N__TBL_HIGH                         (0X000FU)      /* 1. */
#define ENUM_PLA_PLA_ELEM_N__MUX4_FF                          (0X0000U)      /* FF Output */
#define ENUM_PLA_PLA_ELEM_N__MUX4_BYPASS                      (0X0001U)      /* Bypass Output */

