mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PLA_CLK                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_CLK_BLOCK0                               (0U)           /* Clock Select for Block 0 */
#define BITL_PLA_PLA_CLK_BLOCK0                               (3U)           /* Clock Select for Block 0 */
#define BITM_PLA_PLA_CLK_BLOCK0                               (0X0007U)      /* Clock Select for Block 0 */
#define BITP_PLA_PLA_CLK_BLOCK1                               (4U)           /* Clock Select for Block 1 */
#define BITL_PLA_PLA_CLK_BLOCK1                               (3U)           /* Clock Select for Block 1 */
#define BITM_PLA_PLA_CLK_BLOCK1                               (0X0070U)      /* Clock Select for Block 1 */

#define ENUM_PLA_PLA_CLK_BLOCK1_PLACLK0                       (0X0000U)      /* GPIO Clock 0 */
#define ENUM_PLA_PLA_CLK_BLOCK1_PLACLK1                       (0X0001U)      /* GPIO Clock 1 */
#define ENUM_PLA_PLA_CLK_BLOCK1_PLACLK2                       (0X0002U)      /* GPIO Clock 2 */
#define ENUM_PLA_PLA_CLK_BLOCK1_PCLK0                         (0X0003U)      /* PCLK0 */
#define ENUM_PLA_PLA_CLK_BLOCK1_MOSC                          (0X0004U)      /* MOSC (16 MHz) */
#define ENUM_PLA_PLA_CLK_BLOCK1_T0                            (0X0005U)      /* Timer 0 */
#define ENUM_PLA_PLA_CLK_BLOCK1_T2                            (0X0006U)      /* Timer 2 */
#define ENUM_PLA_PLA_CLK_BLOCK1_KOSC                          (0X0007U)      /* KOSC (32 KHz) */
#define ENUM_PLA_PLA_CLK_BLOCK0_PLACLK0                       (0X0000U)      /* GPIO Clock 0 */
#define ENUM_PLA_PLA_CLK_BLOCK0_PLACLK1                       (0X0001U)      /* GPIO Clock 1 */
#define ENUM_PLA_PLA_CLK_BLOCK0_PLACLK2                       (0X0002U)      /* GPIO Clock 2 */
#define ENUM_PLA_PLA_CLK_BLOCK0_PCLK0                         (0X0003U)      /* PCLK0 */
#define ENUM_PLA_PLA_CLK_BLOCK0_MOSC                          (0X0004U)      /* MOSC (16 MHz) */
#define ENUM_PLA_PLA_CLK_BLOCK0_T0                            (0X0005U)      /* Timer 0 */
#define ENUM_PLA_PLA_CLK_BLOCK0_T2                            (0X0006U)      /* Timer 2 */
#define ENUM_PLA_PLA_CLK_BLOCK0_KOSC                          (0X0007U)      /* KOSC (32 KHz) */

/* ----------------------------------------------------------------------------------------------------
          PLA_IRQ0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_IRQ0_IRQ0_SRC                            (0U)           /* IRQ0 Source Select */
#define BITL_PLA_PLA_IRQ0_IRQ0_SRC                            (4U)           /* IRQ0 Source Select */
#define BITM_PLA_PLA_IRQ0_IRQ0_SRC                            (0X000FU)      /* IRQ0 Source Select */
#define BITP_PLA_PLA_IRQ0_IRQ0_EN                             (4U)           /* IRQ0 Enable */
#define BITL_PLA_PLA_IRQ0_IRQ0_EN                             (1U)           /* IRQ0 Enable */
#define BITM_PLA_PLA_IRQ0_IRQ0_EN                             (0X0010U)      /* IRQ0 Enable */
#define BITP_PLA_PLA_IRQ0_IRQ1_SRC                            (8U)           /* IRQ1 Source Select */
#define BITL_PLA_PLA_IRQ0_IRQ1_SRC                            (4U)           /* IRQ1 Source Select */
#define BITM_PLA_PLA_IRQ0_IRQ1_SRC                            (0X0F00U)      /* IRQ1 Source Select */
#define BITP_PLA_PLA_IRQ0_IRQ1_EN                             (12U)          /* IRQ1 Enable */
#define BITL_PLA_PLA_IRQ0_IRQ1_EN                             (1U)           /* IRQ1 Enable */
#define BITM_PLA_PLA_IRQ0_IRQ1_EN                             (0X1000U)      /* IRQ1 Enable */

#define ENUM_PLA_PLA_IRQ0_IRQ1_EN_DIS                         (0X0000U)      /* Disable IRQ1 Interrupt */
#define ENUM_PLA_PLA_IRQ0_IRQ1_EN_EN                          (0X0001U)      /* Enable IRQ1 Interrupt */
#define ENUM_PLA_PLA_IRQ0_IRQ0_EN_DIS                         (0X0000U)      /* Disable IRQ0 Interrupt */
#define ENUM_PLA_PLA_IRQ0_IRQ0_EN_EN                          (0X0001U)      /* Enable IRQ0 Interrupt */

/* ----------------------------------------------------------------------------------------------------
          PLA_IRQ1                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_IRQ1_IRQ2_SRC                            (0U)           /* IRQ2 Source Select */
#define BITL_PLA_PLA_IRQ1_IRQ2_SRC                            (4U)           /* IRQ2 Source Select */
#define BITM_PLA_PLA_IRQ1_IRQ2_SRC                            (0X000FU)      /* IRQ2 Source Select */
#define BITP_PLA_PLA_IRQ1_IRQ2_EN                             (4U)           /* IRQ2 Enable */
#define BITL_PLA_PLA_IRQ1_IRQ2_EN                             (1U)           /* IRQ2 Enable */
#define BITM_PLA_PLA_IRQ1_IRQ2_EN                             (0X0010U)      /* IRQ2 Enable */
#define BITP_PLA_PLA_IRQ1_IRQ3_SRC                            (8U)           /* IRQ3 Source Select */
#define BITL_PLA_PLA_IRQ1_IRQ3_SRC                            (4U)           /* IRQ3 Source Select */
#define BITM_PLA_PLA_IRQ1_IRQ3_SRC                            (0X0F00U)      /* IRQ3 Source Select */
#define BITP_PLA_PLA_IRQ1_IRQ3_EN                             (12U)          /* IRQ3 Enable */
#define BITL_PLA_PLA_IRQ1_IRQ3_EN                             (1U)           /* IRQ3 Enable */
#define BITM_PLA_PLA_IRQ1_IRQ3_EN                             (0X1000U)      /* IRQ3 Enable */

#define ENUM_PLA_PLA_IRQ1_IRQ3_EN_DIS                         (0X0000U)      /* Disable IRQ3 Interrupt */
#define ENUM_PLA_PLA_IRQ1_IRQ3_EN_EN                          (0X0001U)      /* Enable IRQ3 Interrupt */
#define ENUM_PLA_PLA_IRQ1_IRQ2_EN_DIS                         (0X0000U)      /* Disable IRQ2 Interrupt */
#define ENUM_PLA_PLA_IRQ1_IRQ2_EN_EN                          (0X0001U)      /* Enable IRQ2 Interrupt */

