mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PLA_DOUT1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_DOUT1_E16                                (0U)           /* Output Bit from Element 16 */
#define BITL_PLA_PLA_DOUT1_E16                                (1U)           /* Output Bit from Element 16 */
#define BITM_PLA_PLA_DOUT1_E16                                (0X0001U)      /* Output Bit from Element 16 */
#define BITP_PLA_PLA_DOUT1_E17                                (1U)           /* Output Bit from Element 17 */
#define BITL_PLA_PLA_DOUT1_E17                                (1U)           /* Output Bit from Element 17 */
#define BITM_PLA_PLA_DOUT1_E17                                (0X0002U)      /* Output Bit from Element 17 */
#define BITP_PLA_PLA_DOUT1_E18                                (2U)           /* Output Bit from Element 18 */
#define BITL_PLA_PLA_DOUT1_E18                                (1U)           /* Output Bit from Element 18 */
#define BITM_PLA_PLA_DOUT1_E18                                (0X0004U)      /* Output Bit from Element 18 */
#define BITP_PLA_PLA_DOUT1_E19                                (3U)           /* Output Bit from Element 19 */
#define BITL_PLA_PLA_DOUT1_E19                                (1U)           /* Output Bit from Element 19 */
#define BITM_PLA_PLA_DOUT1_E19                                (0X0008U)      /* Output Bit from Element 19 */
#define BITP_PLA_PLA_DOUT1_E20                                (4U)           /* Output Bit from Element 20 */
#define BITL_PLA_PLA_DOUT1_E20                                (1U)           /* Output Bit from Element 20 */
#define BITM_PLA_PLA_DOUT1_E20                                (0X0010U)      /* Output Bit from Element 20 */
#define BITP_PLA_PLA_DOUT1_E21                                (5U)           /* Output Bit from Element 21 */
#define BITL_PLA_PLA_DOUT1_E21                                (1U)           /* Output Bit from Element 21 */
#define BITM_PLA_PLA_DOUT1_E21                                (0X0020U)      /* Output Bit from Element 21 */
#define BITP_PLA_PLA_DOUT1_E22                                (6U)           /* Output Bit from Element 22 */
#define BITL_PLA_PLA_DOUT1_E22                                (1U)           /* Output Bit from Element 22 */
#define BITM_PLA_PLA_DOUT1_E22                                (0X0040U)      /* Output Bit from Element 22 */
#define BITP_PLA_PLA_DOUT1_E23                                (7U)           /* Output Bit from Element 23 */
#define BITL_PLA_PLA_DOUT1_E23                                (1U)           /* Output Bit from Element 23 */
#define BITM_PLA_PLA_DOUT1_E23                                (0X0080U)      /* Output Bit from Element 23 */
#define BITP_PLA_PLA_DOUT1_E24                                (8U)           /* Output Bit from Element 24 */
#define BITL_PLA_PLA_DOUT1_E24                                (1U)           /* Output Bit from Element 24 */
#define BITM_PLA_PLA_DOUT1_E24                                (0X0100U)      /* Output Bit from Element 24 */
#define BITP_PLA_PLA_DOUT1_E25                                (9U)           /* Output Bit from Element 25 */
#define BITL_PLA_PLA_DOUT1_E25                                (1U)           /* Output Bit from Element 25 */
#define BITM_PLA_PLA_DOUT1_E25                                (0X0200U)      /* Output Bit from Element 25 */
#define BITP_PLA_PLA_DOUT1_E26                                (10U)          /* Output Bit from Element 26 */
#define BITL_PLA_PLA_DOUT1_E26                                (1U)           /* Output Bit from Element 26 */
#define BITM_PLA_PLA_DOUT1_E26                                (0X0400U)      /* Output Bit from Element 26 */
#define BITP_PLA_PLA_DOUT1_E27                                (11U)          /* Output Bit from Element 27 */
#define BITL_PLA_PLA_DOUT1_E27                                (1U)           /* Output Bit from Element 27 */
#define BITM_PLA_PLA_DOUT1_E27                                (0X0800U)      /* Output Bit from Element 27 */
#define BITP_PLA_PLA_DOUT1_E28                                (12U)          /* Output Bit from Element 28 */
#define BITL_PLA_PLA_DOUT1_E28                                (1U)           /* Output Bit from Element 28 */
#define BITM_PLA_PLA_DOUT1_E28                                (0X1000U)      /* Output Bit from Element 28 */
#define BITP_PLA_PLA_DOUT1_E29                                (13U)          /* Output Bit from Element 29 */
#define BITL_PLA_PLA_DOUT1_E29                                (1U)           /* Output Bit from Element 29 */
#define BITM_PLA_PLA_DOUT1_E29                                (0X2000U)      /* Output Bit from Element 29 */
#define BITP_PLA_PLA_DOUT1_E30                                (14U)          /* Output Bit from Element 30 */
#define BITL_PLA_PLA_DOUT1_E30                                (1U)           /* Output Bit from Element 30 */
#define BITM_PLA_PLA_DOUT1_E30                                (0X4000U)      /* Output Bit from Element 30 */
#define BITP_PLA_PLA_DOUT1_E31                                (15U)          /* Output Bit from Element 31 */
#define BITL_PLA_PLA_DOUT1_E31                                (1U)           /* Output Bit from Element 31 */
#define BITM_PLA_PLA_DOUT1_E31                                (0X8000U)      /* Output Bit from Element 31 */

/* ----------------------------------------------------------------------------------------------------
          PLA_LCK                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_LCK_LOCKED                               (0U)           /* Set to Disable Writing to Registers */
#define BITL_PLA_PLA_LCK_LOCKED                               (1U)           /* Set to Disable Writing to Registers */
#define BITM_PLA_PLA_LCK_LOCKED                               (0X0001U)      /* Set to Disable Writing to Registers */

#define ENUM_PLA_PLA_LCK_LOCKED_DIS                           (0X0000U)      /* Writing to Registers Allowed */
#define ENUM_PLA_PLA_LCK_LOCKED_EN                            (0X0001U)      /* Writing to Registers Disabled */

