mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PLA_IRQTYPE                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_IRQTYPE_IRQ0_TYPE                        (0U)           /* IRQ0 and DMA Request 0 Type */
#define BITL_PLA_PLA_IRQTYPE_IRQ0_TYPE                        (2U)           /* IRQ0 and DMA Request 0 Type */
#define BITM_PLA_PLA_IRQTYPE_IRQ0_TYPE                        (0X0003U)      /* IRQ0 and DMA Request 0 Type */
#define BITP_PLA_PLA_IRQTYPE_IRQ1_TYPE                        (2U)           /* IRQ1 and DMA Request 1Type */
#define BITL_PLA_PLA_IRQTYPE_IRQ1_TYPE                        (2U)           /* IRQ1 and DMA Request 1Type */
#define BITM_PLA_PLA_IRQTYPE_IRQ1_TYPE                        (0X000CU)      /* IRQ1 and DMA Request 1Type */
#define BITP_PLA_PLA_IRQTYPE_IRQ2_TYPE                        (4U)           /* IRQ2 and DMA Request 2 Type */
#define BITL_PLA_PLA_IRQTYPE_IRQ2_TYPE                        (2U)           /* IRQ2 and DMA Request 2 Type */
#define BITM_PLA_PLA_IRQTYPE_IRQ2_TYPE                        (0X0030U)      /* IRQ2 and DMA Request 2 Type */
#define BITP_PLA_PLA_IRQTYPE_IRQ3_TYPE                        (6U)           /* IRQ3 and DMA Request 3 Type */
#define BITL_PLA_PLA_IRQTYPE_IRQ3_TYPE                        (2U)           /* IRQ3 and DMA Request 3 Type */
#define BITM_PLA_PLA_IRQTYPE_IRQ3_TYPE                        (0X00C0U)      /* IRQ3 and DMA Request 3 Type */

#define ENUM_PLA_PLA_IRQTYPE_IRQ3_TYPE_HIGH_LEVEL             (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ3_TYPE_RISING_EDGE            (0X0001U)      /* Rising Edge Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ3_TYPE_FALLING_EDGE           (0X0003U)      /* Falling Edge Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ2_TYPE_HIGH_LEVEL             (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ2_TYPE_RISING_EDGE            (0X0001U)      /* Rising Edge Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ2_TYPE_FALLING_EDGE           (0X0003U)      /* Falling Edge Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ1_TYPE_HIGH_LEVEL             (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ1_TYPE_RISING_EDGE            (0X0001U)      /* Rising Edge Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ1_TYPE_FALLING_EDGE           (0X0003U)      /* Falling Edge Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ0_TYPE_HIGH_LEVEL             (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ0_TYPE_RISING_EDGE            (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_PLA_PLA_IRQTYPE_IRQ0_TYPE_FALLING_EDGE           (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */

#endif  /* end ifndef PLA_ADDR_RDEF_H_ */


#ifndef DMAREQ_ADDR_RDEF_H_
#define DMAREQ_ADDR_RDEF_H_    /* DMAREQ: Your module description, here. */

/* ====================================================================================================
        DMAREQ Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_DMAREQ                                              (0X40007000U)    /* dmareq: */

#define MASK_DMAREQ                                              (0X000000FFU)    /* DMAREQ: Your module description, here. */

/* ====================================================================================================
        DMAREQ Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_DMAREQ_REQEN                                        (0X00U)    /* GPT/GPT32 and PLA DMA Request Enable */
#define IDX_DMAREQ_REQ0SEL                                      (0X04U)    /* GPT/GPT32 and PLA DMA Request 0 Select */
#define IDX_DMAREQ_REQ1SEL                                      (0X08U)    /* GPT/GPT32 and PLA DMA Request 1 Select */
#define IDX_DMAREQ_PLAREQEN                                     (0X0CU)    /* PLA DMA Requests Enable */
#define IDX_DMAREQ_GPTREQEN                                     (0X10U)    /* GPT/GPT32 DMA Requests Enable */
#define IDX_DMAREQ_GPT_REQ_TYPE                                 (0X14U)    /* GPT and GPT32 Require Type */

/* ====================================================================================================
        DMAREQ Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_DMAREQ_REQEN                                        (0X0) 
#define RSTVAL_DMAREQ_REQ0SEL                                      (0X0) 
#define RSTVAL_DMAREQ_REQ1SEL                                      (0X0) 
#define RSTVAL_DMAREQ_PLAREQEN                                     (0X0) 
#define RSTVAL_DMAREQ_GPTREQEN                                     (0X0) 
#define RSTVAL_DMAREQ_GPT_REQ_TYPE                                 (0X0) 

/* ====================================================================================================
        DMAREQ Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

