mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          REQEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_REQEN_GPLA_DMA_EN0                        (0U)           /* GPT/GPT32 and PLA DMA Request 0 Enable */
#define BITL_DMAREQ_REQEN_GPLA_DMA_EN0                        (1U)           /* GPT/GPT32 and PLA DMA Request 0 Enable */
#define BITM_DMAREQ_REQEN_GPLA_DMA_EN0                        (0X01U)        /* GPT/GPT32 and PLA DMA Request 0 Enable */
#define BITP_DMAREQ_REQEN_GPLA_DMA_EN1                        (1U)           /* GPT/GPT32 and PLA DMA Request 1 Enable */
#define BITL_DMAREQ_REQEN_GPLA_DMA_EN1                        (1U)           /* GPT/GPT32 and PLA DMA Request 1 Enable */
#define BITM_DMAREQ_REQEN_GPLA_DMA_EN1                        (0X02U)        /* GPT/GPT32 and PLA DMA Request 1 Enable */

/* ----------------------------------------------------------------------------------------------------
          REQ0SEL                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_REQ0SEL_DMA_REQ0_SEL                      (0U)           /* GPT/GPT32 and PLA DMA Request 0 Source Select */
#define BITL_DMAREQ_REQ0SEL_DMA_REQ0_SEL                      (4U)           /* GPT/GPT32 and PLA DMA Request 0 Source Select */
#define BITM_DMAREQ_REQ0SEL_DMA_REQ0_SEL                      (0X0FU)        /* GPT/GPT32 and PLA DMA Request 0 Source Select */

#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ0             (0X00U)        /* PLA DMA Request 0 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ1             (0X01U)        /* PLA DMA Request 1 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ2             (0X02U)        /* PLA DMA Request 2 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ3             (0X03U)        /* PLA DMA Request 3 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT_REQ0             (0X04U)        /* GPT 0 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT_REQ1             (0X05U)        /* GPT 1 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT_REQ2             (0X06U)        /* GPT 2 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT32_REQ0           (0X07U)        /* GPT32 0 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT32_REQ1           (0X08U)        /* GPT32 1 DMA Request */

/* ----------------------------------------------------------------------------------------------------
          REQ1SEL                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_REQ1SEL_DMA_REQ1_SEL                      (0U)           /* GPT/GPT32 and PLA DMA Request 1 Source Select */
#define BITL_DMAREQ_REQ1SEL_DMA_REQ1_SEL                      (4U)           /* GPT/GPT32 and PLA DMA Request 1 Source Select */
#define BITM_DMAREQ_REQ1SEL_DMA_REQ1_SEL                      (0X0FU)        /* GPT/GPT32 and PLA DMA Request 1 Source Select */

#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ0             (0X00U)        /* PLA DMA Request 0 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ1             (0X01U)        /* PLA DMA Request 1 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ2             (0X02U)        /* PLA DMA Request 2 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ3             (0X03U)        /* PLA DMA Request 3 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT_REQ0             (0X04U)        /* GPT 0 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT_REQ1             (0X05U)        /* GPT 1 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT_REQ2             (0X06U)        /* GPT 2 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT32_REQ0           (0X07U)        /* GPT32 0 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT32_REQ1           (0X08U)        /* GPT32 1 DMA Request */

/* ----------------------------------------------------------------------------------------------------
          PLAREQEN                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ0_EN                  (0U)           /* PLA DMA Request 0 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ0_EN                  (1U)           /* PLA DMA Request 0 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ0_EN                  (0X01U)        /* PLA DMA Request 0 Enable */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ1_EN                  (1U)           /* PLA DMA Request 1 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ1_EN                  (1U)           /* PLA DMA Request 1 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ1_EN                  (0X02U)        /* PLA DMA Request 1 Enable */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ2_EN                  (2U)           /* PLA DMA Request 2 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ2_EN                  (1U)           /* PLA DMA Request 2 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ2_EN                  (0X04U)        /* PLA DMA Request 2 Enable */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ3_EN                  (3U)           /* PLA DMA Request 3 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ3_EN                  (1U)           /* PLA DMA Request 3 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ3_EN                  (0X08U)        /* PLA DMA Request 3 Enable */

/* ----------------------------------------------------------------------------------------------------
          GPTREQEN                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_GPTREQEN_GPT0DMAEN                        (0U)           /* GPT 0 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT0DMAEN                        (1U)           /* GPT 0 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT0DMAEN                        (0X01U)        /* GPT 0 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPT1DMAEN                        (1U)           /* GPT 1 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT1DMAEN                        (1U)           /* GPT 1 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT1DMAEN                        (0X02U)        /* GPT 1 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPT2DMAEN                        (2U)           /* GPT 2 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT2DMAEN                        (1U)           /* GPT 2 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT2DMAEN                        (0X04U)        /* GPT 2 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPTH0DMAEN                       (3U)           /* GPT32 0 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPTH0DMAEN                       (1U)           /* GPT32 0 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPTH0DMAEN                       (0X08U)        /* GPT32 0 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPTH1DMAEN                       (4U)           /* GPT32 1 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPTH1DMAEN                       (1U)           /* GPT32 1 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPTH1DMAEN                       (0X10U)        /* GPT32 1 DMA Request Enable */

