mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          GPT_REQ_TYPE                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE                (0U)           /* GPT Req0 DMA Require Type */
#define BITL_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE                (2U)           /* GPT Req0 DMA Require Type */
#define BITM_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE                (0X0003U)      /* GPT Req0 DMA Require Type */
#define BITP_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE                (2U)           /* GPT Req1 DMA Require Type */
#define BITL_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE                (2U)           /* GPT Req1 DMA Require Type */
#define BITM_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE                (0X000CU)      /* GPT Req1 DMA Require Type */
#define BITP_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE                (4U)           /* GPT Req2 DMA Require Type */
#define BITL_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE                (2U)           /* GPT Req2 DMA Require Type */
#define BITM_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE                (0X0030U)      /* GPT Req2 DMA Require Type */
#define BITP_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE              (6U)           /* GPT32 Req0 DMA Require Type */
#define BITL_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE              (2U)           /* GPT32 Req0 DMA Require Type */
#define BITM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE              (0X00C0U)      /* GPT32 Req0 DMA Require Type */
#define BITP_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE              (8U)           /* GPT32 Req1 DMA Require Type */
#define BITL_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE              (2U)           /* GPT32 Req1 DMA Require Type */
#define BITM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE              (0X0300U)      /* GPT32 Req1 DMA Require Type */

#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE_HIGH_LEVEL   (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE_RISING_EDGE  (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE_LOW_LEVEL    (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ1_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE_HIGH_LEVEL   (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE_RISING_EDGE  (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE_LOW_LEVEL    (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT32_REQ0_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE_HIGH_LEVEL     (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE_RISING_EDGE    (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE_LOW_LEVEL      (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ2_TYPE_FALLING_EDGE   (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE_HIGH_LEVEL     (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE_RISING_EDGE    (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE_LOW_LEVEL      (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ1_TYPE_FALLING_EDGE   (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE_HIGH_LEVEL     (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE_RISING_EDGE    (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE_LOW_LEVEL      (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_REQ_TYPE_GPT_REQ0_TYPE_FALLING_EDGE   (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */

#endif  /* end ifndef DMAREQ_ADDR_RDEF_H_ */


#ifndef UART_ADDR_RDEF_H_
#define UART_ADDR_RDEF_H_    /* UART: Universal Asynchronous Receiver/Transmitter */

/* ====================================================================================================
        UART Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_UART0                                               (0X40020000U)    /* uart0: */
#define INST_UART1                                               (0X40020400U)    /* uart1: */

#define MASK_UART                                                (0X000000FFU)    /* UART: Universal Asynchronous Receiver/Transmitter */

/* ====================================================================================================
        UART Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_UART_RX                                             (0X00U)    /* Receive/transfer Buffer Register */
#define IDX_UART_IEN                                            (0X04U)    /* Interrupt Enable */
#define IDX_UART_IIR                                            (0X08U)    /* Interrupt ID */
#define IDX_UART_LCR                                            (0X0CU)    /* Line Control */
#define IDX_UART_MCR                                            (0X10U)    /* Modem Control */
#define IDX_UART_LSR                                            (0X14U)    /* Line Status */
#define IDX_UART_MSR                                            (0X18U)    /* Modem Status */
#define IDX_UART_SCR                                            (0X1CU)    /* Scratch Buffer */
#define IDX_UART_FCR                                            (0X20U)    /* FIFO Control */
#define IDX_UART_FBR                                            (0X24U)    /* Fractional Baud Rate */
#define IDX_UART_DIV                                            (0X28U)    /* Baudrate Divider */
#define IDX_UART_LCR2                                           (0X2CU)    /* Second Line Control */
#define IDX_UART_CTL                                            (0X30U)    /* UART Control Register */
#define IDX_UART_RFC                                            (0X34U)    /* RX FIFO Byte Count */
#define IDX_UART_TFC                                            (0X38U)    /* TX FIFO Byte Count */
#define IDX_UART_RSC                                            (0X3CU)    /* RS485 Half-duplex Control */
#define IDX_UART_ACR                                            (0X40U)    /* Auto Baud Control */
#define IDX_UART_ASRL                                           (0X44U)    /* Auto Baud Status (Low) */
#define IDX_UART_ASRH                                           (0X48U)    /* Auto Baud Status (High) */

