mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        UART Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_UART_RX                                             (0X0) 
#define RSTVAL_UART_IEN                                            (0X0) 
#define RSTVAL_UART_IIR                                            (0X1) 
#define RSTVAL_UART_LCR                                            (0X0) 
#define RSTVAL_UART_MCR                                            (0X0) 
#define RSTVAL_UART_LSR                                            (0X60) 
#define RSTVAL_UART_SCR                                            (0X0) 
#define RSTVAL_UART_FCR                                            (0X0) 
#define RSTVAL_UART_FBR                                            (0X0) 
#define RSTVAL_UART_DIV                                            (0X0) 
#define RSTVAL_UART_LCR2                                           (0X2) 
#define RSTVAL_UART_CTL                                            (0X100) 
#define RSTVAL_UART_RFC                                            (0X0) 
#define RSTVAL_UART_TFC                                            (0X0) 
#define RSTVAL_UART_RSC                                            (0X0) 
#define RSTVAL_UART_ACR                                            (0X0) 
#define RSTVAL_UART_ASRL                                           (0X0) 
#define RSTVAL_UART_ASRH                                           (0X0) 

/* ====================================================================================================
        UART Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          RX                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_RX_RBR                                      (0U)           /* Receive Buffer Register */
#define BITL_UART_RX_RBR                                      (8U)           /* Receive Buffer Register */
#define BITM_UART_RX_RBR                                      (0X00FFU)      /* Receive Buffer Register */

/* ----------------------------------------------------------------------------------------------------
          IEN                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_IEN_ERBFI                                   (0U)           /* Receive Buffer Full Interrupt */
#define BITL_UART_IEN_ERBFI                                   (1U)           /* Receive Buffer Full Interrupt */
#define BITM_UART_IEN_ERBFI                                   (0X0001U)      /* Receive Buffer Full Interrupt */
#define BITP_UART_IEN_ETBEI                                   (1U)           /* Transmit Buffer Empty Interrupt */
#define BITL_UART_IEN_ETBEI                                   (1U)           /* Transmit Buffer Empty Interrupt */
#define BITM_UART_IEN_ETBEI                                   (0X0002U)      /* Transmit Buffer Empty Interrupt */
#define BITP_UART_IEN_ELSI                                    (2U)           /* Rx Status Interrupt */
#define BITL_UART_IEN_ELSI                                    (1U)           /* Rx Status Interrupt */
#define BITM_UART_IEN_ELSI                                    (0X0004U)      /* Rx Status Interrupt */
#define BITP_UART_IEN_EDSSI                                   (3U)           /* Modem Status Interrupt */
#define BITL_UART_IEN_EDSSI                                   (1U)           /* Modem Status Interrupt */
#define BITM_UART_IEN_EDSSI                                   (0X0008U)      /* Modem Status Interrupt */
#define BITP_UART_IEN_EDMAT                                   (4U)           /* DMA Requests in Transmit Mode */
#define BITL_UART_IEN_EDMAT                                   (1U)           /* DMA Requests in Transmit Mode */
#define BITM_UART_IEN_EDMAT                                   (0X0010U)      /* DMA Requests in Transmit Mode */
#define BITP_UART_IEN_EDMAR                                   (5U)           /* DMA Requests in Receive Mode */
#define BITL_UART_IEN_EDMAR                                   (1U)           /* DMA Requests in Receive Mode */
#define BITM_UART_IEN_EDMAR                                   (0X0020U)      /* DMA Requests in Receive Mode */

#define ENUM_UART_IEN_EDMAR_DIS                               (0X0000U)      /* DMA Requests Disabled */
#define ENUM_UART_IEN_EDMAR_EN                                (0X0001U)      /* DMA Requests Enabled */
#define ENUM_UART_IEN_EDMAT_DIS                               (0X0000U)      /* DMA Requests are Disabled */
#define ENUM_UART_IEN_EDMAT_EN                                (0X0001U)      /* DMA Requests are Enabled */
#define ENUM_UART_IEN_EDSSI_DIS                               (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_EDSSI_EN                                (0X0001U)      /* Interrupt Enabled */
#define ENUM_UART_IEN_ELSI_DIS                                (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_ELSI_EN                                 (0X0001U)      /* Interrupt Enabled */
#define ENUM_UART_IEN_ETBEI_DIS                               (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_ETBEI_EN                                (0X0001U)      /* Interrupt Enabled */
#define ENUM_UART_IEN_ERBFI_DIS                               (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_ERBFI_EN                                (0X0001U)      /* Interrupt Enabled */

