mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          LSR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_LSR_DR                                      (0U)           /* Data Ready */
#define BITL_UART_LSR_DR                                      (1U)           /* Data Ready */
#define BITM_UART_LSR_DR                                      (0X0001U)      /* Data Ready */
#define BITP_UART_LSR_OE                                      (1U)           /* Overrun Error */
#define BITL_UART_LSR_OE                                      (1U)           /* Overrun Error */
#define BITM_UART_LSR_OE                                      (0X0002U)      /* Overrun Error */
#define BITP_UART_LSR_PE                                      (2U)           /* Parity Error */
#define BITL_UART_LSR_PE                                      (1U)           /* Parity Error */
#define BITM_UART_LSR_PE                                      (0X0004U)      /* Parity Error */
#define BITP_UART_LSR_FE                                      (3U)           /* Framing Error */
#define BITL_UART_LSR_FE                                      (1U)           /* Framing Error */
#define BITM_UART_LSR_FE                                      (0X0008U)      /* Framing Error */
#define BITP_UART_LSR_BI                                      (4U)           /* Break Indicator */
#define BITL_UART_LSR_BI                                      (1U)           /* Break Indicator */
#define BITM_UART_LSR_BI                                      (0X0010U)      /* Break Indicator */
#define BITP_UART_LSR_THRE                                    (5U)           /* Transmit Register Empty */
#define BITL_UART_LSR_THRE                                    (1U)           /* Transmit Register Empty */
#define BITM_UART_LSR_THRE                                    (0X0020U)      /* Transmit Register Empty */
#define BITP_UART_LSR_TEMT                                    (6U)           /* Transmit and Shift Register Empty Status */
#define BITL_UART_LSR_TEMT                                    (1U)           /* Transmit and Shift Register Empty Status */
#define BITM_UART_LSR_TEMT                                    (0X0040U)      /* Transmit and Shift Register Empty Status */
#define BITP_UART_LSR_FIFOERR                                 (7U)           /* FIFO Error */
#define BITL_UART_LSR_FIFOERR                                 (1U)           /* FIFO Error */
#define BITM_UART_LSR_FIFOERR                                 (0X0080U)      /* FIFO Error */

#define ENUM_UART_LSR_TEMT_NOTEMPTY                           (0X0000U)      /* Tx Register Has Been Written to and Contains Data to Be Transmitted. Care Should Be Taken Not to Overwrite Its Value. */
#define ENUM_UART_LSR_TEMT_EMPTY                              (0X0001U)      /* Tx Register and the Transmit Shift Register are Empty and It is Safe to Write New Data to the Tx Register. Data Has Been Transmitted. */
#define ENUM_UART_LSR_THRE_NOTEMPTY                           (0X0000U)      /* Tx Register Has Been Written to and Contains Data to Be Transmitted. Care Should Be Taken Not to Overwrite Its Value. */
#define ENUM_UART_LSR_THRE_EMPTY                              (0X0001U)      /* Tx Register is Empty and It is Safe to Write New Data to Tx Register the Previous Data May Not Have Been Transmitted Yet and Can Still Be Present in the Shift Register. */
#define ENUM_UART_LSR_FE_OKAY                                 (0X0000U)      /* No Invalid Stop Bit Was Detected. */
#define ENUM_UART_LSR_FE_INVALIDSTOP                          (0X0001U)      /* An Invalid Stop Bit Was Detected on a Received Word. */
#define ENUM_UART_LSR_PE_NOERR                                (0X0000U)      /* No Parity Error Was Detected. */
#define ENUM_UART_LSR_PE_ERRORS                               (0X0001U)      /* A Parity Error Occurred on a Received Word. */
#define ENUM_UART_LSR_OE_OKAY                                 (0X0000U)      /* Receive Data Has Not Been Overwritten. */
#define ENUM_UART_LSR_OE_OVERWRITTEN                          (0X0001U)      /* Receive Data Was Overwritten by New Data Before Rx Register Was Read. */
#define ENUM_UART_LSR_DR_NOTREADY                             (0X0000U)      /* Rx Register Does Not Contain New Receive Data. */
#define ENUM_UART_LSR_DR_READY                                (0X0001U)      /* Rx Register Contains Receive Data That Should Be Read. */

/* ----------------------------------------------------------------------------------------------------
          MSR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_MSR_DCTS                                    (0U)           /* Delta CTS */
#define BITL_UART_MSR_DCTS                                    (1U)           /* Delta CTS */
#define BITM_UART_MSR_DCTS                                    (0X0001U)      /* Delta CTS */
#define BITP_UART_MSR_DDSR                                    (1U)           /* Delta DSR */
#define BITL_UART_MSR_DDSR                                    (1U)           /* Delta DSR */
#define BITM_UART_MSR_DDSR                                    (0X0002U)      /* Delta DSR */
#define BITP_UART_MSR_TERI                                    (2U)           /* Trailing Edge RI */
#define BITL_UART_MSR_TERI                                    (1U)           /* Trailing Edge RI */
#define BITM_UART_MSR_TERI                                    (0X0004U)      /* Trailing Edge RI */
#define BITP_UART_MSR_DDCD                                    (3U)           /* Delta DCD */
#define BITL_UART_MSR_DDCD                                    (1U)           /* Delta DCD */
#define BITM_UART_MSR_DDCD                                    (0X0008U)      /* Delta DCD */
#define BITP_UART_MSR_CTS                                     (4U)           /* Clear to Send */
#define BITL_UART_MSR_CTS                                     (1U)           /* Clear to Send */
#define BITM_UART_MSR_CTS                                     (0X0010U)      /* Clear to Send */
#define BITP_UART_MSR_DSR                                     (5U)           /* Data Set Ready */
#define BITL_UART_MSR_DSR                                     (1U)           /* Data Set Ready */
#define BITM_UART_MSR_DSR                                     (0X0020U)      /* Data Set Ready */
#define BITP_UART_MSR_RI                                      (6U)           /* Ring Indicator */
#define BITL_UART_MSR_RI                                      (1U)           /* Ring Indicator */
#define BITM_UART_MSR_RI                                      (0X0040U)      /* Ring Indicator */
#define BITP_UART_MSR_DCD                                     (7U)           /* Data Carrier Detect */
#define BITL_UART_MSR_DCD                                     (1U)           /* Data Carrier Detect */
#define BITM_UART_MSR_DCD                                     (0X0080U)      /* Data Carrier Detect */

#define ENUM_UART_MSR_DCD_HIGH                                (0X0000U)      /* NDCD is Currently Logic High. */
#define ENUM_UART_MSR_DCD_LOW                                 (0X0001U)      /* NDCD is Currently Logic Low. */
#define ENUM_UART_MSR_RI_HIGH                                 (0X0000U)      /* NRI is Currently Logic High. */
#define ENUM_UART_MSR_RI_LOW                                  (0X0001U)      /* NRI is Currently Logic Low. */
#define ENUM_UART_MSR_DSR_HIGH                                (0X0000U)      /* NDSR is Currently Logic High */
#define ENUM_UART_MSR_DSR_LOW                                 (0X0001U)      /* NDSR is Currently Logic Low */
#define ENUM_UART_MSR_CTS_HIGH                                (0X0000U)      /* NCTS is Currently Logic High */
#define ENUM_UART_MSR_CTS_LOW                                 (0X0001U)      /* NCTS is Currently Logic Low */
#define ENUM_UART_MSR_DDCD_NOCHANGE                           (0X0000U)      /* Data Carrier Detect Bit Has Not Changed State Since MSR Register Was Last Read */
#define ENUM_UART_MSR_DDCD_CHANGED                            (0X0001U)      /* Data Carrier Detect Bit Changed State Since MSR Register Last Read */
#define ENUM_UART_MSR_TERI_NOTCHANGED                         (0X0000U)      /* Ring Indicator Bit Has Not Changed from 0 to 1 Since MSR Register Last Read */
#define ENUM_UART_MSR_TERI_CHANGED                            (0X0001U)      /* Ring Indicator Bit Changed from 0 to 1 Since MSR Register Last Read */
#define ENUM_UART_MSR_DDSR_NOCHANGE                           (0X0000U)      /* Data Set Ready Bit Has Not Changed State Since MSR Register Was Last Read */
#define ENUM_UART_MSR_DDSR_CHANGED                            (0X0001U)      /* Data Set Ready Bit Changed State Since MSR Register Last Read */
#define ENUM_UART_MSR_DCTS_NOCHANGE                           (0X0000U)      /* Clear to Send Bit Has Not Changed State Since MSR Register Was Last Read */
#define ENUM_UART_MSR_DCTS_CHANGED                            (0X0001U)      /* Clear to Send Bit Changed State Since MSR Register Last Read */

