mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          CTL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_CTL_FORCECLK                                (1U)           /* Force UCLK on */
#define BITL_UART_CTL_FORCECLK                                (1U)           /* Force UCLK on */
#define BITM_UART_CTL_FORCECLK                                (0X0002U)      /* Force UCLK on */
#define BITP_UART_CTL_RXINV                                   (4U)           /* Invert Receiver Line */
#define BITL_UART_CTL_RXINV                                   (1U)           /* Invert Receiver Line */
#define BITM_UART_CTL_RXINV                                   (0X0010U)      /* Invert Receiver Line */
#define BITP_UART_CTL_REV                                     (8U)           /* UART Revision ID */
#define BITL_UART_CTL_REV                                     (8U)           /* UART Revision ID */
#define BITM_UART_CTL_REV                                     (0XFF00U)      /* UART Revision ID */

#define ENUM_UART_CTL_RXINV_EN000                             (0X0000U)      /* Don't Invert Receiver Line (idling High) */
#define ENUM_UART_CTL_RXINV_EN001                             (0X0001U)      /* Invert Receiver Line (idling Low) */
#define ENUM_UART_CTL_FORCECLK_GATEUCLK                       (0X0000U)      /* UCLK Automatically Gated */
#define ENUM_UART_CTL_FORCECLK_UCLKEN                         (0X0001U)      /* UCLK Always Working */

/* ----------------------------------------------------------------------------------------------------
          RFC                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_RFC_RFC                                     (0U)           /* Current RX FIFO Data Bytes */
#define BITL_UART_RFC_RFC                                     (5U)           /* Current RX FIFO Data Bytes */
#define BITM_UART_RFC_RFC                                     (0X001FU)      /* Current RX FIFO Data Bytes */

/* ----------------------------------------------------------------------------------------------------
          TFC                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_TFC_TFC                                     (0U)           /* Current TX FIFO Data Bytes */
#define BITL_UART_TFC_TFC                                     (5U)           /* Current TX FIFO Data Bytes */
#define BITM_UART_TFC_TFC                                     (0X001FU)      /* Current TX FIFO Data Bytes */

/* ----------------------------------------------------------------------------------------------------
          RSC                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_RSC_OENP                                    (0U)           /* SOUT_EN Polarity */
#define BITL_UART_RSC_OENP                                    (1U)           /* SOUT_EN Polarity */
#define BITM_UART_RSC_OENP                                    (0X0001U)      /* SOUT_EN Polarity */
#define BITP_UART_RSC_OENSP                                   (1U)           /* SOUT_EN De-assert Before Full Stop Bit(s) */
#define BITL_UART_RSC_OENSP                                   (1U)           /* SOUT_EN De-assert Before Full Stop Bit(s) */
#define BITM_UART_RSC_OENSP                                   (0X0002U)      /* SOUT_EN De-assert Before Full Stop Bit(s) */
#define BITP_UART_RSC_DISRX                                   (2U)           /* Disable RX When Transmitting */
#define BITL_UART_RSC_DISRX                                   (1U)           /* Disable RX When Transmitting */
#define BITM_UART_RSC_DISRX                                   (0X0004U)      /* Disable RX When Transmitting */
#define BITP_UART_RSC_DISTX                                   (3U)           /* Hold off TX When Receiving */
#define BITL_UART_RSC_DISTX                                   (1U)           /* Hold off TX When Receiving */
#define BITM_UART_RSC_DISTX                                   (0X0008U)      /* Hold off TX When Receiving */

#define ENUM_UART_RSC_OENSP_FULLBIT                           (0X0000U)      /* SOUT_EN De-assert Same Time as Full Stop Bit(s) */
#define ENUM_UART_RSC_OENSP_HALFBIT                           (0X0001U)      /* SOUT_EN De-assert Half-bit Earlier Than Full Stop Bit(s) */
#define ENUM_UART_RSC_OENP_HIGHACTIVE                         (0X0000U)      /* High Active */
#define ENUM_UART_RSC_OENP_LOWACTIVE                          (0X0001U)      /* Low Active */

/* ----------------------------------------------------------------------------------------------------
          ACR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_ACR_ABE                                     (0U)           /* Auto Baud Enable */
#define BITL_UART_ACR_ABE                                     (1U)           /* Auto Baud Enable */
#define BITM_UART_ACR_ABE                                     (0X0001U)      /* Auto Baud Enable */
#define BITP_UART_ACR_DNIEN                                   (1U)           /* Enable Done Interrupt */
#define BITL_UART_ACR_DNIEN                                   (1U)           /* Enable Done Interrupt */
#define BITM_UART_ACR_DNIEN                                   (0X0002U)      /* Enable Done Interrupt */
#define BITP_UART_ACR_TOIEN                                   (2U)           /* Enable Time-out Interrupt */
#define BITL_UART_ACR_TOIEN                                   (1U)           /* Enable Time-out Interrupt */
#define BITM_UART_ACR_TOIEN                                   (0X0004U)      /* Enable Time-out Interrupt */
#define BITP_UART_ACR_SEC                                     (4U)           /* Starting Edge Count */
#define BITL_UART_ACR_SEC                                     (3U)           /* Starting Edge Count */
#define BITM_UART_ACR_SEC                                     (0X0070U)      /* Starting Edge Count */
#define BITP_UART_ACR_EEC                                     (8U)           /* Ending Edge Count */
#define BITL_UART_ACR_EEC                                     (4U)           /* Ending Edge Count */
#define BITM_UART_ACR_EEC                                     (0X0F00U)      /* Ending Edge Count */

#define ENUM_UART_ACR_EEC_FIRST                               (0X0000U)      /* First Edge */
#define ENUM_UART_ACR_EEC_SECOND                              (0X0001U)      /* Second Edge */
#define ENUM_UART_ACR_EEC_THIRD                               (0X0002U)      /* Third Edge */
#define ENUM_UART_ACR_EEC_FOURTH                              (0X0003U)      /* Fourth Edge */
#define ENUM_UART_ACR_EEC_FIFTH                               (0X0004U)      /* Fifth Edge */
#define ENUM_UART_ACR_EEC_SIXTH                               (0X0005U)      /* Sixth Edge */
#define ENUM_UART_ACR_EEC_SEVENTH                             (0X0006U)      /* Seventh Edge */
#define ENUM_UART_ACR_EEC_EIGHTH                              (0X0007U)      /* Eighth Edge */
#define ENUM_UART_ACR_EEC_NINTH                               (0X0008U)      /* Ninth Edge */
#define ENUM_UART_ACR_SEC_FIRST                               (0X0000U)      /* First Edge (always the Falling Edge of START Bit) */
#define ENUM_UART_ACR_SEC_SECOND                              (0X0001U)      /* Second Edge */
#define ENUM_UART_ACR_SEC_THIRD                               (0X0002U)      /* Third Edge */
#define ENUM_UART_ACR_SEC_FOURTH                              (0X0003U)      /* Fourth Edge */
#define ENUM_UART_ACR_SEC_FIFTH                               (0X0004U)      /* Fifth Edge */
#define ENUM_UART_ACR_SEC_SIXTH                               (0X0005U)      /* Sixth Edge */
#define ENUM_UART_ACR_SEC_SEVENTH                             (0X0006U)      /* Seventh Edge */
#define ENUM_UART_ACR_SEC_EIGHTH                              (0X0007U)      /* Eighth Edge */

