mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        I2C Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_I2C_MCTL                                            (0X0) 
#define RSTVAL_I2C_MSTAT                                           (0X6000) 
#define RSTVAL_I2C_MRX                                             (0X0) 
#define RSTVAL_I2C_MTX                                             (0X0) 
#define RSTVAL_I2C_MRXCNT                                          (0X0) 
#define RSTVAL_I2C_MCRXCNT                                         (0X0) 
#define RSTVAL_I2C_ADDR0                                           (0X0) 
#define RSTVAL_I2C_ADDR1                                           (0X0) 
#define RSTVAL_I2C_BYT                                             (0X0) 
#define RSTVAL_I2C_DIV                                             (0XC6C7) 
#define RSTVAL_I2C_SCTL                                            (0X0) 
#define RSTVAL_I2C_SSTAT                                           (0X1) 
#define RSTVAL_I2C_SRX                                             (0X0) 
#define RSTVAL_I2C_STX                                             (0X0) 
#define RSTVAL_I2C_ALT                                             (0X0) 
#define RSTVAL_I2C_ID0                                             (0X0) 
#define RSTVAL_I2C_ID1                                             (0X0) 
#define RSTVAL_I2C_ID2                                             (0X0) 
#define RSTVAL_I2C_ID3                                             (0X0) 
#define RSTVAL_I2C_STAT                                            (0X0) 
#define RSTVAL_I2C_SHCTL                                           (0X0) 
#define RSTVAL_I2C_TCTL                                            (0X205) 
#define RSTVAL_I2C_ASTRETCH_SCL                                    (0X0) 
#define RSTVAL_I2C_IDFSTA                                          (0X0) 
#define RSTVAL_I2C_SLV_ADDR1                                       (0X0) 
#define RSTVAL_I2C_SLV_ADDR2                                       (0X0) 
#define RSTVAL_I2C_SSTAT2                                          (0X0) 

/* ====================================================================================================
        I2C Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          MCTL                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_MCTL_MASEN                                   (0U)           /* Master Enable */
#define BITL_I2C_MCTL_MASEN                                   (1U)           /* Master Enable */
#define BITM_I2C_MCTL_MASEN                                   (0X0001U)      /* Master Enable */
#define BITP_I2C_MCTL_COMPETE                                 (1U)           /* Start Back-off Disable */
#define BITL_I2C_MCTL_COMPETE                                 (1U)           /* Start Back-off Disable */
#define BITM_I2C_MCTL_COMPETE                                 (0X0002U)      /* Start Back-off Disable */
#define BITP_I2C_MCTL_LOOPBACK                                (2U)           /* Internal Loopback Enable */
#define BITL_I2C_MCTL_LOOPBACK                                (1U)           /* Internal Loopback Enable */
#define BITM_I2C_MCTL_LOOPBACK                                (0X0004U)      /* Internal Loopback Enable */
#define BITP_I2C_MCTL_IENMRX                                  (4U)           /* Receive Request Interrupt Enable */
#define BITL_I2C_MCTL_IENMRX                                  (1U)           /* Receive Request Interrupt Enable */
#define BITM_I2C_MCTL_IENMRX                                  (0X0010U)      /* Receive Request Interrupt Enable */
#define BITP_I2C_MCTL_IENMTX                                  (5U)           /* Transmit Request Interrupt Enable. */
#define BITL_I2C_MCTL_IENMTX                                  (1U)           /* Transmit Request Interrupt Enable. */
#define BITM_I2C_MCTL_IENMTX                                  (0X0020U)      /* Transmit Request Interrupt Enable. */
#define BITP_I2C_MCTL_IENALOST                                (6U)           /* Arbitration Lost Interrupt Enable */
#define BITL_I2C_MCTL_IENALOST                                (1U)           /* Arbitration Lost Interrupt Enable */
#define BITM_I2C_MCTL_IENALOST                                (0X0040U)      /* Arbitration Lost Interrupt Enable */
#define BITP_I2C_MCTL_IENACK                                  (7U)           /* ACK Not Received Interrupt Enable */
#define BITL_I2C_MCTL_IENACK                                  (1U)           /* ACK Not Received Interrupt Enable */
#define BITM_I2C_MCTL_IENACK                                  (0X0080U)      /* ACK Not Received Interrupt Enable */
#define BITP_I2C_MCTL_IENCMP                                  (8U)           /* Transaction Completed (Or Stop Detected) Interrupt Enable */
#define BITL_I2C_MCTL_IENCMP                                  (1U)           /* Transaction Completed (Or Stop Detected) Interrupt Enable */
#define BITM_I2C_MCTL_IENCMP                                  (0X0100U)      /* Transaction Completed (Or Stop Detected) Interrupt Enable */
#define BITP_I2C_MCTL_MXMITDEC                                (9U)           /* Decrement Master TX FIFO Status When Transmitted One Byte */
#define BITL_I2C_MCTL_MXMITDEC                                (1U)           /* Decrement Master TX FIFO Status When Transmitted One Byte */
#define BITM_I2C_MCTL_MXMITDEC                                (0X0200U)      /* Decrement Master TX FIFO Status When Transmitted One Byte */
#define BITP_I2C_MCTL_MRXDMA                                  (10U)          /* Enable Master Rx DMA Request */
#define BITL_I2C_MCTL_MRXDMA                                  (1U)           /* Enable Master Rx DMA Request */
#define BITM_I2C_MCTL_MRXDMA                                  (0X0400U)      /* Enable Master Rx DMA Request */
#define BITP_I2C_MCTL_MTXDMA                                  (11U)          /* Enable Master Tx DMA Request */
#define BITL_I2C_MCTL_MTXDMA                                  (1U)           /* Enable Master Tx DMA Request */
#define BITM_I2C_MCTL_MTXDMA                                  (0X0800U)      /* Enable Master Tx DMA Request */
#define BITP_I2C_MCTL_BUS_CLR_EN                              (12U)          /* Bus-Clear Enable */
#define BITL_I2C_MCTL_BUS_CLR_EN                              (1U)           /* Bus-Clear Enable */
#define BITM_I2C_MCTL_BUS_CLR_EN                              (0X1000U)      /* Bus-Clear Enable */
#define BITP_I2C_MCTL_PRESTOP_BUS_CLR                         (13U)          /* Prestop Bus-Clear */
#define BITL_I2C_MCTL_PRESTOP_BUS_CLR                         (1U)           /* Prestop Bus-Clear */
#define BITM_I2C_MCTL_PRESTOP_BUS_CLR                         (0X2000U)      /* Prestop Bus-Clear */

