mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          STX                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_STX_I2CSTX                                   (0U)           /* Slave Transmit Register */
#define BITL_I2C_STX_I2CSTX                                   (8U)           /* Slave Transmit Register */
#define BITM_I2C_STX_I2CSTX                                   (0X00FFU)      /* Slave Transmit Register */
#define BITP_I2C_STX_ID_SEL                                   (8U)           /* ID FIFO Selection */
#define BITL_I2C_STX_ID_SEL                                   (2U)           /* ID FIFO Selection */
#define BITM_I2C_STX_ID_SEL                                   (0X0300U)      /* ID FIFO Selection */

#define ENUM_I2C_STX_ID_SEL_FIFO0                             (0X0000U)      /* Select Address Matched ID Register 0 */
#define ENUM_I2C_STX_ID_SEL_FIFO1                             (0X0001U)      /* Select Address Matched ID Register 1 */
#define ENUM_I2C_STX_ID_SEL_FIFO2                             (0X0002U)      /* Select Address Matched ID Register 2 */
#define ENUM_I2C_STX_ID_SEL_FIFO3                             (0X0003U)      /* Select Address Matched ID Register 3 */

/* ----------------------------------------------------------------------------------------------------
          ALT                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ALT_ALT                                      (0U)           /* Slave Alt */
#define BITL_I2C_ALT_ALT                                      (8U)           /* Slave Alt */
#define BITM_I2C_ALT_ALT                                      (0X00FFU)      /* Slave Alt */

/* ----------------------------------------------------------------------------------------------------
          ID0                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ID0_ID0                                      (0U)           /* Slave Device ID 0 */
#define BITL_I2C_ID0_ID0                                      (8U)           /* Slave Device ID 0 */
#define BITM_I2C_ID0_ID0                                      (0X00FFU)      /* Slave Device ID 0 */

/* ----------------------------------------------------------------------------------------------------
          ID1                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ID1_ID1                                      (0U)           /* Slave Device ID 1 */
#define BITL_I2C_ID1_ID1                                      (8U)           /* Slave Device ID 1 */
#define BITM_I2C_ID1_ID1                                      (0X00FFU)      /* Slave Device ID 1 */

/* ----------------------------------------------------------------------------------------------------
          ID2                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ID2_ID2                                      (0U)           /* Slave Device ID 2 */
#define BITL_I2C_ID2_ID2                                      (8U)           /* Slave Device ID 2 */
#define BITM_I2C_ID2_ID2                                      (0X00FFU)      /* Slave Device ID 2 */

/* ----------------------------------------------------------------------------------------------------
          ID3                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ID3_ID3                                      (0U)           /* Slave Device ID 3 */
#define BITL_I2C_ID3_ID3                                      (8U)           /* Slave Device ID 3 */
#define BITM_I2C_ID3_ID3                                      (0X00FFU)      /* Slave Device ID 3 */

/* ----------------------------------------------------------------------------------------------------
          STAT                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_STAT_STXFSTA                                 (0U)           /* Slave Transmit FIFO Status */
#define BITL_I2C_STAT_STXFSTA                                 (2U)           /* Slave Transmit FIFO Status */
#define BITM_I2C_STAT_STXFSTA                                 (0X0003U)      /* Slave Transmit FIFO Status */
#define BITP_I2C_STAT_SRXFSTA                                 (2U)           /* Slave Receive FIFO Status */
#define BITL_I2C_STAT_SRXFSTA                                 (2U)           /* Slave Receive FIFO Status */
#define BITM_I2C_STAT_SRXFSTA                                 (0X000CU)      /* Slave Receive FIFO Status */
#define BITP_I2C_STAT_MTXSFA                                  (4U)           /* Master Transmit FIFO Status */
#define BITL_I2C_STAT_MTXSFA                                  (2U)           /* Master Transmit FIFO Status */
#define BITM_I2C_STAT_MTXSFA                                  (0X0030U)      /* Master Transmit FIFO Status */
#define BITP_I2C_STAT_MRXFSTA                                 (6U)           /* Master Receive FIFO Status */
#define BITL_I2C_STAT_MRXFSTA                                 (2U)           /* Master Receive FIFO Status */
#define BITM_I2C_STAT_MRXFSTA                                 (0X00C0U)      /* Master Receive FIFO Status */
#define BITP_I2C_STAT_SFLUSH                                  (8U)           /* Flush the Slave Transmit FIFO */
#define BITL_I2C_STAT_SFLUSH                                  (1U)           /* Flush the Slave Transmit FIFO */
#define BITM_I2C_STAT_SFLUSH                                  (0X0100U)      /* Flush the Slave Transmit FIFO */
#define BITP_I2C_STAT_MFLUSH                                  (9U)           /* Flush the Master Transmit FIFO */
#define BITL_I2C_STAT_MFLUSH                                  (1U)           /* Flush the Master Transmit FIFO */
#define BITM_I2C_STAT_MFLUSH                                  (0X0200U)      /* Flush the Master Transmit FIFO */
#define BITP_I2C_STAT_STX_FLUSH_ALL                           (10U)          /* Flush All the Slave Transmit ID FIFOs. */
#define BITL_I2C_STAT_STX_FLUSH_ALL                           (1U)           /* Flush All the Slave Transmit ID FIFOs. */
#define BITM_I2C_STAT_STX_FLUSH_ALL                           (0X0400U)      /* Flush All the Slave Transmit ID FIFOs. */

#define ENUM_I2C_STAT_MRXFSTA_EMPTY                           (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_STAT_MRXFSTA_ONE                             (0X0001U)      /* 1 Bytes In The FIFO */
#define ENUM_I2C_STAT_MRXFSTA_TWO                             (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_STAT_MRXFSTA_RESERVED                        (0X0003U)      /* Reserved */
#define ENUM_I2C_STAT_MTXSFA_EMPTY                            (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_STAT_MTXSFA_ONE                              (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_STAT_MTXSFA_TWO                              (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_STAT_MTXSFA_RESERVED                         (0X0003U)      /* Reserved */
#define ENUM_I2C_STAT_SRXFSTA_EMPTY                           (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_STAT_SRXFSTA_ONE                             (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_STAT_SRXFSTA_TWO                             (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_STAT_SRXFSTA_RESERVED                        (0X0003U)      /* Reserved */
#define ENUM_I2C_STAT_STXFSTA_EMPTY                           (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_STAT_STXFSTA_ONE                             (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_STAT_STXFSTA_TWO                             (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_STAT_STXFSTA_RESERVED                        (0X0003U)      /* Reserved */

