mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          MDFRM                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDFRM_MD_OP                                 (0U)           /* Received OP */
#define BITL_MDIO_MDFRM_MD_OP                                 (2U)           /* Received OP */
#define BITM_MDIO_MDFRM_MD_OP                                 (0X0003U)      /* Received OP */
#define BITP_MDIO_MDFRM_MD_PHY                                (2U)           /* Received PHYADR. */
#define BITL_MDIO_MDFRM_MD_PHY                                (5U)           /* Received PHYADR. */
#define BITM_MDIO_MDFRM_MD_PHY                                (0X007CU)      /* Received PHYADR. */
#define BITP_MDIO_MDFRM_MD_DEV                                (7U)           /* Received DEVADD */
#define BITL_MDIO_MDFRM_MD_DEV                                (5U)           /* Received DEVADD */
#define BITM_MDIO_MDFRM_MD_DEV                                (0X0F80U)      /* Received DEVADD */

#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_ADF                       (0X0000U)      /* Address Frame. */
#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_WRF                       (0X0001U)      /* Write Frame. */
#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_INCF                      (0X0002U)      /* PostReadIncAdd Frame. */
#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_RDF                       (0X0003U)      /* Read Frame. */

/* ----------------------------------------------------------------------------------------------------
          MDRXD                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDRXD_MD_RXD                                (0U)           /* Received Data */
#define BITL_MDIO_MDRXD_MD_RXD                                (16U)          /* Received Data */
#define BITM_MDIO_MDRXD_MD_RXD                                (0XFFFFU)      /* Received Data */

/* ----------------------------------------------------------------------------------------------------
          MDADR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDADR_MD_ADR                                (0U)           /* Received Address */
#define BITL_MDIO_MDADR_MD_ADR                                (16U)          /* Received Address */
#define BITM_MDIO_MDADR_MD_ADR                                (0XFFFFU)      /* Received Address */

/* ----------------------------------------------------------------------------------------------------
          MDTXD                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDTXD_MD_TXD                                (0U)           /* TX Data */
#define BITL_MDIO_MDTXD_MD_TXD                                (16U)          /* TX Data */
#define BITM_MDIO_MDTXD_MD_TXD                                (0XFFFFU)      /* TX Data */

/* ----------------------------------------------------------------------------------------------------
          MDPHY                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDPHY_MD_PHYSW                              (0U)           /* Software Provided PHYADR */
#define BITL_MDIO_MDPHY_MD_PHYSW                              (5U)           /* Software Provided PHYADR */
#define BITM_MDIO_MDPHY_MD_PHYSW                              (0X001FU)      /* Software Provided PHYADR */
#define BITP_MDIO_MDPHY_MD_PHYSEL                             (5U)           /* Selects Expected PHYADR Bits */
#define BITL_MDIO_MDPHY_MD_PHYSEL                             (5U)           /* Selects Expected PHYADR Bits */
#define BITM_MDIO_MDPHY_MD_PHYSEL                             (0X03E0U)      /* Selects Expected PHYADR Bits */
#define BITP_MDIO_MDPHY_MD_DEVADD                             (10U)          /* Expected DEVADD */
#define BITL_MDIO_MDPHY_MD_DEVADD                             (5U)           /* Expected DEVADD */
#define BITM_MDIO_MDPHY_MD_DEVADD                             (0X7C00U)      /* Expected DEVADD */

/* ----------------------------------------------------------------------------------------------------
          MDSTA                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDSTA_MD_WRF                                (0U)           /* Write Frame Status */
#define BITL_MDIO_MDSTA_MD_WRF                                (1U)           /* Write Frame Status */
#define BITM_MDIO_MDSTA_MD_WRF                                (0X0001U)      /* Write Frame Status */
#define BITP_MDIO_MDSTA_MD_ADRF                               (1U)           /* Address Frame Status */
#define BITL_MDIO_MDSTA_MD_ADRF                               (1U)           /* Address Frame Status */
#define BITM_MDIO_MDSTA_MD_ADRF                               (0X0002U)      /* Address Frame Status */
#define BITP_MDIO_MDSTA_MD_INCF                               (2U)           /* Post Read Increment Address Frame Status */
#define BITL_MDIO_MDSTA_MD_INCF                               (1U)           /* Post Read Increment Address Frame Status */
#define BITM_MDIO_MDSTA_MD_INCF                               (0X0004U)      /* Post Read Increment Address Frame Status */
#define BITP_MDIO_MDSTA_MD_RDF                                (3U)           /* Read Frame Status */
#define BITL_MDIO_MDSTA_MD_RDF                                (1U)           /* Read Frame Status */
#define BITM_MDIO_MDSTA_MD_RDF                                (0X0008U)      /* Read Frame Status */
#define BITP_MDIO_MDSTA_MD_DEVM                               (4U)           /* Device Address Matching Status */
#define BITL_MDIO_MDSTA_MD_DEVM                               (1U)           /* Device Address Matching Status */
#define BITM_MDIO_MDSTA_MD_DEVM                               (0X0010U)      /* Device Address Matching Status */
#define BITP_MDIO_MDSTA_MD_DEVN                               (5U)           /* Device Address None Match Status */
#define BITL_MDIO_MDSTA_MD_DEVN                               (1U)           /* Device Address None Match Status */
#define BITM_MDIO_MDSTA_MD_DEVN                               (0X0020U)      /* Device Address None Match Status */
#define BITP_MDIO_MDSTA_MD_PHYM                               (6U)           /* PHY Address Matching Status */
#define BITL_MDIO_MDSTA_MD_PHYM                               (1U)           /* PHY Address Matching Status */
#define BITM_MDIO_MDSTA_MD_PHYM                               (0X0040U)      /* PHY Address Matching Status */
#define BITP_MDIO_MDSTA_MD_PHYN                               (7U)           /* PHY Address Non Matching Status */
#define BITL_MDIO_MDSTA_MD_PHYN                               (1U)           /* PHY Address Non Matching Status */
#define BITM_MDIO_MDSTA_MD_PHYN                               (0X0080U)      /* PHY Address Non Matching Status */

