mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          MDIEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDIEN_MD_WRFI                               (0U)           /* Interrupt Enable for MD_WRF */
#define BITL_MDIO_MDIEN_MD_WRFI                               (1U)           /* Interrupt Enable for MD_WRF */
#define BITM_MDIO_MDIEN_MD_WRFI                               (0X0001U)      /* Interrupt Enable for MD_WRF */
#define BITP_MDIO_MDIEN_MD_ADRI                               (1U)           /* Interrupt Enable for MD_ADRF */
#define BITL_MDIO_MDIEN_MD_ADRI                               (1U)           /* Interrupt Enable for MD_ADRF */
#define BITM_MDIO_MDIEN_MD_ADRI                               (0X0002U)      /* Interrupt Enable for MD_ADRF */
#define BITP_MDIO_MDIEN_MD_INCFI                              (2U)           /* Interrupt Enable for MD_INCF */
#define BITL_MDIO_MDIEN_MD_INCFI                              (1U)           /* Interrupt Enable for MD_INCF */
#define BITM_MDIO_MDIEN_MD_INCFI                              (0X0004U)      /* Interrupt Enable for MD_INCF */
#define BITP_MDIO_MDIEN_MD_RDFI                               (3U)           /* Interrupt Enable for MD_RDF */
#define BITL_MDIO_MDIEN_MD_RDFI                               (1U)           /* Interrupt Enable for MD_RDF */
#define BITM_MDIO_MDIEN_MD_RDFI                               (0X0008U)      /* Interrupt Enable for MD_RDF */
#define BITP_MDIO_MDIEN_MD_DEVMI                              (4U)           /* Interrupt Enable for MD_DEVM */
#define BITL_MDIO_MDIEN_MD_DEVMI                              (1U)           /* Interrupt Enable for MD_DEVM */
#define BITM_MDIO_MDIEN_MD_DEVMI                              (0X0010U)      /* Interrupt Enable for MD_DEVM */
#define BITP_MDIO_MDIEN_MD_DEVNI                              (5U)           /* Interrupt Enable for MD_DEVN */
#define BITL_MDIO_MDIEN_MD_DEVNI                              (1U)           /* Interrupt Enable for MD_DEVN */
#define BITM_MDIO_MDIEN_MD_DEVNI                              (0X0020U)      /* Interrupt Enable for MD_DEVN */
#define BITP_MDIO_MDIEN_MD_PHYMI                              (6U)           /* Interrupt Enable for MD_PHYM */
#define BITL_MDIO_MDIEN_MD_PHYMI                              (1U)           /* Interrupt Enable for MD_PHYM */
#define BITM_MDIO_MDIEN_MD_PHYMI                              (0X0040U)      /* Interrupt Enable for MD_PHYM */
#define BITP_MDIO_MDIEN_MD_PHYNI                              (7U)           /* Interrupt Enable for MD_PHYN */
#define BITL_MDIO_MDIEN_MD_PHYNI                              (1U)           /* Interrupt Enable for MD_PHYN */
#define BITM_MDIO_MDIEN_MD_PHYNI                              (0X0080U)      /* Interrupt Enable for MD_PHYN */

/* ----------------------------------------------------------------------------------------------------
          MDPIN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDPIN_MD_PIN                                (0U)           /* PRTADR Pins */
#define BITL_MDIO_MDPIN_MD_PIN                                (5U)           /* PRTADR Pins */
#define BITM_MDIO_MDPIN_MD_PIN                                (0X001FU)      /* PRTADR Pins */

/* ----------------------------------------------------------------------------------------------------
          DMAEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_DMAEN_RD_DATA                               (0U)           /* Read Data */
#define BITL_MDIO_DMAEN_RD_DATA                               (1U)           /* Read Data */
#define BITM_MDIO_DMAEN_RD_DATA                               (0X0001U)      /* Read Data */
#define BITP_MDIO_DMAEN_INCRD_DATA                            (1U)           /* Increment Read Data */
#define BITL_MDIO_DMAEN_INCRD_DATA                            (1U)           /* Increment Read Data */
#define BITM_MDIO_DMAEN_INCRD_DATA                            (0X0002U)      /* Increment Read Data */
#define BITP_MDIO_DMAEN_WR_ADR                                (2U)           /* Write Address */
#define BITL_MDIO_DMAEN_WR_ADR                                (1U)           /* Write Address */
#define BITM_MDIO_DMAEN_WR_ADR                                (0X0004U)      /* Write Address */
#define BITP_MDIO_DMAEN_WR_DATA                               (3U)           /* Write Data */
#define BITL_MDIO_DMAEN_WR_DATA                               (1U)           /* Write Data */
#define BITM_MDIO_DMAEN_WR_DATA                               (0X0008U)      /* Write Data */

/* ----------------------------------------------------------------------------------------------------
          MDTESTCON                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDTESTCON_TA_0_VALUE                        (11U)          /* Output Value During First Bit of OP */
#define BITL_MDIO_MDTESTCON_TA_0_VALUE                        (1U)           /* Output Value During First Bit of OP */
#define BITM_MDIO_MDTESTCON_TA_0_VALUE                        (0X0800U)      /* Output Value During First Bit of OP */
#define BITP_MDIO_MDTESTCON_TA_1_VALUE                        (12U)          /* Output Value During Second Bit of OP */
#define BITL_MDIO_MDTESTCON_TA_1_VALUE                        (1U)           /* Output Value During Second Bit of OP */
#define BITM_MDIO_MDTESTCON_TA_1_VALUE                        (0X1000U)      /* Output Value During Second Bit of OP */
#define BITP_MDIO_MDTESTCON_EN_TA_OUTPUT                      (13U)          /* Enable Output Different During OP Phase */
#define BITL_MDIO_MDTESTCON_EN_TA_OUTPUT                      (1U)           /* Enable Output Different During OP Phase */
#define BITM_MDIO_MDTESTCON_EN_TA_OUTPUT                      (0X2000U)      /* Enable Output Different During OP Phase */

#endif  /* end ifndef MDIO_ADDR_RDEF_H_ */


