mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
#ifndef DMA_ADDR_RDEF_H_
#define DMA_ADDR_RDEF_H_    /* DMA: DMA */

/* ====================================================================================================
        DMA Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_DMA                                                 (0X40040000U)    /* dma: */

#define MASK_DMA                                                 (0X00000FFFU)    /* DMA: DMA */

/* ====================================================================================================
        DMA Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_DMA_STAT                                            (0X000U)    /* DMA Status */
#define IDX_DMA_CFG                                             (0X004U)    /* DMA Configuration */
#define IDX_DMA_PDBPTR                                          (0X008U)    /* DMA Channel Primary Control Data Base Pointer */
#define IDX_DMA_ADBPTR                                          (0X00CU)    /* DMA Channel Alternate Control Data Base Pointer */
#define IDX_DMA_SWREQ                                           (0X014U)    /* DMA Channel Software Request */
#define IDX_DMA_RMSKSET                                         (0X020U)    /* DMA Channel Request Mask Set */
#define IDX_DMA_RMSKCLR                                         (0X024U)    /* DMA Channel Request Mask Clear */
#define IDX_DMA_ENSET                                           (0X028U)    /* DMA Channel Enable Set */
#define IDX_DMA_ENCLR                                           (0X02CU)    /* DMA Channel Enable Clear */
#define IDX_DMA_ALTSET                                          (0X030U)    /* DMA Channel Primary-alternate Set */
#define IDX_DMA_ALTCLR                                          (0X034U)    /* DMA Channel Primary-alternate Clear */
#define IDX_DMA_PRISET                                          (0X038U)    /* DMA Channel Priority Set */
#define IDX_DMA_PRICLR                                          (0X03CU)    /* DMA Channel Priority Clear */
#define IDX_DMA_ERRCHNLCLR                                      (0X048U)    /* DMA per Channel Error Clear */
#define IDX_DMA_ERRCLR                                          (0X04CU)    /* DMA Bus Error Clear */
#define IDX_DMA_INVALIDDESCCLR                                  (0X050U)    /* DMA per Channel Invalid Descriptor Clear */
#define IDX_DMA_BSSET                                           (0X800U)    /* DMA Channel Bytes Swap Enable Set */
#define IDX_DMA_BSCLR                                           (0X804U)    /* DMA Channel Bytes Swap Enable Clear */
#define IDX_DMA_SRCADDRSET                                      (0X810U)    /* DMA Channel Source Address Decrement Enable Set */
#define IDX_DMA_SRCADDRCLR                                      (0X814U)    /* DMA Channel Source Address Decrement Enable Clear */
#define IDX_DMA_DSTADDRSET                                      (0X818U)    /* DMA Channel Destination Address Decrement Enable Set */
#define IDX_DMA_DSTADDRCLR                                      (0X81CU)    /* DMA Channel Destination Address Decrement Enable Clear */
#define IDX_DMA_REVID                                           (0XFE0U)    /* DMA Controller Revision ID */

/* ====================================================================================================
        DMA Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_DMA_STAT                                            (0X1E0000) 
#define RSTVAL_DMA_CFG                                             (0X0) 
#define RSTVAL_DMA_PDBPTR                                          (0X0) 
#define RSTVAL_DMA_ADBPTR                                          (0X200) 
#define RSTVAL_DMA_SWREQ                                           (0X0) 
#define RSTVAL_DMA_RMSKSET                                         (0X0) 
#define RSTVAL_DMA_RMSKCLR                                         (0X0) 
#define RSTVAL_DMA_ENSET                                           (0X0) 
#define RSTVAL_DMA_ENCLR                                           (0X0) 
#define RSTVAL_DMA_ALTSET                                          (0X0) 
#define RSTVAL_DMA_ALTCLR                                          (0X0) 
#define RSTVAL_DMA_PRISET                                          (0X0) 
#define RSTVAL_DMA_PRICLR                                          (0X0) 
#define RSTVAL_DMA_ERRCHNLCLR                                      (0X0) 
#define RSTVAL_DMA_ERRCLR                                          (0X0) 
#define RSTVAL_DMA_INVALIDDESCCLR                                  (0X0) 
#define RSTVAL_DMA_BSSET                                           (0X0) 
#define RSTVAL_DMA_BSCLR                                           (0X0) 
#define RSTVAL_DMA_SRCADDRSET                                      (0X0) 
#define RSTVAL_DMA_SRCADDRCLR                                      (0X0) 
#define RSTVAL_DMA_DSTADDRSET                                      (0X0) 
#define RSTVAL_DMA_DSTADDRCLR                                      (0X0) 
#define RSTVAL_DMA_REVID                                           (0X2) 

/* ====================================================================================================
        DMA Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          STAT                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_STAT_MEN                                     (0U)           /* Enable Status of the Controller */
#define BITL_DMA_STAT_MEN                                     (1U)           /* Enable Status of the Controller */
#define BITM_DMA_STAT_MEN                                     (0X00000001U)  /* Enable Status of the Controller */
#define BITP_DMA_STAT_CHANM1                                  (16U)          /* Number of Available DMA Channels Minus 1 */
#define BITL_DMA_STAT_CHANM1                                  (5U)           /* Number of Available DMA Channels Minus 1 */
#define BITM_DMA_STAT_CHANM1                                  (0X001F0000U)  /* Number of Available DMA Channels Minus 1 */

