mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          CFG                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_CFG_MEN                                      (0U)           /* Controller Enable */
#define BITL_DMA_CFG_MEN                                      (1U)           /* Controller Enable */
#define BITM_DMA_CFG_MEN                                      (0X00000001U)  /* Controller Enable */

/* ----------------------------------------------------------------------------------------------------
          PDBPTR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PDBPTR_ADDR                                  (0U)           /* Pointer to the Base Address of the Primary Data Structure */
#define BITL_DMA_PDBPTR_ADDR                                  (32U)          /* Pointer to the Base Address of the Primary Data Structure */
#define BITM_DMA_PDBPTR_ADDR                                  (0XFFFFFFFFU)  /* Pointer to the Base Address of the Primary Data Structure */

/* ----------------------------------------------------------------------------------------------------
          ADBPTR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ADBPTR_ADDR                                  (0U)           /* Base Address of the Alternate Data Structure */
#define BITL_DMA_ADBPTR_ADDR                                  (32U)          /* Base Address of the Alternate Data Structure */
#define BITM_DMA_ADBPTR_ADDR                                  (0XFFFFFFFFU)  /* Base Address of the Alternate Data Structure */

/* ----------------------------------------------------------------------------------------------------
          SWREQ                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SWREQ_CHAN                                   (0U)           /* Generate Software Request */
#define BITL_DMA_SWREQ_CHAN                                   (31U)          /* Generate Software Request */
#define BITM_DMA_SWREQ_CHAN                                   (0X7FFFFFFFU)  /* Generate Software Request */

/* ----------------------------------------------------------------------------------------------------
          RMSKSET                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_RMSKSET_CHAN                                 (0U)           /* Mask Requests from DMA Channels */
#define BITL_DMA_RMSKSET_CHAN                                 (31U)          /* Mask Requests from DMA Channels */
#define BITM_DMA_RMSKSET_CHAN                                 (0X7FFFFFFFU)  /* Mask Requests from DMA Channels */

/* ----------------------------------------------------------------------------------------------------
          RMSKCLR                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_RMSKCLR_CHAN                                 (0U)           /* Clear REQ_MASK_SET Bits in DMARMSKSET */
#define BITL_DMA_RMSKCLR_CHAN                                 (31U)          /* Clear REQ_MASK_SET Bits in DMARMSKSET */
#define BITM_DMA_RMSKCLR_CHAN                                 (0X7FFFFFFFU)  /* Clear REQ_MASK_SET Bits in DMARMSKSET */

/* ----------------------------------------------------------------------------------------------------
          ENSET                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ENSET_CHAN                                   (0U)           /* Enable DMA Channels */
#define BITL_DMA_ENSET_CHAN                                   (31U)          /* Enable DMA Channels */
#define BITM_DMA_ENSET_CHAN                                   (0X7FFFFFFFU)  /* Enable DMA Channels */

/* ----------------------------------------------------------------------------------------------------
          ENCLR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ENCLR_CHAN                                   (0U)           /* Disable DMA Channels */
#define BITL_DMA_ENCLR_CHAN                                   (31U)          /* Disable DMA Channels */
#define BITM_DMA_ENCLR_CHAN                                   (0X7FFFFFFFU)  /* Disable DMA Channels */

/* ----------------------------------------------------------------------------------------------------
          ALTSET                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ALTSET_CHAN                                  (0U)           /* Control Structure Status / Select Alt Structure */
#define BITL_DMA_ALTSET_CHAN                                  (31U)          /* Control Structure Status / Select Alt Structure */
#define BITM_DMA_ALTSET_CHAN                                  (0X7FFFFFFFU)  /* Control Structure Status / Select Alt Structure */

/* ----------------------------------------------------------------------------------------------------
          ALTCLR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ALTCLR_CHAN                                  (0U)           /* Select Primary Data Structure */
#define BITL_DMA_ALTCLR_CHAN                                  (31U)          /* Select Primary Data Structure */
#define BITM_DMA_ALTCLR_CHAN                                  (0X7FFFFFFFU)  /* Select Primary Data Structure */

