mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PRISET                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PRISET_CHAN                                  (0U)           /* Configure Channel for High Priority */
#define BITL_DMA_PRISET_CHAN                                  (31U)          /* Configure Channel for High Priority */
#define BITM_DMA_PRISET_CHAN                                  (0X7FFFFFFFU)  /* Configure Channel for High Priority */

/* ----------------------------------------------------------------------------------------------------
          PRICLR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PRICLR_CHPRICLR                              (0U)           /* Configure Channel for Default Priority Level */
#define BITL_DMA_PRICLR_CHPRICLR                              (31U)          /* Configure Channel for Default Priority Level */
#define BITM_DMA_PRICLR_CHPRICLR                              (0X7FFFFFFFU)  /* Configure Channel for Default Priority Level */

/* ----------------------------------------------------------------------------------------------------
          ERRCHNLCLR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ERRCHNLCLR_CHAN                              (0U)           /* Per Channel Bus Error Status/ Clear */
#define BITL_DMA_ERRCHNLCLR_CHAN                              (31U)          /* Per Channel Bus Error Status/ Clear */
#define BITM_DMA_ERRCHNLCLR_CHAN                              (0X7FFFFFFFU)  /* Per Channel Bus Error Status/ Clear */

/* ----------------------------------------------------------------------------------------------------
          ERRCLR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ERRCLR_CHAN                                  (0U)           /* Bus Error Status */
#define BITL_DMA_ERRCLR_CHAN                                  (31U)          /* Bus Error Status */
#define BITM_DMA_ERRCLR_CHAN                                  (0X7FFFFFFFU)  /* Bus Error Status */

/* ----------------------------------------------------------------------------------------------------
          INVALIDDESCCLR                                        Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_INVALIDDESCCLR_CHAN                          (0U)           /* Per Channel Invalid Descriptor Status */
#define BITL_DMA_INVALIDDESCCLR_CHAN                          (31U)          /* Per Channel Invalid Descriptor Status */
#define BITM_DMA_INVALIDDESCCLR_CHAN                          (0X7FFFFFFFU)  /* Per Channel Invalid Descriptor Status */

/* ----------------------------------------------------------------------------------------------------
          BSSET                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_BSSET_CHAN                                   (0U)           /* Byte Swap Status */
#define BITL_DMA_BSSET_CHAN                                   (31U)          /* Byte Swap Status */
#define BITM_DMA_BSSET_CHAN                                   (0X7FFFFFFFU)  /* Byte Swap Status */

/* ----------------------------------------------------------------------------------------------------
          BSCLR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_BSCLR_CHAN                                   (0U)           /* Disable Byte Swap */
#define BITL_DMA_BSCLR_CHAN                                   (31U)          /* Disable Byte Swap */
#define BITM_DMA_BSCLR_CHAN                                   (0X7FFFFFFFU)  /* Disable Byte Swap */

/* ----------------------------------------------------------------------------------------------------
          SRCADDRSET                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SRCADDRSET_CHAN                              (0U)           /* Source Address Decrement Status / Configure */
#define BITL_DMA_SRCADDRSET_CHAN                              (31U)          /* Source Address Decrement Status / Configure */
#define BITM_DMA_SRCADDRSET_CHAN                              (0X7FFFFFFFU)  /* Source Address Decrement Status / Configure */

/* ----------------------------------------------------------------------------------------------------
          SRCADDRCLR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SRCADDRCLR_CHAN                              (0U)           /* Disable Source Address Decrement */
#define BITL_DMA_SRCADDRCLR_CHAN                              (31U)          /* Disable Source Address Decrement */
#define BITM_DMA_SRCADDRCLR_CHAN                              (0X7FFFFFFFU)  /* Disable Source Address Decrement */

/* ----------------------------------------------------------------------------------------------------
          DSTADDRSET                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_DSTADDRSET_CHAN                              (0U)           /* Destination Address Decrement Status */
#define BITL_DMA_DSTADDRSET_CHAN                              (31U)          /* Destination Address Decrement Status */
#define BITM_DMA_DSTADDRSET_CHAN                              (0X7FFFFFFFU)  /* Destination Address Decrement Status */

