mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          DSTADDRCLR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_DSTADDRCLR_CHAN                              (0U)           /* Disable Destination Address Decrement */
#define BITL_DMA_DSTADDRCLR_CHAN                              (31U)          /* Disable Destination Address Decrement */
#define BITM_DMA_DSTADDRCLR_CHAN                              (0X7FFFFFFFU)  /* Disable Destination Address Decrement */

/* ----------------------------------------------------------------------------------------------------
          REVID                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_REVID_DMAREVID                               (0U)           /* DMA Controller Revision ID */
#define BITL_DMA_REVID_DMAREVID                               (8U)           /* DMA Controller Revision ID */
#define BITM_DMA_REVID_DMAREVID                               (0X000000FFU)  /* DMA Controller Revision ID */

#endif  /* end ifndef DMA_ADDR_RDEF_H_ */


#ifndef CC_ADDR_RDEF_H_
#define CC_ADDR_RDEF_H_    /* CC: Cache Controller */

/* ====================================================================================================
        CC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_CACHE                                               (0X40044000U)    /* cache: */

#define MASK_CC                                                  (0X000000FFU)    /* CC: Cache Controller */

/* ====================================================================================================
        CC Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_CC_STAT                                             (0X00U)    /* Cache Status Register */
#define IDX_CC_SETUP                                            (0X04U)    /* Cache Setup Register */
#define IDX_CC_KEY                                              (0X08U)    /* Cache Key Register */
#define IDX_CC_PERFSETUP                                        (0X0CU)    /* Cache Performance Monitor Setup Register */
#define IDX_CC_ACCESSCNTR                                       (0X10U)    /* Cache Miss Counter */
#define IDX_CC_MSTRSETUP                                        (0X24U)    /* Cache Master Setup Register */
#define IDX_CC_ECCSTAT                                          (0X34U)    /* Cache SRAM ECC Status Register */
#define IDX_CC_ECCADDR                                          (0X38U)    /* Cache SRAM ECC Address Register */

/* ====================================================================================================
        CC Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_CC_STAT                                             (0X0) 
#define RSTVAL_CC_SETUP                                            (0X0) 
#define RSTVAL_CC_KEY                                              (0X0) 
#define RSTVAL_CC_PERFSETUP                                        (0X0) 
#define RSTVAL_CC_ACCESSCNTR                                       (0X0) 
#define RSTVAL_CC_MSTRSETUP                                        (0X0) 
#define RSTVAL_CC_ECCSTAT                                          (0X0) 
#define RSTVAL_CC_ECCADDR                                          (0X0) 

/* ====================================================================================================
        CC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          STAT                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_STAT_CCEN                                     (0U)           /* Code Cache Enable Status */
#define BITL_CC_STAT_CCEN                                     (1U)           /* Code Cache Enable Status */
#define BITM_CC_STAT_CCEN                                     (0X00000001U)  /* Code Cache Enable Status */
#define BITP_CC_STAT_CCLCK                                    (1U)           /* Code Cache Lock Status */
#define BITL_CC_STAT_CCLCK                                    (1U)           /* Code Cache Lock Status */
#define BITM_CC_STAT_CCLCK                                    (0X00000002U)  /* Code Cache Lock Status */
#define BITP_CC_STAT_CCWIPE                                   (3U)           /* Code Cache Memory Wipe in Progress */
#define BITL_CC_STAT_CCWIPE                                   (1U)           /* Code Cache Memory Wipe in Progress */
#define BITM_CC_STAT_CCWIPE                                   (0X00000008U)  /* Code Cache Memory Wipe in Progress */

/* ----------------------------------------------------------------------------------------------------
          SETUP                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_SETUP_CCEN                                    (0U)           /* Code Cache Enable */
#define BITL_CC_SETUP_CCEN                                    (1U)           /* Code Cache Enable */
#define BITM_CC_SETUP_CCEN                                    (0X00000001U)  /* Code Cache Enable */
#define BITP_CC_SETUP_CCFLUSHDIS                              (8U)           /* Disable Automatic Cache and Buffer Flush on Any Flash Update */
#define BITL_CC_SETUP_CCFLUSHDIS                              (1U)           /* Disable Automatic Cache and Buffer Flush on Any Flash Update */
#define BITM_CC_SETUP_CCFLUSHDIS                              (0X00000100U)  /* Disable Automatic Cache and Buffer Flush on Any Flash Update */

