mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          KEY                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_KEY_KEY                                       (0U)           /* Cache Key Register */
#define BITL_CC_KEY_KEY                                       (32U)          /* Cache Key Register */
#define BITM_CC_KEY_KEY                                       (0XFFFFFFFFU)  /* Cache Key Register */

/* ----------------------------------------------------------------------------------------------------
          PERFSETUP                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_PERFSETUP_STOPCNTR                            (0U)           /* Performance Counter Stop */
#define BITL_CC_PERFSETUP_STOPCNTR                            (1U)           /* Performance Counter Stop */
#define BITM_CC_PERFSETUP_STOPCNTR                            (0X00000001U)  /* Performance Counter Stop */
#define BITP_CC_PERFSETUP_STRTCNTR                            (1U)           /* Performance Counter Start */
#define BITL_CC_PERFSETUP_STRTCNTR                            (1U)           /* Performance Counter Start */
#define BITM_CC_PERFSETUP_STRTCNTR                            (0X00000002U)  /* Performance Counter Start */

/* ----------------------------------------------------------------------------------------------------
          ACCESSCNTR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_ACCESSCNTR_CNT                                (0U)           /* Cache Internal Performance Counter */
#define BITL_CC_ACCESSCNTR_CNT                                (32U)          /* Cache Internal Performance Counter */
#define BITM_CC_ACCESSCNTR_CNT                                (0XFFFFFFFFU)  /* Cache Internal Performance Counter */

/* ----------------------------------------------------------------------------------------------------
          MSTRSETUP                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_MSTRSETUP_MSTRNRA                             (0U)           /* No Read Allocate for Master */
#define BITL_CC_MSTRSETUP_MSTRNRA                             (8U)           /* No Read Allocate for Master */
#define BITM_CC_MSTRSETUP_MSTRNRA                             (0X000000FFU)  /* No Read Allocate for Master */

/* ----------------------------------------------------------------------------------------------------
          ECCSTAT                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_ECCSTAT_ECCINTSTA                             (0U)           /* Cache SRAM ECC Error Interrupt Status */
#define BITL_CC_ECCSTAT_ECCINTSTA                             (2U)           /* Cache SRAM ECC Error Interrupt Status */
#define BITM_CC_ECCSTAT_ECCINTSTA                             (0X00000003U)  /* Cache SRAM ECC Error Interrupt Status */
#define BITP_CC_ECCSTAT_ECCHRESPSTA                           (2U)           /* Cache SRAM ECC Error Hresp Status */
#define BITL_CC_ECCSTAT_ECCHRESPSTA                           (2U)           /* Cache SRAM ECC Error Hresp Status */
#define BITM_CC_ECCSTAT_ECCHRESPSTA                           (0X0000000CU)  /* Cache SRAM ECC Error Hresp Status */
#define BITP_CC_ECCSTAT_ECCERRORCNT                           (4U)           /* Cache SRAM ECC Error Counter */
#define BITL_CC_ECCSTAT_ECCERRORCNT                           (3U)           /* Cache SRAM ECC Error Counter */
#define BITM_CC_ECCSTAT_ECCERRORCNT                           (0X00000070U)  /* Cache SRAM ECC Error Counter */

#define ENUM_CC_ECCSTAT_ECCHRESPSTA_NOERROR                   (0X00000000U)  /* No Error */
#define ENUM_CC_ECCSTAT_ECCHRESPSTA_ERROR2BIT                 (0X00000001U)  /* 2 Bit Error */
#define ENUM_CC_ECCSTAT_ECCHRESPSTA_ERROR1BIT                 (0X00000002U)  /* 1 Bit Error */
#define ENUM_CC_ECCSTAT_ECCHRESPSTA_RESERVED                  (0X00000003U)  /* Reserved */
#define ENUM_CC_ECCSTAT_ECCINTSTA_NOERROR                     (0X00000000U)  /* No Error */
#define ENUM_CC_ECCSTAT_ECCINTSTA_ERROR2BIT                   (0X00000001U)  /* 2 Bit Error */
#define ENUM_CC_ECCSTAT_ECCINTSTA_ERROR1BIT                   (0X00000002U)  /* 1 Bit Error */
#define ENUM_CC_ECCSTAT_ECCINTSTA_ERROR1OR2BIT                (0X00000003U)  /* Either 1 Bit Error or 2 Bit Error */

/* ----------------------------------------------------------------------------------------------------
          ECCADDR                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_ECCADDR_ECCADDR                               (0U)           /* Cache SRAM ECC Error Interrupt Address */
#define BITL_CC_ECCADDR_ECCADDR                               (11U)          /* Cache SRAM ECC Error Interrupt Address */
#define BITM_CC_ECCADDR_ECCADDR                               (0X000007FFU)  /* Cache SRAM ECC Error Interrupt Address */

#endif  /* end ifndef CC_ADDR_RDEF_H_ */


#ifndef FLASH_ADDR_RDEF_H_
#define FLASH_ADDR_RDEF_H_    /* FLASH: Flash Controller */

/* ====================================================================================================
        FLASH Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_FLASH                                               (0X40048000U)    /* flash: */

#define MASK_FLASH                                               (0XFFFFFFFFU)    /* FLASH: Flash Controller */

