mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          FEECON0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEECON0_IENCMD                             (0U)           /* Command Complete Interrupt Enable */
#define BITL_FLASH_FEECON0_IENCMD                             (1U)           /* Command Complete Interrupt Enable */
#define BITM_FLASH_FEECON0_IENCMD                             (0X00000001U)  /* Command Complete Interrupt Enable */
#define BITP_FLASH_FEECON0_IWRALCOMP                          (1U)           /* Write Almost Complete Interrupt Enable */
#define BITL_FLASH_FEECON0_IWRALCOMP                          (1U)           /* Write Almost Complete Interrupt Enable */
#define BITM_FLASH_FEECON0_IWRALCOMP                          (0X00000002U)  /* Write Almost Complete Interrupt Enable */
#define BITP_FLASH_FEECON0_IENERR                             (2U)           /* Command Fail Interrupt Enable */
#define BITL_FLASH_FEECON0_IENERR                             (1U)           /* Command Fail Interrupt Enable */
#define BITM_FLASH_FEECON0_IENERR                             (0X00000004U)  /* Command Fail Interrupt Enable */

/* ----------------------------------------------------------------------------------------------------
          FEECMD                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEECMD_CMD                                 (0U)           /* Commands */
#define BITL_FLASH_FEECMD_CMD                                 (5U)           /* Commands */
#define BITM_FLASH_FEECMD_CMD                                 (0X0000001FU)  /* Commands */

#define ENUM_FLASH_FEECMD_CMD_IDLE                            (0X00000000U)  /* IDLE */
#define ENUM_FLASH_FEECMD_CMD_ERASEPAGE                       (0X00000001U)  /* ERASEPAGE */
#define ENUM_FLASH_FEECMD_CMD_SIGN                            (0X00000002U)  /* SIGN */
#define ENUM_FLASH_FEECMD_CMD_WRITE                           (0X00000004U)  /* WRITE */
#define ENUM_FLASH_FEECMD_CMD_MASSERASE_ACTIVE                (0X00000005U)  /* MASSERASE_ACTIVE */
#define ENUM_FLASH_FEECMD_CMD_MASSERASE_PASSIVE               (0X00000006U)  /* MASSERASE_PASSIVE */
#define ENUM_FLASH_FEECMD_CMD_ABORT                           (0X00000008U)  /* ABORT */

/* ----------------------------------------------------------------------------------------------------
          FEEFLADR                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEFLADR_FLADDR                            (3U)           /* Memory Mapped Address for the Flash Location */
#define BITL_FLASH_FEEFLADR_FLADDR                            (18U)          /* Memory Mapped Address for the Flash Location */
#define BITM_FLASH_FEEFLADR_FLADDR                            (0X001FFFF8U)  /* Memory Mapped Address for the Flash Location */

/* ----------------------------------------------------------------------------------------------------
          FEEFLDATA0                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEFLDATA0_FLDATA0                         (0U)           /* Lower 32 Bit of 64 Bit Data to Be Written to Flash */
#define BITL_FLASH_FEEFLDATA0_FLDATA0                         (32U)          /* Lower 32 Bit of 64 Bit Data to Be Written to Flash */
#define BITM_FLASH_FEEFLDATA0_FLDATA0                         (0XFFFFFFFFU)  /* Lower 32 Bit of 64 Bit Data to Be Written to Flash */

/* ----------------------------------------------------------------------------------------------------
          FEEFLDATA1                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEFLDATA1_FLDATA1                         (0U)           /* Upper 32 Bit of 64 Bit Data to Be Written to Flash */
#define BITL_FLASH_FEEFLDATA1_FLDATA1                         (32U)          /* Upper 32 Bit of 64 Bit Data to Be Written to Flash */
#define BITM_FLASH_FEEFLDATA1_FLDATA1                         (0XFFFFFFFFU)  /* Upper 32 Bit of 64 Bit Data to Be Written to Flash */

/* ----------------------------------------------------------------------------------------------------
          FEEADR0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEADR0_PAGEADDR0                          (13U)          /* Page Address 0 */
#define BITL_FLASH_FEEADR0_PAGEADDR0                          (8U)           /* Page Address 0 */
#define BITM_FLASH_FEEADR0_PAGEADDR0                          (0X001FE000U)  /* Page Address 0 */

/* ----------------------------------------------------------------------------------------------------
          FEEADR1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEADR1_PAGEADDR1                          (13U)          /* Page Address 1 */
#define BITL_FLASH_FEEADR1_PAGEADDR1                          (8U)           /* Page Address 1 */
#define BITM_FLASH_FEEADR1_PAGEADDR1                          (0X001FE000U)  /* Page Address 1 */

/* ----------------------------------------------------------------------------------------------------
          FEEKEY                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEKEY_KEY                                 (0U)           /* Key Register */
#define BITL_FLASH_FEEKEY_KEY                                 (32U)          /* Key Register */
#define BITM_FLASH_FEEKEY_KEY                                 (0XFFFFFFFFU)  /* Key Register */

