mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          FEEPRO0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEPRO0_WRPROT0                            (0U)           /* Write Protection for Flash0 – 32 Bits. */
#define BITL_FLASH_FEEPRO0_WRPROT0                            (32U)          /* Write Protection for Flash0 – 32 Bits. */
#define BITM_FLASH_FEEPRO0_WRPROT0                            (0XFFFFFFFFU)  /* Write Protection for Flash0 – 32 Bits. */

/* ----------------------------------------------------------------------------------------------------
          FEEPRO1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEPRO1_WRPROT1                            (0U)           /* Write Protection for Flash1 – 32 Bits. */
#define BITL_FLASH_FEEPRO1_WRPROT1                            (32U)          /* Write Protection for Flash1 – 32 Bits. */
#define BITM_FLASH_FEEPRO1_WRPROT1                            (0XFFFFFFFFU)  /* Write Protection for Flash1 – 32 Bits. */

/* ----------------------------------------------------------------------------------------------------
          FEESIG                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEESIG_SIGN                                (0U)           /* Signature */
#define BITL_FLASH_FEESIG_SIGN                                (24U)          /* Signature */
#define BITM_FLASH_FEESIG_SIGN                                (0X00FFFFFFU)  /* Signature */

/* ----------------------------------------------------------------------------------------------------
          FEECON1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEECON1_JTAGDEBUGEN                        (0U)           /* JTAG Debug Enable */
#define BITL_FLASH_FEECON1_JTAGDEBUGEN                        (1U)           /* JTAG Debug Enable */
#define BITM_FLASH_FEECON1_JTAGDEBUGEN                        (0X00000001U)  /* JTAG Debug Enable */
#define BITP_FLASH_FEECON1_KHDMAEN                            (1U)           /* Key – Hole DMA Enable. */
#define BITL_FLASH_FEECON1_KHDMAEN                            (1U)           /* Key – Hole DMA Enable. */
#define BITM_FLASH_FEECON1_KHDMAEN                            (0X00000002U)  /* Key – Hole DMA Enable. */
#define BITP_FLASH_FEECON1_AUTOINCREN                         (2U)           /* Auto Address Increment for Key Hole Access. */
#define BITL_FLASH_FEECON1_AUTOINCREN                         (1U)           /* Auto Address Increment for Key Hole Access. */
#define BITM_FLASH_FEECON1_AUTOINCREN                         (0X00000004U)  /* Auto Address Increment for Key Hole Access. */
#define BITP_FLASH_FEECON1_SWAPPROGRAMCODE                    (3U)           /* Swap Program Code for MDIO Mode. */
#define BITL_FLASH_FEECON1_SWAPPROGRAMCODE                    (1U)           /* Swap Program Code for MDIO Mode. */
#define BITM_FLASH_FEECON1_SWAPPROGRAMCODE                    (0X00000008U)  /* Swap Program Code for MDIO Mode. */
#define BITP_FLASH_FEECON1_MDIOMODE                           (4U)           /* MDIO Mode */
#define BITL_FLASH_FEECON1_MDIOMODE                           (1U)           /* MDIO Mode */
#define BITM_FLASH_FEECON1_MDIOMODE                           (0X00000010U)  /* MDIO Mode */
#define BITP_FLASH_FEECON1_SWAPFLASH0                         (5U)           /* Swap Top and Bottom Image Inside Flash 0. */
#define BITL_FLASH_FEECON1_SWAPFLASH0                         (1U)           /* Swap Top and Bottom Image Inside Flash 0. */
#define BITM_FLASH_FEECON1_SWAPFLASH0                         (0X00000020U)  /* Swap Top and Bottom Image Inside Flash 0. */
#define BITP_FLASH_FEECON1_SWAPFLASH1                         (6U)           /* Swap Top and Bottom Image Inside Flash 1. */
#define BITL_FLASH_FEECON1_SWAPFLASH1                         (1U)           /* Swap Top and Bottom Image Inside Flash 1. */
#define BITM_FLASH_FEECON1_SWAPFLASH1                         (0X00000040U)  /* Swap Top and Bottom Image Inside Flash 1. */
#define BITP_FLASH_FEECON1_SWAPINFLASHEN                      (8U)           /* Swap Inside Flash Enable */
#define BITL_FLASH_FEECON1_SWAPINFLASHEN                      (1U)           /* Swap Inside Flash Enable */
#define BITM_FLASH_FEECON1_SWAPINFLASHEN                      (0X00000100U)  /* Swap Inside Flash Enable */

/* ----------------------------------------------------------------------------------------------------
          FEEWRADDRA                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEWRADDRA_WRABORTADDR                     (0U)           /* Write Abort Address */
#define BITL_FLASH_FEEWRADDRA_WRABORTADDR                     (32U)          /* Write Abort Address */
#define BITM_FLASH_FEEWRADDRA_WRABORTADDR                     (0XFFFFFFFFU)  /* Write Abort Address */

/* ----------------------------------------------------------------------------------------------------
          FEEAEN0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEAEN0_SYSIRQABORTEN                      (0U)           /* Lower 32 Bits of System Interrupt Abort Enable. */
#define BITL_FLASH_FEEAEN0_SYSIRQABORTEN                      (32U)          /* Lower 32 Bits of System Interrupt Abort Enable. */
#define BITM_FLASH_FEEAEN0_SYSIRQABORTEN                      (0XFFFFFFFFU)  /* Lower 32 Bits of System Interrupt Abort Enable. */

