mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          FEEAEN1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEAEN1_SYSIRQABORTEN                      (0U)           /* Middle 32 Bits of System Interrupt Abort Enable. */
#define BITL_FLASH_FEEAEN1_SYSIRQABORTEN                      (32U)          /* Middle 32 Bits of System Interrupt Abort Enable. */
#define BITM_FLASH_FEEAEN1_SYSIRQABORTEN                      (0XFFFFFFFFU)  /* Middle 32 Bits of System Interrupt Abort Enable. */

/* ----------------------------------------------------------------------------------------------------
          FEEAEN2                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEAEN2_SYSIRQABORTEN                      (0U)           /* Upper 32 Bits of System Interrupt Abort Enable. */
#define BITL_FLASH_FEEAEN2_SYSIRQABORTEN                      (32U)          /* Upper 32 Bits of System Interrupt Abort Enable. */
#define BITM_FLASH_FEEAEN2_SYSIRQABORTEN                      (0XFFFFFFFFU)  /* Upper 32 Bits of System Interrupt Abort Enable. */

/* ----------------------------------------------------------------------------------------------------
          FEEECCCONFIG                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEECCCONFIG_ECCDISABLE                    (0U)           /* ECC Disable Bit. */
#define BITL_FLASH_FEEECCCONFIG_ECCDISABLE                    (1U)           /* ECC Disable Bit. */
#define BITM_FLASH_FEEECCCONFIG_ECCDISABLE                    (0X00000001U)  /* ECC Disable Bit. */
#define BITP_FLASH_FEEECCCONFIG_ECCAHBERROR                   (1U)           /* Signifies How to Generate AHB Error on ECC */
#define BITL_FLASH_FEEECCCONFIG_ECCAHBERROR                   (2U)           /* Signifies How to Generate AHB Error on ECC */
#define BITM_FLASH_FEEECCCONFIG_ECCAHBERROR                   (0X00000006U)  /* Signifies How to Generate AHB Error on ECC */
#define BITP_FLASH_FEEECCCONFIG_ECCINTRERROR                  (3U)           /* Interrupt Enable When a ECC Error Happens During an AHB Read */
#define BITL_FLASH_FEEECCCONFIG_ECCINTRERROR                  (2U)           /* Interrupt Enable When a ECC Error Happens During an AHB Read */
#define BITM_FLASH_FEEECCCONFIG_ECCINTRERROR                  (0X00000018U)  /* Interrupt Enable When a ECC Error Happens During an AHB Read */
#define BITP_FLASH_FEEECCCONFIG_ECCADDRCON                    (5U)           /* ECC Error Address Control Bit. */
#define BITL_FLASH_FEEECCCONFIG_ECCADDRCON                    (2U)           /* ECC Error Address Control Bit. */
#define BITM_FLASH_FEEECCCONFIG_ECCADDRCON                    (0X00000060U)  /* ECC Error Address Control Bit. */

#define ENUM_FLASH_FEEECCCONFIG_ECCADDRCON_NBUFNCLR           (0X00000000U)  /* ECC Error Address Register Can't Be Cleared Until Reset; Current ECC Error Address Will Be Returned Directly When Reading ECC_ADDR MMR. */
#define ENUM_FLASH_FEEECCCONFIG_ECCADDRCON_BUFNCLR            (0X00000001U)  /* ECC Error Address Register Can't Be Cleared Until Reset; ECC Error Address is Latched on Read of STATUS MMR, and It Will Be Returned When Reading ECC_ADDR MMR. */
#define ENUM_FLASH_FEEECCCONFIG_ECCINTRERROR_DISABLE          (0X00000000U)  /* Interrupt is Not Generated Even If There is an ECC Error While Reading from Flash via AHB. This Applies to Both Flash. */
#define ENUM_FLASH_FEEECCCONFIG_ECCINTRERROR_ERROR2BITEN      (0X00000001U)  /* Interrupt is Generated Only If 2 Bit Error is Detected During AHB Read to Flash 0 or 1. */
#define ENUM_FLASH_FEEECCCONFIG_ECCINTRERROR_ERROR1BITEN      (0X00000002U)  /* Interrupt is Generated Only If 1 Bit Error Corrected During AHB Read to Flash 0 or 1. */
#define ENUM_FLASH_FEEECCCONFIG_ECCINTRERROR_ERROR1OR2BITEN   (0X00000003U)  /* Interrupt is Generated If Either 2 Bit Detected or 1 Bit Error Corrected During AHB Read to Flash 0 or 1. */
#define ENUM_FLASH_FEEECCCONFIG_ECCAHBERROR_NOERROR           (0X00000000U)  /* AHB Error (HRESP = 1) is Not Generated Even If There is an ECC Error While Reading from Flash via AHB. This Applies to Both Flash. */
#define ENUM_FLASH_FEEECCCONFIG_ECCAHBERROR_ERROR2BIT         (0X00000001U)  /* AHB Error (HRESP = 1) is Generated Only If 2 Bit Error is Detected During AHB Read to Flash 0 or 1. */
#define ENUM_FLASH_FEEECCCONFIG_ECCAHBERROR_ERROR1BIT         (0X00000002U)  /* AHB Error (HRESP = 1) is Generated Only If 1 Bit Error Corrected During AHB Read to Flash 0 or 1 */
#define ENUM_FLASH_FEEECCCONFIG_ECCAHBERROR_ERROR1OR2BIT      (0X00000003U)  /* AHB Error (HRESP = 1) is Generated If Either 2 Bit Detected or 1 Bit Error Corrected During AHB Read to Flash 0 or 1 */

/* ----------------------------------------------------------------------------------------------------
          FEEECCADDRC0                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEECCADDRC0_FLECCADDRC0                   (0U)           /* Flash0 Address for Which ECC Error is Detected via CODE Bus. */
#define BITL_FLASH_FEEECCADDRC0_FLECCADDRC0                   (21U)          /* Flash0 Address for Which ECC Error is Detected via CODE Bus. */
#define BITM_FLASH_FEEECCADDRC0_FLECCADDRC0                   (0X001FFFFFU)  /* Flash0 Address for Which ECC Error is Detected via CODE Bus. */

/* ----------------------------------------------------------------------------------------------------
          FEEECCADDRC1                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEECCADDRC1_FLECCADDRC1                   (0U)           /* Flash1 Address for Which ECC Error is Detected via CODE Bus. */
#define BITL_FLASH_FEEECCADDRC1_FLECCADDRC1                   (21U)          /* Flash1 Address for Which ECC Error is Detected via CODE Bus. */
#define BITM_FLASH_FEEECCADDRC1_FLECCADDRC1                   (0X001FFFFFU)  /* Flash1 Address for Which ECC Error is Detected via CODE Bus. */

