mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          FEEECCADDRD0                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEECCADDRD0_FLECCADDRD0                   (0U)           /* Flash0 Address for Which ECC Error is Detected via DMA Bus. */
#define BITL_FLASH_FEEECCADDRD0_FLECCADDRD0                   (21U)          /* Flash0 Address for Which ECC Error is Detected via DMA Bus. */
#define BITM_FLASH_FEEECCADDRD0_FLECCADDRD0                   (0X001FFFFFU)  /* Flash0 Address for Which ECC Error is Detected via DMA Bus. */

/* ----------------------------------------------------------------------------------------------------
          FEEECCADDRD1                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEEECCADDRD1_FLECCADDRD1                   (0U)           /* Flash1 Address for Which ECC Error is Detected via DMA Bus. */
#define BITL_FLASH_FEEECCADDRD1_FLECCADDRD1                   (21U)          /* Flash1 Address for Which ECC Error is Detected via DMA Bus. */
#define BITM_FLASH_FEEECCADDRD1_FLECCADDRD1                   (0X001FFFFFU)  /* Flash1 Address for Which ECC Error is Detected via DMA Bus. */

#endif  /* end ifndef FLASH_ADDR_RDEF_H_ */


#ifndef GPIO_ADDR_RDEF_H_
#define GPIO_ADDR_RDEF_H_    /* GPIO: GPIO */

/* ====================================================================================================
        GPIO Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_GPIO0                                               (0X40050000U)    /* gpio0: */
#define INST_GPIO1                                               (0X40050050U)    /* gpio1: */
#define INST_GPIO2                                               (0X400500A0U)    /* gpio2: */
#define INST_GPIO3                                               (0X400500F0U)    /* gpio3: */
#define INST_GPIO4                                               (0X40050140U)    /* gpio4: */
#define INST_GPIO5                                               (0X40050190U)    /* gpio5: */
#define INST_GPIO6                                               (0X400501E0U)    /* gpio6: */
#define INST_GPIO7                                               (0X40050230U)    /* gpio7: */
#define INST_GPIO8                                               (0X40050280U)    /* gpio8: */

#define MASK_GPIO                                                (0XFFFFFFFFU)    /* GPIO: GPIO */

/* ====================================================================================================
        GPIO Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_GPIO_CON                                            (0X00000000U)    /* Port Configuration */
#define IDX_GPIO_OE                                             (0X00000004U)    /* Port Output Enable */
#define IDX_GPIO_IE                                             (0X00000008U)    /* Port Input Path Enable */
#define IDX_GPIO_IN                                             (0X0000000CU)    /* Port Registered Data Input */
#define IDX_GPIO_OUT                                            (0X00000010U)    /* Port Data Output */
#define IDX_GPIO_SET                                            (0X00000014U)    /* Port Data Out Set */
#define IDX_GPIO_CLR                                            (0X00000018U)    /* Port Data Out Clear */
#define IDX_GPIO_TGL                                            (0X0000001CU)    /* Port Pin Toggle */
#define IDX_GPIO_ODE                                            (0X00000020U)    /* Port Open Drain Enable */
#define IDX_GPIO_IS                                             (0X00000024U)    /* Port Input Select */
#define IDX_GPIO_PE                                             (0X00000028U)    /* Port Pull Enable */
#define IDX_GPIO_PS                                             (0X0000002CU)    /* Port Pull Select */
#define IDX_GPIO_SR                                             (0X00000030U)    /* Port Slew Rate */
#define IDX_GPIO_DS                                             (0X00000034U)    /* Port Drive Select */
#define IDX_GPIO_PWR                                            (0X00000038U)    /* Port Power Select */
#define IDX_GPIO_POL                                            (0X0000003CU)    /* GPIO Interrupt Polarity Select */
#define IDX_GPIO_IENA                                           (0X00000040U)    /* InterruptA Enable */
#define IDX_GPIO_IENB                                           (0X00000044U)    /* InterruptB Enable */
#define IDX_GPIO_INT                                            (0X00000048U)    /* Interrupt Status */

/* ====================================================================================================
        GPIO Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_GPIO_CON                                            (0X0) 
#define RSTVAL_GPIO_OE                                             (0X0) 
#define RSTVAL_GPIO_IE                                             (0X0) 
#define RSTVAL_GPIO_IN                                             (0X0) 
#define RSTVAL_GPIO_OUT                                            (0X0) 
#define RSTVAL_GPIO_SET                                            (0X0) 
#define RSTVAL_GPIO_CLR                                            (0X0) 
#define RSTVAL_GPIO_TGL                                            (0X0) 
#define RSTVAL_GPIO_ODE                                            (0X0) 
#define RSTVAL_GPIO_IS                                             (0XFF) 
#define RSTVAL_GPIO_PE                                             (0X0) 
#define RSTVAL_GPIO_PS                                             (0XFF) 
#define RSTVAL_GPIO_SR                                             (0X0) 
#define RSTVAL_GPIO_DS                                             (0X0) 
#define RSTVAL_GPIO_PWR                                            (0XFF) 
#define RSTVAL_GPIO_POL                                            (0X0) 
#define RSTVAL_GPIO_IENA                                           (0X0) 
#define RSTVAL_GPIO_IENB                                           (0X0) 
#define RSTVAL_GPIO_INT                                            (0X0) 

