mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        GPIO Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          CON                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_CON_CON0                                    (0U)           /* PIN 0 Configuration Bits */
#define BITL_GPIO_CON_CON0                                    (2U)           /* PIN 0 Configuration Bits */
#define BITM_GPIO_CON_CON0                                    (0X0003U)      /* PIN 0 Configuration Bits */
#define BITP_GPIO_CON_CON1                                    (2U)           /* PIN 1 Configuration Bits */
#define BITL_GPIO_CON_CON1                                    (2U)           /* PIN 1 Configuration Bits */
#define BITM_GPIO_CON_CON1                                    (0X000CU)      /* PIN 1 Configuration Bits */
#define BITP_GPIO_CON_CON2                                    (4U)           /* PIN 2 Configuration Bits */
#define BITL_GPIO_CON_CON2                                    (2U)           /* PIN 2 Configuration Bits */
#define BITM_GPIO_CON_CON2                                    (0X0030U)      /* PIN 2 Configuration Bits */
#define BITP_GPIO_CON_CON3                                    (6U)           /* PIN 3 Configuration Bits */
#define BITL_GPIO_CON_CON3                                    (2U)           /* PIN 3 Configuration Bits */
#define BITM_GPIO_CON_CON3                                    (0X00C0U)      /* PIN 3 Configuration Bits */
#define BITP_GPIO_CON_CON4                                    (8U)           /* PIN 4 Configuration Bits */
#define BITL_GPIO_CON_CON4                                    (2U)           /* PIN 4 Configuration Bits */
#define BITM_GPIO_CON_CON4                                    (0X0300U)      /* PIN 4 Configuration Bits */
#define BITP_GPIO_CON_CON5                                    (10U)          /* PIN 5 Configuration Bits */
#define BITL_GPIO_CON_CON5                                    (2U)           /* PIN 5 Configuration Bits */
#define BITM_GPIO_CON_CON5                                    (0X0C00U)      /* PIN 5 Configuration Bits */
#define BITP_GPIO_CON_CON6                                    (12U)          /* PIN 6 Configuration Bits */
#define BITL_GPIO_CON_CON6                                    (2U)           /* PIN 6 Configuration Bits */
#define BITM_GPIO_CON_CON6                                    (0X3000U)      /* PIN 6 Configuration Bits */
#define BITP_GPIO_CON_CON7                                    (14U)          /* PIN 6 Configuration Bits */
#define BITL_GPIO_CON_CON7                                    (2U)           /* PIN 6 Configuration Bits */
#define BITM_GPIO_CON_CON7                                    (0XC000U)      /* PIN 6 Configuration Bits */

#define ENUM_GPIO_CON_CON7_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON7_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON7_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON7_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON6_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON6_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON6_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON6_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON5_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON5_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON5_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON5_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON4_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON4_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON4_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON4_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON3_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON3_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON3_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON3_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON2_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON2_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON2_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON2_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON1_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON1_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON1_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON1_FUNCTION3                          (0X0003U)      /* No description provided */
#define ENUM_GPIO_CON_CON0_FUNCTION0                          (0X0000U)      /* No description provided */
#define ENUM_GPIO_CON_CON0_FUNCTION1                          (0X0001U)      /* No description provided */
#define ENUM_GPIO_CON_CON0_FUNCTION2                          (0X0002U)      /* No description provided */
#define ENUM_GPIO_CON_CON0_FUNCTION3                          (0X0003U)      /* No description provided */

