mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PS                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_PS_PS                                       (0U)           /* Pull Select */
#define BITL_GPIO_PS_PS                                       (8U)           /* Pull Select */
#define BITM_GPIO_PS_PS                                       (0XFFU)        /* Pull Select */

/* ----------------------------------------------------------------------------------------------------
          SR                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_SR_SR                                       (0U)           /* Slew Rate */
#define BITL_GPIO_SR_SR                                       (8U)           /* Slew Rate */
#define BITM_GPIO_SR_SR                                       (0XFFU)        /* Slew Rate */

/* ----------------------------------------------------------------------------------------------------
          DS                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_DS_DS0                                      (0U)           /* PIN 0 Drive Select */
#define BITL_GPIO_DS_DS0                                      (2U)           /* PIN 0 Drive Select */
#define BITM_GPIO_DS_DS0                                      (0X0003U)      /* PIN 0 Drive Select */
#define BITP_GPIO_DS_DS1                                      (2U)           /* PIN 1 Drive Select */
#define BITL_GPIO_DS_DS1                                      (2U)           /* PIN 1 Drive Select */
#define BITM_GPIO_DS_DS1                                      (0X000CU)      /* PIN 1 Drive Select */
#define BITP_GPIO_DS_DS2                                      (4U)           /* PIN 2 Drive Select */
#define BITL_GPIO_DS_DS2                                      (2U)           /* PIN 2 Drive Select */
#define BITM_GPIO_DS_DS2                                      (0X0030U)      /* PIN 2 Drive Select */
#define BITP_GPIO_DS_DS3                                      (6U)           /* PIN 3 Drive Select */
#define BITL_GPIO_DS_DS3                                      (2U)           /* PIN 3 Drive Select */
#define BITM_GPIO_DS_DS3                                      (0X00C0U)      /* PIN 3 Drive Select */
#define BITP_GPIO_DS_DS4                                      (8U)           /* PIN 4 Drive Select */
#define BITL_GPIO_DS_DS4                                      (2U)           /* PIN 4 Drive Select */
#define BITM_GPIO_DS_DS4                                      (0X0300U)      /* PIN 4 Drive Select */
#define BITP_GPIO_DS_DS5                                      (10U)          /* PIN 5 Drive Select */
#define BITL_GPIO_DS_DS5                                      (2U)           /* PIN 5 Drive Select */
#define BITM_GPIO_DS_DS5                                      (0X0C00U)      /* PIN 5 Drive Select */
#define BITP_GPIO_DS_DS6                                      (12U)          /* PIN6 Drive Select */
#define BITL_GPIO_DS_DS6                                      (2U)           /* PIN6 Drive Select */
#define BITM_GPIO_DS_DS6                                      (0X3000U)      /* PIN6 Drive Select */
#define BITP_GPIO_DS_DS7                                      (14U)          /* PIN 7 Drive Select */
#define BITL_GPIO_DS_DS7                                      (2U)           /* PIN 7 Drive Select */
#define BITM_GPIO_DS_DS7                                      (0XC000U)      /* PIN 7 Drive Select */

#define ENUM_GPIO_DS_DS7_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS7_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS7_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS7_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS6_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS6_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS6_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS6_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS5_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS5_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS5_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS5_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS4_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS4_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS4_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS4_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS3_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS3_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS3_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS3_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS2_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS2_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS2_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS2_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS1_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS1_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS1_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS1_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */
#define ENUM_GPIO_DS_DS0_STRENGTH1                            (0X0000U)      /* Drive Strength 1 */
#define ENUM_GPIO_DS_DS0_STRENGTH2                            (0X0001U)      /* Drive Strength 2 */
#define ENUM_GPIO_DS_DS0_STRENGTH3                            (0X0002U)      /* Drive Strength 3 */
#define ENUM_GPIO_DS_DS0_STRENGTH4                            (0X0003U)      /* Drive Strength 4 */

