mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          FIFOSTAT                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_FIFOSTAT_TX                                  (0U)           /* SPI Tx FIFO Status */
#define BITL_SPI_FIFOSTAT_TX                                  (4U)           /* SPI Tx FIFO Status */
#define BITM_SPI_FIFOSTAT_TX                                  (0X000FU)      /* SPI Tx FIFO Status */
#define BITP_SPI_FIFOSTAT_RX                                  (8U)           /* SPI Rx FIFO Status */
#define BITL_SPI_FIFOSTAT_RX                                  (4U)           /* SPI Rx FIFO Status */
#define BITM_SPI_FIFOSTAT_RX                                  (0X0F00U)      /* SPI Rx FIFO Status */

#define ENUM_SPI_FIFOSTAT_RX_EMPTY                            (0X0000U)      /* Rx FIFO Empty */
#define ENUM_SPI_FIFOSTAT_RX_ONE                              (0X0001U)      /* 1 Valid Byte/half-word in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_TWO                              (0X0002U)      /* 2 Valid Bytes/half-words in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_THREE                            (0X0003U)      /* 3 Valid Bytes/half-words in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_FOUR                             (0X0004U)      /* 4 Valid Bytes/half-words in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_FIVE                             (0X0005U)      /* 5 Valid Bytes/half-words in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_SIX                              (0X0006U)      /* 6 Valid Bytes/half-words in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_SEVEN                            (0X0007U)      /* 7 Valid Bytes/half-words in Rx FIFO */
#define ENUM_SPI_FIFOSTAT_RX_FULL                             (0X0008U)      /* 8 Valid Bytes/half-words in Rx FIFO (Rx FIFO Full) */
#define ENUM_SPI_FIFOSTAT_TX_EMPTY                            (0X0000U)      /* Tx FIFO Empty */
#define ENUM_SPI_FIFOSTAT_TX_ONE                              (0X0001U)      /* 1 Valid Byte/half-word in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_TWO                              (0X0002U)      /* 2 Valid Bytes/half-words in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_THREE                            (0X0003U)      /* 3 Valid Bytes/half-words in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_FOUR                             (0X0004U)      /* 4 Valid Bytes/half-words in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_FIVE                             (0X0005U)      /* 5 Valid Bytes/half-words in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_SIX                              (0X0006U)      /* 6 Valid Bytes/half-words in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_SEVEN                            (0X0007U)      /* 7 Valid Bytes/half-words in Tx FIFO */
#define ENUM_SPI_FIFOSTAT_TX_FULL                             (0X0008U)      /* 8 Valid Bytes/half-words in Tx FIFO (Tx FIFO Full) */

/* ----------------------------------------------------------------------------------------------------
          RDCTL                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_RDCTL_CMDEN                                  (0U)           /* Read Command Enable */
#define BITL_SPI_RDCTL_CMDEN                                  (1U)           /* Read Command Enable */
#define BITM_SPI_RDCTL_CMDEN                                  (0X0001U)      /* Read Command Enable */
#define BITP_SPI_RDCTL_OVERLAP                                (1U)           /* Tx/Rx Overlap Mode */
#define BITL_SPI_RDCTL_OVERLAP                                (1U)           /* Tx/Rx Overlap Mode */
#define BITM_SPI_RDCTL_OVERLAP                                (0X0002U)      /* Tx/Rx Overlap Mode */
#define BITP_SPI_RDCTL_TXBYTES                                (2U)           /* Transmit Byte Count Minus 1 for Read Command */
#define BITL_SPI_RDCTL_TXBYTES                                (4U)           /* Transmit Byte Count Minus 1 for Read Command */
#define BITM_SPI_RDCTL_TXBYTES                                (0X003CU)      /* Transmit Byte Count Minus 1 for Read Command */
#define BITP_SPI_RDCTL_THREEPIN                               (8U)           /* Three Pin SPI Mode */
#define BITL_SPI_RDCTL_THREEPIN                               (1U)           /* Three Pin SPI Mode */
#define BITM_SPI_RDCTL_THREEPIN                               (0X0100U)      /* Three Pin SPI Mode */

/* ----------------------------------------------------------------------------------------------------
          FLOWCTL                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_FLOWCTL_MODE                                 (0U)           /* Flow Control Mode */
#define BITL_SPI_FLOWCTL_MODE                                 (2U)           /* Flow Control Mode */
#define BITM_SPI_FLOWCTL_MODE                                 (0X0003U)      /* Flow Control Mode */
#define BITP_SPI_FLOWCTL_RDYPOL                               (4U)           /* Polarity of RDY/MISO Line */
#define BITL_SPI_FLOWCTL_RDYPOL                               (1U)           /* Polarity of RDY/MISO Line */
#define BITM_SPI_FLOWCTL_RDYPOL                               (0X0010U)      /* Polarity of RDY/MISO Line */
#define BITP_SPI_FLOWCTL_RDBURSTSZ                            (6U)           /* Read Data Burst Size Minus 1 */
#define BITL_SPI_FLOWCTL_RDBURSTSZ                            (10U)          /* Read Data Burst Size Minus 1 */
#define BITM_SPI_FLOWCTL_RDBURSTSZ                            (0XFFC0U)      /* Read Data Burst Size Minus 1 */

#define ENUM_SPI_FLOWCTL_RDYPOL_HIGH                          (0X0000U)      /* Polarity is Active HIGH. SPI Master Waits Until RDY/MISO Becomes HIGH. */
#define ENUM_SPI_FLOWCTL_RDYPOL_LOW                           (0X0001U)      /* Polarity is Active LOW. SPI Master Waits Until RDY/MISO Becomes LOW. */
#define ENUM_SPI_FLOWCTL_MODE_DISABLE                         (0X0000U)      /* Flow Control is Disabled. */
#define ENUM_SPI_FLOWCTL_MODE_TIMER                           (0X0001U)      /* Flow Control is Based on Timer (WAIT_TMR). */
#define ENUM_SPI_FLOWCTL_MODE_RDY                             (0X0002U)      /* Flow Control is Based on RDY Signal. */
#define ENUM_SPI_FLOWCTL_MODE_MISO                            (0X0003U)      /* Flow Control is Based on MISO Pin. */

