mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          WAITTMR                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_WAITTMR_TRIMS                                (0U)           /* Wait Timer for Flow-control */
#define BITL_SPI_WAITTMR_TRIMS                                (16U)          /* Wait Timer for Flow-control */
#define BITM_SPI_WAITTMR_TRIMS                                (0XFFFFU)      /* Wait Timer for Flow-control */

/* ----------------------------------------------------------------------------------------------------
          CSOVERRIDE                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_CSOVERRIDE_CTL                               (0U)           /* CS Override Control */
#define BITL_SPI_CSOVERRIDE_CTL                               (2U)           /* CS Override Control */
#define BITM_SPI_CSOVERRIDE_CTL                               (0X0003U)      /* CS Override Control */

#define ENUM_SPI_CSOVERRIDE_CTL_NOTFORCE                      (0X0000U)      /* CS is Not Forced. */
#define ENUM_SPI_CSOVERRIDE_CTL_FORCETO1                      (0X0001U)      /* CS is Forced to Drive 1'b1. */
#define ENUM_SPI_CSOVERRIDE_CTL_FORCETO0                      (0X0002U)      /* CS is Forced to Drive 1'b0. */

#endif  /* end ifndef SPI_ADDR_RDEF_H_ */


#ifndef CLOCK_ADDR_RDEF_H_
#define CLOCK_ADDR_RDEF_H_    /* CLOCK: Clock Gating and Other Settings */

/* ====================================================================================================
        CLOCK Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_CLK                                                 (0X40060000U)    /* clk: */

#define MASK_CLOCK                                               (0X000003FFU)    /* CLOCK: Clock Gating and Other Settings */

/* ====================================================================================================
        CLOCK Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_CLOCK_CLKCON0                                       (0X000U)    /* Misc Clock Settings Register */
#define IDX_CLOCK_CLKCON1                                       (0X004U)    /* Clock Dividers Register */
#define IDX_CLOCK_CLKSTAT0                                      (0X008U)    /* Clocking Status */

/* ====================================================================================================
        CLOCK Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_CLOCK_CLKCON0                                       (0X43C) 
#define RSTVAL_CLOCK_CLKCON1                                       (0X48) 
#define RSTVAL_CLOCK_CLKSTAT0                                      (0X0) 

/* ====================================================================================================
        CLOCK Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          CLKCON0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CLOCK_CLKCON0_CLKMUX                             (0U)           /* Clock Mux Select */
#define BITL_CLOCK_CLKCON0_CLKMUX                             (2U)           /* Clock Mux Select */
#define BITM_CLOCK_CLKCON0_CLKMUX                             (0X0003U)      /* Clock Mux Select */
#define BITP_CLOCK_CLKCON0_CLKOUT                             (2U)           /* GPIO CLK Out Select */
#define BITL_CLOCK_CLKCON0_CLKOUT                             (4U)           /* GPIO CLK Out Select */
#define BITM_CLOCK_CLKCON0_CLKOUT                             (0X003CU)      /* GPIO CLK Out Select */
#define BITP_CLOCK_CLKCON0_ANACLKMUX                          (7U)           /* Mux Selection Analog Clock Source */
#define BITL_CLOCK_CLKCON0_ANACLKMUX                          (2U)           /* Mux Selection Analog Clock Source */
#define BITM_CLOCK_CLKCON0_ANACLKMUX                          (0X0180U)      /* Mux Selection Analog Clock Source */
#define BITP_CLOCK_CLKCON0_SPLLIE                             (9U)           /* PLL Unlock and Lock Interrupt Enable */
#define BITL_CLOCK_CLKCON0_SPLLIE                             (1U)           /* PLL Unlock and Lock Interrupt Enable */
#define BITM_CLOCK_CLKCON0_SPLLIE                             (0X0200U)      /* PLL Unlock and Lock Interrupt Enable */

#define ENUM_CLOCK_CLKCON0_SPLLIE_DIS                         (0X0000U)      /* PLL Interrupt Will Not Be Generated */
#define ENUM_CLOCK_CLKCON0_SPLLIE_EN                          (0X0001U)      /* PLL Interrupt Will Be Generated */
#define ENUM_CLOCK_CLKCON0_ANACLKMUX_HFOSC                    (0X0000U)      /* Internal Oscillator is Selected (HFOSC) */
#define ENUM_CLOCK_CLKCON0_ANACLKMUX_GPIOCLK                  (0X0002U)      /* GPIO Clock */
#define ENUM_CLOCK_CLKCON0_CLKOUT_HFOSC                       (0X0000U)      /* HFOSC (16 MHz) */
#define ENUM_CLOCK_CLKCON0_CLKOUT_ROOT                        (0X0001U)      /* Root Clock */
#define ENUM_CLOCK_CLKCON0_CLKOUT_LFOSC                       (0X0003U)      /* 32K OSC */
#define ENUM_CLOCK_CLKCON0_CLKOUT_CORE                        (0X0004U)      /* Core Clock */
#define ENUM_CLOCK_CLKCON0_CLKOUT_B0_PCLK                     (0X0005U)      /* Bridge 0 Pclk */
#define ENUM_CLOCK_CLKCON0_CLKOUT_B1_PCLK                     (0X0006U)      /* Bridge 1 PCLK */
#define ENUM_CLOCK_CLKCON0_CLKOUT_B2_PCLK                     (0X0007U)      /* Bridge 2 PCLK */
#define ENUM_CLOCK_CLKCON0_CLKOUT_ANA_CLK                     (0X0008U)      /* Analog Test Signal */
#define ENUM_CLOCK_CLKCON0_CLKOUT_T0                          (0X0009U)      /* Timer 0 Clock */
#define ENUM_CLOCK_CLKCON0_CLKOUT_WUT                         (0X000AU)      /* Wake up Timer Clock */
#define ENUM_CLOCK_CLKCON0_CLKOUT_T3                          (0X000BU)      /* Timer 3 Clock */
#define ENUM_CLOCK_CLKCON0_CLKOUT_HCLKBUS                     (0X000CU)      /* Hclk_bus */
#define ENUM_CLOCK_CLKCON0_CLKOUT_SPLL_CLK                    (0X000DU)      /* SPLL clock */
#define ENUM_CLOCK_CLKCON0_CLKMUX_HFOSC                       (0X0000U)      /* High Frequency Internal Oscillator (HFOSC) */
#define ENUM_CLOCK_CLKCON0_CLKMUX_SPLL                        (0X0001U)      /* System PLL is Selected (160 MHz) */
#define ENUM_CLOCK_CLKCON0_CLKMUX_EXTCLK                      (0X0003U)      /* External GPIO Port is Selected (ECLKIN) */

