mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          CLKCON1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CLOCK_CLKCON1_CDHCLK                             (0U)           /* HCLK Divide Bits */
#define BITL_CLOCK_CLKCON1_CDHCLK                             (3U)           /* HCLK Divide Bits */
#define BITM_CLOCK_CLKCON1_CDHCLK                             (0X0007U)      /* HCLK Divide Bits */
#define BITP_CLOCK_CLKCON1_CDPCLK0                            (3U)           /* APB0 PCLK Divide Bits */
#define BITL_CLOCK_CLKCON1_CDPCLK0                            (3U)           /* APB0 PCLK Divide Bits */
#define BITM_CLOCK_CLKCON1_CDPCLK0                            (0X0038U)      /* APB0 PCLK Divide Bits */
#define BITP_CLOCK_CLKCON1_CDPCLK1                            (6U)           /* APB1 PCLK Divide Bits */
#define BITL_CLOCK_CLKCON1_CDPCLK1                            (3U)           /* APB1 PCLK Divide Bits */
#define BITM_CLOCK_CLKCON1_CDPCLK1                            (0X01C0U)      /* APB1 PCLK Divide Bits */

#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV1                       (0X0000U)      /* DIV1. Divide by 1 (PCLK is Equal to Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV2                       (0X0001U)      /* DIV2. Divide by 2 (PCLK is Half the Frequency of Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV4                       (0X0002U)      /* DIV4. Divide by 4 (PCLK is Quarter the Frequency of Root Clock, 20 MHz) */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV8                       (0X0003U)      /* DIV8. Divide by 8 */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV16                      (0X0004U)      /* DIV16. Divide by 16 */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV32                      (0X0005U)      /* DIV32. Divide by 32 */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV64                      (0X0006U)      /* DIV64. Divide by 164 */
#define ENUM_CLOCK_CLKCON1_CDPCLK1_DIV128                     (0X0007U)      /* DIV128. Divide by 128 */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV1                       (0X0000U)      /* DIV1. Divide by 1 (PCLK is Equal to Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV2                       (0X0001U)      /* DIV2. Divide by 2 (PCLK is Half the Frequency of Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV4                       (0X0002U)      /* DIV4. Divide by 4 (PCLK is Quarter the Frequency of Root Clock, 20 MHz) */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV8                       (0X0003U)      /* DIV8. Divide by 8 */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV16                      (0X0004U)      /* DIV16. Divide by 16 */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV32                      (0X0005U)      /* DIV32. Divide by 32 */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV64                      (0X0006U)      /* DIV64. Divide by 164 */
#define ENUM_CLOCK_CLKCON1_CDPCLK0_DIV128                     (0X0007U)      /* DIV128. Divide by 128 */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV1                        (0X0000U)      /* DIV1. Divide by 1 (HCLK is Equal to Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV2                        (0X0001U)      /* DIV2. Divide by 2 (HCLK is Half the Frequency of Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV4                        (0X0002U)      /* DIV4. Divide by 4 (HCLK is Quarter the Frequency of Root Clock) */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV8                        (0X0003U)      /* DIV8. Divide by 8 */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV16                       (0X0004U)      /* DIV16.Divide by 16 */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV32                       (0X0005U)      /* DIV32.Divide by 32 */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV64                       (0X0006U)      /* DIV64.Divide by 64 */
#define ENUM_CLOCK_CLKCON1_CDHCLK_DIV128                      (0X0007U)      /* DIV128. Divide by 128 */

/* ----------------------------------------------------------------------------------------------------
          CLKSTAT0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CLOCK_CLKSTAT0_SPLLSTATUS                        (0U)           /* System PLL Status */
#define BITL_CLOCK_CLKSTAT0_SPLLSTATUS                        (1U)           /* System PLL Status */
#define BITM_CLOCK_CLKSTAT0_SPLLSTATUS                        (0X0001U)      /* System PLL Status */
#define BITP_CLOCK_CLKSTAT0_SPLLLOCKCLR                       (1U)           /* System PLL Lock */
#define BITL_CLOCK_CLKSTAT0_SPLLLOCKCLR                       (1U)           /* System PLL Lock */
#define BITM_CLOCK_CLKSTAT0_SPLLLOCKCLR                       (0X0002U)      /* System PLL Lock */
#define BITP_CLOCK_CLKSTAT0_SPLLUNLOCKCLR                     (2U)           /* System PLL Unlock */
#define BITL_CLOCK_CLKSTAT0_SPLLUNLOCKCLR                     (1U)           /* System PLL Unlock */
#define BITM_CLOCK_CLKSTAT0_SPLLUNLOCKCLR                     (0X0004U)      /* System PLL Unlock */
#define BITP_CLOCK_CLKSTAT0_SPLLLOCK                          (3U)           /* Sticky System PLL Lock Flag */
#define BITL_CLOCK_CLKSTAT0_SPLLLOCK                          (1U)           /* Sticky System PLL Lock Flag */
#define BITM_CLOCK_CLKSTAT0_SPLLLOCK                          (0X0008U)      /* Sticky System PLL Lock Flag */
#define BITP_CLOCK_CLKSTAT0_SPLLUNLOCK                        (4U)           /* Sticky System PLL Unlock Flag */
#define BITL_CLOCK_CLKSTAT0_SPLLUNLOCK                        (1U)           /* Sticky System PLL Unlock Flag */
#define BITM_CLOCK_CLKSTAT0_SPLLUNLOCK                        (0X0010U)      /* Sticky System PLL Unlock Flag */

#define ENUM_CLOCK_CLKSTAT0_SPLLUNLOCK_UNLOCKED               (0X0000U)      /* No PLL Lock Event Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLUNLOCK_LOCKED                 (0X0001U)      /* A PLL Lock Event Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLLOCK_UNLOCKED                 (0X0000U)      /* No PLL Lock Event Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLLOCK_LOCKED                   (0X0001U)      /* A PLL Lock Event Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLUNLOCKCLR_NOLOSS              (0X0000U)      /* No Loss of PLL Lock Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLUNLOCKCLR_LOSS                (0X0001U)      /* A PLL Loss of Lock Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLLOCKCLR_UNLOCKED              (0X0000U)      /* No PLL Lock Event Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLLOCKCLR_LOCKED                (0X0001U)      /* A PLL Lock Event Was Detected */
#define ENUM_CLOCK_CLKSTAT0_SPLLSTATUS_UNLOCKED               (0X0000U)      /* The PLL is Not Locked or Not Properly Configured. the PLL is Not Ready for Use as the System Clock Source */
#define ENUM_CLOCK_CLKSTAT0_SPLLSTATUS_LOCKED                 (0X0001U)      /* The PLL is Locked and is Ready for Use as the System Clock Source */

#endif  /* end ifndef CLOCK_ADDR_RDEF_H_ */


#ifndef PWM_ADDR_RDEF_H_
#define PWM_ADDR_RDEF_H_    /* PWM: PWM MMR */

