mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PWM0COM1                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM0COM1_PWM0COM1                            (0U)           /* Compare Register 1 for PWM0 and PWM1 */
#define BITL_PWM_PWM0COM1_PWM0COM1                            (16U)          /* Compare Register 1 for PWM0 and PWM1 */
#define BITM_PWM_PWM0COM1_PWM0COM1                            (0XFFFFU)      /* Compare Register 1 for PWM0 and PWM1 */

/* ----------------------------------------------------------------------------------------------------
          PWM0COM2                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM0COM2_PWM0COM2                            (0U)           /* Compare Register 2 for PWM0 and PWM1 */
#define BITL_PWM_PWM0COM2_PWM0COM2                            (16U)          /* Compare Register 2 for PWM0 and PWM1 */
#define BITM_PWM_PWM0COM2_PWM0COM2                            (0XFFFFU)      /* Compare Register 2 for PWM0 and PWM1 */

/* ----------------------------------------------------------------------------------------------------
          PWM0LEN                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM0LEN_PWM0LEN                              (0U)           /* Period Value Register for PWM0 and PWM1 */
#define BITL_PWM_PWM0LEN_PWM0LEN                              (16U)          /* Period Value Register for PWM0 and PWM1 */
#define BITM_PWM_PWM0LEN_PWM0LEN                              (0XFFFFU)      /* Period Value Register for PWM0 and PWM1 */

/* ----------------------------------------------------------------------------------------------------
          PWM1COM0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM1COM0_PWM1COM0                            (0U)           /* Compare Register 0 for PWM2 and PWM3 */
#define BITL_PWM_PWM1COM0_PWM1COM0                            (16U)          /* Compare Register 0 for PWM2 and PWM3 */
#define BITM_PWM_PWM1COM0_PWM1COM0                            (0XFFFFU)      /* Compare Register 0 for PWM2 and PWM3 */

/* ----------------------------------------------------------------------------------------------------
          PWM1COM1                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM1COM1_PWM1COM1                            (0U)           /* Compare Register 1 for PWM2 and PWM3 */
#define BITL_PWM_PWM1COM1_PWM1COM1                            (16U)          /* Compare Register 1 for PWM2 and PWM3 */
#define BITM_PWM_PWM1COM1_PWM1COM1                            (0XFFFFU)      /* Compare Register 1 for PWM2 and PWM3 */

/* ----------------------------------------------------------------------------------------------------
          PWM1COM2                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM1COM2_PWM1COM2                            (0U)           /* Compare Register 2 for PWM2 and PWM3 */
#define BITL_PWM_PWM1COM2_PWM1COM2                            (16U)          /* Compare Register 2 for PWM2 and PWM3 */
#define BITM_PWM_PWM1COM2_PWM1COM2                            (0XFFFFU)      /* Compare Register 2 for PWM2 and PWM3 */

/* ----------------------------------------------------------------------------------------------------
          PWM1LEN                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM1LEN_PWM1LEN                              (0U)           /* Period Value Register for PWM2 and PWM3 */
#define BITL_PWM_PWM1LEN_PWM1LEN                              (16U)          /* Period Value Register for PWM2 and PWM3 */
#define BITM_PWM_PWM1LEN_PWM1LEN                              (0XFFFFU)      /* Period Value Register for PWM2 and PWM3 */

/* ----------------------------------------------------------------------------------------------------
          PWM2COM0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM2COM0_PWM2COM0                            (0U)           /* Compare Register 0 for PWM4 and PWM5 */
#define BITL_PWM_PWM2COM0_PWM2COM0                            (16U)          /* Compare Register 0 for PWM4 and PWM5 */
#define BITM_PWM_PWM2COM0_PWM2COM0                            (0XFFFFU)      /* Compare Register 0 for PWM4 and PWM5 */

/* ----------------------------------------------------------------------------------------------------
          PWM2COM1                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM2COM1_PWM2COM1                            (0U)           /* Compare Register 1 for PWM4 and PWM5 */
#define BITL_PWM_PWM2COM1_PWM2COM1                            (16U)          /* Compare Register 1 for PWM4 and PWM5 */
#define BITM_PWM_PWM2COM1_PWM2COM1                            (0XFFFFU)      /* Compare Register 1 for PWM4 and PWM5 */

