mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PWM2COM2                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM2COM2_PWM2COM2                            (0U)           /* Compare Register 2 for PWM4 and PWM5 */
#define BITL_PWM_PWM2COM2_PWM2COM2                            (16U)          /* Compare Register 2 for PWM4 and PWM5 */
#define BITM_PWM_PWM2COM2_PWM2COM2                            (0XFFFFU)      /* Compare Register 2 for PWM4 and PWM5 */

/* ----------------------------------------------------------------------------------------------------
          PWM2LEN                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM2LEN_PWM2LEN                              (0U)           /* Period Value Register for PWM4 and PWM5 */
#define BITL_PWM_PWM2LEN_PWM2LEN                              (16U)          /* Period Value Register for PWM4 and PWM5 */
#define BITM_PWM_PWM2LEN_PWM2LEN                              (0XFFFFU)      /* Period Value Register for PWM4 and PWM5 */

/* ----------------------------------------------------------------------------------------------------
          PWM3COM0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM3COM0_PWM3COM0                            (0U)           /* Compare Register 0 for PWM6 and PWM7 */
#define BITL_PWM_PWM3COM0_PWM3COM0                            (16U)          /* Compare Register 0 for PWM6 and PWM7 */
#define BITM_PWM_PWM3COM0_PWM3COM0                            (0XFFFFU)      /* Compare Register 0 for PWM6 and PWM7 */

/* ----------------------------------------------------------------------------------------------------
          PWM3COM1                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM3COM1_PWM3COM1                            (0U)           /* Compare Register 1 for PWM6 and PWM7 */
#define BITL_PWM_PWM3COM1_PWM3COM1                            (16U)          /* Compare Register 1 for PWM6 and PWM7 */
#define BITM_PWM_PWM3COM1_PWM3COM1                            (0XFFFFU)      /* Compare Register 1 for PWM6 and PWM7 */

/* ----------------------------------------------------------------------------------------------------
          PWM3COM2                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM3COM2_PWM3COM2                            (0U)           /* Compare Register 2 for PWM6 and PWM7 */
#define BITL_PWM_PWM3COM2_PWM3COM2                            (16U)          /* Compare Register 2 for PWM6 and PWM7 */
#define BITM_PWM_PWM3COM2_PWM3COM2                            (0XFFFFU)      /* Compare Register 2 for PWM6 and PWM7 */

/* ----------------------------------------------------------------------------------------------------
          PWM3LEN                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM3LEN_PWM3LEN                              (0U)           /* Period Value Register for PWM6 and PWM7 */
#define BITL_PWM_PWM3LEN_PWM3LEN                              (16U)          /* Period Value Register for PWM6 and PWM7 */
#define BITM_PWM_PWM3LEN_PWM3LEN                              (0XFFFFU)      /* Period Value Register for PWM6 and PWM7 */

#endif  /* end ifndef PWM_ADDR_RDEF_H_ */


#ifndef SUBSYS_ADDR_RDEF_H_
#define SUBSYS_ADDR_RDEF_H_    /* SUBSYS: Your module description, here. */

/* ====================================================================================================
        SUBSYS Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_SRAM                                                (0X40065000U)    /* sram: */

#define MASK_SUBSYS                                              (0X00000FFFU)    /* SUBSYS: Your module description, here. */

/* ====================================================================================================
        SUBSYS Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_SUBSYS_SRAMCON                                      (0X000U)    /* SRAM Control Register */
#define IDX_SUBSYS_SRAMECCCON                                   (0X00CU)    /* SRAM ECC Control Register */
#define IDX_SUBSYS_SRAMECCSTA                                   (0X010U)    /* SRAM ECC Status Register */
#define IDX_SUBSYS_SRAMECCA0                                    (0X014U)    /* SRAM0 ECC Error Address Register */
#define IDX_SUBSYS_SRAMECCD0                                    (0X018U)    /* SRAM0 ECC Error Data Register */
#define IDX_SUBSYS_SRAMECCP0                                    (0X01CU)    /* SRAM0 ECC Error Parity Register */
#define IDX_SUBSYS_SRAMECCA1                                    (0X020U)    /* SRAM1 ECC Error Address Register */
#define IDX_SUBSYS_SRAMECCD1                                    (0X024U)    /* SRAM1 ECC Error Data Register */
#define IDX_SUBSYS_SRAMECCP1                                    (0X028U)    /* SRAM1 ECC Error Parity Register */
#define IDX_SUBSYS_SRAMECCA2                                    (0X02CU)    /* SRAM2 ECC Error Address Register */
#define IDX_SUBSYS_SRAMECCD2                                    (0X030U)    /* SRAM2 ECC Error Data Register */
#define IDX_SUBSYS_SRAMECCP2                                    (0X034U)    /* SRAM2 ECC Error Parity Register */

