mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        SUBSYS Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_SUBSYS_SRAMCON                                      (0X2) 
#define RSTVAL_SUBSYS_SRAMECCCON                                   (0XCF) 
#define RSTVAL_SUBSYS_SRAMECCSTA                                   (0X0) 
#define RSTVAL_SUBSYS_SRAMECCA0                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCD0                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCP0                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCA1                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCD1                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCP1                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCA2                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCD2                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCP2                                    (0X0) 

/* ====================================================================================================
        SUBSYS Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          SRAMCON                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMCON_REMAP                             (0U)           /* Using SRAM0 as Instruction SRAM */
#define BITL_SUBSYS_SRAMCON_REMAP                             (1U)           /* Using SRAM0 as Instruction SRAM */
#define BITM_SUBSYS_SRAMCON_REMAP                             (0X00000001U)  /* Using SRAM0 as Instruction SRAM */
#define BITP_SUBSYS_SRAMCON_CSEL                              (1U)           /* Use Cache as a Part of SRAM0 */
#define BITL_SUBSYS_SRAMCON_CSEL                              (1U)           /* Use Cache as a Part of SRAM0 */
#define BITM_SUBSYS_SRAMCON_CSEL                              (0X00000002U)  /* Use Cache as a Part of SRAM0 */

#define ENUM_SUBSYS_SRAMCON_CSEL_CAS                          (0X00000001U)  /* Cache as SRAM */
#define ENUM_SUBSYS_SRAMCON_CSEL_NCAS                         (0X00000000U)  /* Cache not as SRAM */
#define ENUM_SUBSYS_SRAMCON_REMAP_CODRAM                      (0X00000000U)  /* Using as Code SRAM */
#define ENUM_SUBSYS_SRAMCON_REMAP_SYSRAM                      (0X00000001U)  /* Using as System SRAM */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCCON                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCCON_EN                             (0U)           /* ECC Check Enable */
#define BITL_SUBSYS_SRAMECCCON_EN                             (3U)           /* ECC Check Enable */
#define BITM_SUBSYS_SRAMECCCON_EN                             (0X00000007U)  /* ECC Check Enable */
#define BITP_SUBSYS_SRAMECCCON_BUSERRTYPE                     (3U)           /* ECC AHB Bus Error Response Type */
#define BITL_SUBSYS_SRAMECCCON_BUSERRTYPE                     (2U)           /* ECC AHB Bus Error Response Type */
#define BITM_SUBSYS_SRAMECCCON_BUSERRTYPE                     (0X00000018U)  /* ECC AHB Bus Error Response Type */
#define BITP_SUBSYS_SRAMECCCON_INTERRTYPE                     (5U)           /* ECC Interrupt Error Response Type */
#define BITL_SUBSYS_SRAMECCCON_INTERRTYPE                     (2U)           /* ECC Interrupt Error Response Type */
#define BITM_SUBSYS_SRAMECCCON_INTERRTYPE                     (0X00000060U)  /* ECC Interrupt Error Response Type */
#define BITP_SUBSYS_SRAMECCCON_RECERRTYPE                     (7U)           /* ECC Error Address and Data Record Type */
#define BITL_SUBSYS_SRAMECCCON_RECERRTYPE                     (2U)           /* ECC Error Address and Data Record Type */
#define BITM_SUBSYS_SRAMECCCON_RECERRTYPE                     (0X00000180U)  /* ECC Error Address and Data Record Type */

#define ENUM_SUBSYS_SRAMECCCON_RECERRTYPE_CURERR              (0X00000000U)  /* Return Current Error Address and Data Information */
#define ENUM_SUBSYS_SRAMECCCON_RECERRTYPE_STRERR0             (0X00000001U)  /* Return Stored Error Address and Data Information */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_NOERR               (0X00000000U)  /* No Error Report */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_ERR2B               (0X00000001U)  /* 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_ERR1B               (0X00000002U)  /* 1 Bit Error Report */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_ALERR               (0X00000003U)  /* 1 or 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_NOERR               (0X00000000U)  /* No Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_ERR2B               (0X00000001U)  /* 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_ERR1B               (0X00000002U)  /* 1 Bit Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_ALERR               (0X00000003U)  /* 1 or 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN0                         (0X00000001U)  /* SRAM0 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN1                         (0X00000002U)  /* SRAM1 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN2                         (0X00000004U)  /* SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN01                        (0X00000003U)  /* SRAM0 and SRAM1 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN02                        (0X00000005U)  /* SRAM0 and SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN12                        (0X00000006U)  /* SRAM1 and SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN012                       (0X00000007U)  /* SRAM0 and SRAM1 and SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_ENNA                        (0X00000000U)  /* None SRAM ECC Enable */

