mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          SRAMECCSTA                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCSTA_S0ERR2B                        (0U)           /* SRAM0 ECC 2 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S0ERR2B                        (1U)           /* SRAM0 ECC 2 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S0ERR2B                        (0X00000001U)  /* SRAM0 ECC 2 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_S0ERR1B                        (1U)           /* SRAM0 ECC 1 Bit Error */
#define BITL_SUBSYS_SRAMECCSTA_S0ERR1B                        (1U)           /* SRAM0 ECC 1 Bit Error */
#define BITM_SUBSYS_SRAMECCSTA_S0ERR1B                        (0X00000002U)  /* SRAM0 ECC 1 Bit Error */
#define BITP_SUBSYS_SRAMECCSTA_S1ERR2B                        (2U)           /* SRAM1 ECC 2 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S1ERR2B                        (1U)           /* SRAM1 ECC 2 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S1ERR2B                        (0X00000004U)  /* SRAM1 ECC 2 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_S1ERR1B                        (3U)           /* SRAM1 ECC 1 Bit Error */
#define BITL_SUBSYS_SRAMECCSTA_S1ERR1B                        (1U)           /* SRAM1 ECC 1 Bit Error */
#define BITM_SUBSYS_SRAMECCSTA_S1ERR1B                        (0X00000008U)  /* SRAM1 ECC 1 Bit Error */
#define BITP_SUBSYS_SRAMECCSTA_S2ERR2B                        (4U)           /* SRAM2 ECC 2 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S2ERR2B                        (1U)           /* SRAM2 ECC 2 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S2ERR2B                        (0X00000010U)  /* SRAM2 ECC 2 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_S2ERR1B                        (5U)           /* SRAM2 ECC 1 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S2ERR1B                        (1U)           /* SRAM2 ECC 1 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S2ERR1B                        (0X00000020U)  /* SRAM2 ECC 1 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_ERRCNT                         (8U)           /* ECC Error Counter */
#define BITL_SUBSYS_SRAMECCSTA_ERRCNT                         (3U)           /* ECC Error Counter */
#define BITM_SUBSYS_SRAMECCSTA_ERRCNT                         (0X00000700U)  /* ECC Error Counter */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCA0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCA0_ADDR                            (0U)           /* ECC Error Address */
#define BITL_SUBSYS_SRAMECCA0_ADDR                            (32U)          /* ECC Error Address */
#define BITM_SUBSYS_SRAMECCA0_ADDR                            (0XFFFFFFFFU)  /* ECC Error Address */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCD0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCD0_DATA                            (0U)           /* ECC Error Raw Data */
#define BITL_SUBSYS_SRAMECCD0_DATA                            (32U)          /* ECC Error Raw Data */
#define BITM_SUBSYS_SRAMECCD0_DATA                            (0XFFFFFFFFU)  /* ECC Error Raw Data */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCP0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCP0_PARITY                          (0U)           /* ECC Error Raw Parity */
#define BITL_SUBSYS_SRAMECCP0_PARITY                          (7U)           /* ECC Error Raw Parity */
#define BITM_SUBSYS_SRAMECCP0_PARITY                          (0X0000007FU)  /* ECC Error Raw Parity */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCA1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCA1_ADDR                            (0U)           /* ECC Error Address */
#define BITL_SUBSYS_SRAMECCA1_ADDR                            (32U)          /* ECC Error Address */
#define BITM_SUBSYS_SRAMECCA1_ADDR                            (0XFFFFFFFFU)  /* ECC Error Address */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCD1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCD1_DATA                            (0U)           /* ECC Error Raw Data */
#define BITL_SUBSYS_SRAMECCD1_DATA                            (32U)          /* ECC Error Raw Data */
#define BITM_SUBSYS_SRAMECCD1_DATA                            (0XFFFFFFFFU)  /* ECC Error Raw Data */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCP1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCP1_PARITY                          (0U)           /* ECC Error Raw Parity */
#define BITL_SUBSYS_SRAMECCP1_PARITY                          (7U)           /* ECC Error Raw Parity */
#define BITM_SUBSYS_SRAMECCP1_PARITY                          (0X0000007FU)  /* ECC Error Raw Parity */

