mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          SRAMECCA2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCA2_ADDR                            (0U)           /* ECC Error Address */
#define BITL_SUBSYS_SRAMECCA2_ADDR                            (32U)          /* ECC Error Address */
#define BITM_SUBSYS_SRAMECCA2_ADDR                            (0XFFFFFFFFU)  /* ECC Error Address */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCD2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCD2_DATA                            (0U)           /* ECC Error Raw Data */
#define BITL_SUBSYS_SRAMECCD2_DATA                            (32U)          /* ECC Error Raw Data */
#define BITM_SUBSYS_SRAMECCD2_DATA                            (0XFFFFFFFFU)  /* ECC Error Raw Data */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCP2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCP2_PARITY                          (0U)           /* ECC Error Raw Parity */
#define BITL_SUBSYS_SRAMECCP2_PARITY                          (7U)           /* ECC Error Raw Parity */
#define BITM_SUBSYS_SRAMECCP2_PARITY                          (0X0000007FU)  /* ECC Error Raw Parity */

#endif  /* end ifndef SUBSYS_ADDR_RDEF_H_ */


#ifndef CRC_ADDR_RDEF_H_
#define CRC_ADDR_RDEF_H_    /* CRC: CRC Accelerator */

/* ====================================================================================================
        CRC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_CRC                                                 (0X40066000U)    /* crc: */

#define MASK_CRC                                                 (0X000000FFU)    /* CRC: CRC Accelerator */

/* ====================================================================================================
        CRC Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_CRC_CTL                                             (0X00U)    /* CRC Control Register */
#define IDX_CRC_IPDATA                                          (0X04U)    /* Input Data Word Register */
#define IDX_CRC_RESULT                                          (0X08U)    /* CRC Result Register */
#define IDX_CRC_POLY                                            (0X0CU)    /* Programmable CRC Polynomial */

/* ====================================================================================================
        CRC Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_CRC_CTL                                             (0X10000000) 
#define RSTVAL_CRC_IPDATA                                          (0X0) 
#define RSTVAL_CRC_RESULT                                          (0X0) 
#define RSTVAL_CRC_POLY                                            (0X4C11DB7) 

/* ====================================================================================================
        CRC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          CTL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_CTL_EN                                       (0U)           /* CRC Peripheral Enable */
#define BITL_CRC_CTL_EN                                       (1U)           /* CRC Peripheral Enable */
#define BITM_CRC_CTL_EN                                       (0X00000001U)  /* CRC Peripheral Enable */
#define BITP_CRC_CTL_LSBFIRST                                 (1U)           /* LSB First Calculation Order */
#define BITL_CRC_CTL_LSBFIRST                                 (1U)           /* LSB First Calculation Order */
#define BITM_CRC_CTL_LSBFIRST                                 (0X00000002U)  /* LSB First Calculation Order */
#define BITP_CRC_CTL_BITMIRR                                  (2U)           /* Bit Mirroring */
#define BITL_CRC_CTL_BITMIRR                                  (1U)           /* Bit Mirroring */
#define BITM_CRC_CTL_BITMIRR                                  (0X00000004U)  /* Bit Mirroring */
#define BITP_CRC_CTL_BYTMIRR                                  (3U)           /* Byte Mirroring */
#define BITL_CRC_CTL_BYTMIRR                                  (1U)           /* Byte Mirroring */
#define BITM_CRC_CTL_BYTMIRR                                  (0X00000008U)  /* Byte Mirroring */
#define BITP_CRC_CTL_W16SWP                                   (4U)           /* Word16 Swap */
#define BITL_CRC_CTL_W16SWP                                   (1U)           /* Word16 Swap */
#define BITM_CRC_CTL_W16SWP                                   (0X00000010U)  /* Word16 Swap */
#define BITP_CRC_CTL_REVID                                    (28U)          /* Revision ID */
#define BITL_CRC_CTL_REVID                                    (4U)           /* Revision ID */
#define BITM_CRC_CTL_REVID                                    (0XF0000000U)  /* Revision ID */

