mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          IPDATA                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_IPDATA_DATA_WORD                             (0U)           /* Data Input. */
#define BITL_CRC_IPDATA_DATA_WORD                             (32U)          /* Data Input. */
#define BITM_CRC_IPDATA_DATA_WORD                             (0XFFFFFFFFU)  /* Data Input. */

/* ----------------------------------------------------------------------------------------------------
          RESULT                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_RESULT_RESIDUE                               (0U)           /* CRC Residue */
#define BITL_CRC_RESULT_RESIDUE                               (32U)          /* CRC Residue */
#define BITM_CRC_RESULT_RESIDUE                               (0XFFFFFFFFU)  /* CRC Residue */

/* ----------------------------------------------------------------------------------------------------
          POLY                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_POLY_REDUCTION_POLY                          (0U)           /* CRC Reduction Polynomial */
#define BITL_CRC_POLY_REDUCTION_POLY                          (32U)          /* CRC Reduction Polynomial */
#define BITM_CRC_POLY_REDUCTION_POLY                          (0XFFFFFFFFU)  /* CRC Reduction Polynomial */

#endif  /* end ifndef CRC_ADDR_RDEF_H_ */


#ifndef ADC_ADDR_RDEF_H_
#define ADC_ADDR_RDEF_H_    /* ADC: Your module description, here. */

/* ====================================================================================================
        ADC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_ADC                                                 (0X40068000U)    /* adc: */

#define MASK_ADC                                                 (0X000007FFU)    /* ADC: Your module description, here. */

/* ====================================================================================================
        ADC Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_ADC_ADCDAT0                                         (0X000U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT1                                         (0X004U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT2                                         (0X008U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT3                                         (0X00CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT4                                         (0X010U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT5                                         (0X014U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT6                                         (0X018U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT7                                         (0X01CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT8                                         (0X020U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT9                                         (0X024U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT10                                        (0X028U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT11                                        (0X02CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT12                                        (0X030U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT13                                        (0X034U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT14                                        (0X038U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT15                                        (0X03CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT16                                        (0X040U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT17                                        (0X044U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT18                                        (0X048U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT19                                        (0X04CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT20                                        (0X050U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT21                                        (0X054U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT22                                        (0X058U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT23                                        (0X05CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT24                                        (0X060U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT25                                        (0X064U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT26                                        (0X068U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT27                                        (0X06CU)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT28                                        (0X070U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCDAT29                                        (0X074U)    /* ADCx Data and Flags */
#define IDX_ADC_ADCCON                                          (0X078U)    /* ADC Configuration */
#define IDX_ADC_PREBUFCON                                       (0X07CU)    /* Pre-charge Buffer Control */
#define IDX_ADC_ADCCNVC                                         (0X080U)    /* ADC Conversion Cycle for Positive Input Channels */
#define IDX_ADC_ADCCNVCSLOW                                     (0X084U)    /* ADC Conversion Cycle for Positive Input Channels */
#define IDX_ADC_ADCCHA                                          (0X088U)    /* ADC Channel Select */
#define IDX_ADC_ADCIRQSTAT                                      (0X08CU)    /* ADC Interrupt Status */
#define IDX_ADC_ADCSEQ                                          (0X090U)    /* ADC Sequencer Control */
#define IDX_ADC_ADCSEQC                                         (0X094U)    /* ADC Sequencer Configuration */
#define IDX_ADC_ADCSEQS                                         (0X098U)    /* ADC Sequencer Status */
#define IDX_ADC_ADCSEQCH                                        (0X09CU)    /* ADC Sequencer Channel 0 */
#define IDX_ADC_ADCSEQCHMUX0                                    (0X0A0U)    /* ADC Sequencer Channel 1 */
#define IDX_ADC_ADCSEQCHMUX1                                    (0X0A4U)    /* ADC Sequencer Channel 1 */
#define IDX_ADC_ADCCMP                                          (0X0A8U)    /* Digital Comparator 0 Configuration */
#define IDX_ADC_ADCCMPIRQSTAT                                   (0X0ACU)    /* Digital Comparator Interrupt Status */
#define IDX_ADC_ADCOFGNDIFF                                     (0X0B0U)    /* ADC Offset Gain Differential Channel Error Correction */
#define IDX_ADC_ADCOFTEMP                                       (0X0B4U)    /* ADC Offset Gain Temp Sensor Channel Error Correction */
#define IDX_ADC_ADCGNTEMP                                       (0X0B8U)    /* ADC Offset Gain Temp Sensor Channel Error Correction */
#define IDX_ADC_ADCOFGNPGA0                                     (0X0BCU)    /* ADC Offset Gain PGA0 Channel Error Correction */
#define IDX_ADC_ADCOFGNPGA1                                     (0X0C0U)    /* ADC Offset Gain PGA1 Channel Error Correction */
#define IDX_ADC_ADCOFGNPGA2                                     (0X0C4U)    /* ADC Offset Gain PGA2 Channel Error Correction */
#define IDX_ADC_ADCOFGNPGA3                                     (0X0C8U)    /* ADC Offset Gain PGA3 Channel Error Correction */
#define IDX_ADC_ADCCMP1                                         (0X154U)    /* Digital Comparator 1 Configuration */
#define IDX_ADC_ADCCMP2                                         (0X158U)    /* Digital Comparator 2 Configuration */
#define IDX_ADC_ADCCMP3                                         (0X15CU)    /* Digital Comparator 3 Configuration */

