mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PREBUFCON                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_PREBUFCON_PRGBYPP                            (0U)           /* Bypass P Channel Pre_buf */
#define BITL_ADC_PREBUFCON_PRGBYPP                            (1U)           /* Bypass P Channel Pre_buf */
#define BITM_ADC_PREBUFCON_PRGBYPP                            (0X00000001U)  /* Bypass P Channel Pre_buf */
#define BITP_ADC_PREBUFCON_PRGBYPN                            (1U)           /* Bypass N Channel Pre_buf */
#define BITL_ADC_PREBUFCON_PRGBYPN                            (1U)           /* Bypass N Channel Pre_buf */
#define BITM_ADC_PREBUFCON_PRGBYPN                            (0X00000002U)  /* Bypass N Channel Pre_buf */

/* ----------------------------------------------------------------------------------------------------
          ADCCNVC                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCNVC_CNVC                                 (0U)           /* CNV Frequency Configuration for Positive Channels */
#define BITL_ADC_ADCCNVC_CNVC                                 (32U)          /* CNV Frequency Configuration for Positive Channels */
#define BITM_ADC_ADCCNVC_CNVC                                 (0XFFFFFFFFU)  /* CNV Frequency Configuration for Positive Channels */

/* ----------------------------------------------------------------------------------------------------
          ADCCNVCSLOW                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCNVCSLOW_CNVCSLOW                         (0U)           /* CNV Frequency Configuration for 100KSPS Channels */
#define BITL_ADC_ADCCNVCSLOW_CNVCSLOW                         (32U)          /* CNV Frequency Configuration for 100KSPS Channels */
#define BITM_ADC_ADCCNVCSLOW_CNVCSLOW                         (0XFFFFFFFFU)  /* CNV Frequency Configuration for 100KSPS Channels */

/* ----------------------------------------------------------------------------------------------------
          ADCCHA                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCHA_ADCCP                                 (0U)           /* ADC P Channel Selection */
#define BITL_ADC_ADCCHA_ADCCP                                 (5U)           /* ADC P Channel Selection */
#define BITM_ADC_ADCCHA_ADCCP                                 (0X0000001FU)  /* ADC P Channel Selection */
#define BITP_ADC_ADCCHA_ADCCN                                 (5U)           /* ADC N Channel Selection */
#define BITL_ADC_ADCCHA_ADCCN                                 (4U)           /* ADC N Channel Selection */
#define BITM_ADC_ADCCHA_ADCCN                                 (0X000001E0U)  /* ADC N Channel Selection */

#define ENUM_ADC_ADCCHA_ADCCP_AIN0                            (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN1                            (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN2                            (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN3                            (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN4                            (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN5                            (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN6                            (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN7                            (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN8                            (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN9                            (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN10                           (0X0000000AU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN11                           (0X0000000BU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN12                           (0X0000000CU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN13                           (0X0000000DU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN14                           (0X0000000EU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AIN15                           (0X0000000FU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_PGA0                            (0X00000010U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_PGA1                            (0X00000011U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_PGA2                            (0X00000012U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_PGA3                            (0X00000013U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_TEMPSNS                         (0X00000014U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AVDDDIV2                        (0X00000015U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_IOVDD0DIV2                      (0X00000016U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_IOVDD1                          (0X00000017U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_HVTIA0                          (0X00000018U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_HVTIA1                          (0X00000019U)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_HVTIA2                          (0X0000001AU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_HVTIA3                          (0X0000001BU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_HVTIA4                          (0X0000001CU)  /* No description provided */
#define ENUM_ADC_ADCCHA_ADCCP_AVSS                            (0X0000001DU)  /* No description provided */

