mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          ADCSEQCHMUX1                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCSEQCHMUX1_DIF12                           (0U)           /* When AIN12 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX1_DIF12                           (4U)           /* When AIN12 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX1_DIF12                           (0X0000000FU)  /* When AIN12 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX1_DIF13                           (4U)           /* When AIN13 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX1_DIF13                           (1U)           /* When AIN13 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX1_DIF13                           (0X00000010U)  /* When AIN13 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX1_DIF14                           (5U)           /* When AIN14 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX1_DIF14                           (4U)           /* When AIN14 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX1_DIF14                           (0X000001E0U)  /* When AIN14 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX1_DIF15                           (9U)           /* When AIN15 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX1_DIF15                           (1U)           /* When AIN15 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX1_DIF15                           (0X00000200U)  /* When AIN15 is N Ch. P Ch. Mux Selection in Sequencer Mode */

#define ENUM_ADC_ADCSEQCHMUX1_DIF15_REFN                      (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF15_REFP                      (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_REFN                      (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_REFP                      (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN1                      (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN3                      (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN5                      (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN7                      (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN9                      (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN11                     (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN13                     (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF14_AIN15                     (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF13_REFN                      (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF13_REFP                      (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_REFN                      (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_REFP                      (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN1                      (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN3                      (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN5                      (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN7                      (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN9                      (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN11                     (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN13                     (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX1_DIF12_AIN15                     (0X00000009U)  /* No description provided */

/* ----------------------------------------------------------------------------------------------------
          ADCCMP                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCMP_EN                                    (0U)           /* Digital Comparator Enable */
#define BITL_ADC_ADCCMP_EN                                    (1U)           /* Digital Comparator Enable */
#define BITM_ADC_ADCCMP_EN                                    (0X00000001U)  /* Digital Comparator Enable */
#define BITP_ADC_ADCCMP_CMPDIR                                (1U)           /* Select Digital Comparator Direction */
#define BITL_ADC_ADCCMP_CMPDIR                                (1U)           /* Select Digital Comparator Direction */
#define BITM_ADC_ADCCMP_CMPDIR                                (0X00000002U)  /* Select Digital Comparator Direction */
#define BITP_ADC_ADCCMP_THR                                   (2U)           /* Compare Threshold */
#define BITL_ADC_ADCCMP_THR                                   (16U)          /* Compare Threshold */
#define BITM_ADC_ADCCMP_THR                                   (0X0003FFFCU)  /* Compare Threshold */
#define BITP_ADC_ADCCMP_IRQEN                                 (18U)          /* Enable IRQ Generation */
#define BITL_ADC_ADCCMP_IRQEN                                 (1U)           /* Enable IRQ Generation */
#define BITM_ADC_ADCCMP_IRQEN                                 (0X00040000U)  /* Enable IRQ Generation */
#define BITP_ADC_ADCCMP_CH                                    (19U)          /* Channel Index for Data Comparison */
#define BITL_ADC_ADCCMP_CH                                    (5U)           /* Channel Index for Data Comparison */
#define BITM_ADC_ADCCMP_CH                                    (0X00F80000U)  /* Channel Index for Data Comparison */

