mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          ADCCMPIRQSTAT                                         Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCMPIRQSTAT_COMP0IRQSTA                    (0U)           /* Comparator0 Interrupt Status */
#define BITL_ADC_ADCCMPIRQSTAT_COMP0IRQSTA                    (1U)           /* Comparator0 Interrupt Status */
#define BITM_ADC_ADCCMPIRQSTAT_COMP0IRQSTA                    (0X00000001U)  /* Comparator0 Interrupt Status */
#define BITP_ADC_ADCCMPIRQSTAT_COMP1IRQSTA                    (1U)           /* Comparator1 Interrupt Status */
#define BITL_ADC_ADCCMPIRQSTAT_COMP1IRQSTA                    (1U)           /* Comparator1 Interrupt Status */
#define BITM_ADC_ADCCMPIRQSTAT_COMP1IRQSTA                    (0X00000002U)  /* Comparator1 Interrupt Status */
#define BITP_ADC_ADCCMPIRQSTAT_COMP2IRQSTA                    (2U)           /* Comparator2 Interrupt Status */
#define BITL_ADC_ADCCMPIRQSTAT_COMP2IRQSTA                    (1U)           /* Comparator2 Interrupt Status */
#define BITM_ADC_ADCCMPIRQSTAT_COMP2IRQSTA                    (0X00000004U)  /* Comparator2 Interrupt Status */
#define BITP_ADC_ADCCMPIRQSTAT_COMP3IRQSTA                    (3U)           /* Comparator3 Interrupt Status */
#define BITL_ADC_ADCCMPIRQSTAT_COMP3IRQSTA                    (1U)           /* Comparator3 Interrupt Status */
#define BITM_ADC_ADCCMPIRQSTAT_COMP3IRQSTA                    (0X00000008U)  /* Comparator3 Interrupt Status */
#define BITP_ADC_ADCCMPIRQSTAT_COMP0IRQCLR                    (4U)           /* Comparator0 Interrupt Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP0IRQCLR                    (1U)           /* Comparator0 Interrupt Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP0IRQCLR                    (0X00000010U)  /* Comparator0 Interrupt Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP1IRQCLR                    (5U)           /* Comparator1 Interrupt Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP1IRQCLR                    (1U)           /* Comparator1 Interrupt Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP1IRQCLR                    (0X00000020U)  /* Comparator1 Interrupt Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP2IRQCLR                    (6U)           /* Comparator2 Interrupt Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP2IRQCLR                    (1U)           /* Comparator2 Interrupt Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP2IRQCLR                    (0X00000040U)  /* Comparator2 Interrupt Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP3IRQCLR                    (7U)           /* Comparator3 Interrupt Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP3IRQCLR                    (1U)           /* Comparator3 Interrupt Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP3IRQCLR                    (0X00000080U)  /* Comparator3 Interrupt Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP0PLACLR                    (8U)           /* Comparator0 to PLA Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP0PLACLR                    (1U)           /* Comparator0 to PLA Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP0PLACLR                    (0X00000100U)  /* Comparator0 to PLA Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP1PLACLR                    (9U)           /* Comparator1 to PLA Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP1PLACLR                    (1U)           /* Comparator1 to PLA Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP1PLACLR                    (0X00000200U)  /* Comparator1 to PLA Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP2PLACLR                    (10U)          /* Comparator2 to PLA Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP2PLACLR                    (1U)           /* Comparator2 to PLA Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP2PLACLR                    (0X00000400U)  /* Comparator2 to PLA Clear */
#define BITP_ADC_ADCCMPIRQSTAT_COMP3PLACLR                    (11U)          /* Comparator3 to PLA Clear */
#define BITL_ADC_ADCCMPIRQSTAT_COMP3PLACLR                    (1U)           /* Comparator3 to PLA Clear */
#define BITM_ADC_ADCCMPIRQSTAT_COMP3PLACLR                    (0X00000800U)  /* Comparator3 to PLA Clear */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNDIFF                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNDIFF_GAIN                             (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNDIFF_GAIN                             (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNDIFF_GAIN                             (0X00007FFFU)  /* Gain Error Correction */
#define BITP_ADC_ADCOFGNDIFF_OFFSET                           (15U)          /* Offset Error Correction */
#define BITL_ADC_ADCOFGNDIFF_OFFSET                           (17U)          /* Offset Error Correction */
#define BITM_ADC_ADCOFGNDIFF_OFFSET                           (0XFFFF8000U)  /* Offset Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFTEMP                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFTEMP_OFFSET                             (0U)           /* Offset Error Correction */
#define BITL_ADC_ADCOFTEMP_OFFSET                             (17U)          /* Offset Error Correction */
#define BITM_ADC_ADCOFTEMP_OFFSET                             (0X0001FFFFU)  /* Offset Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCGNTEMP                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCGNTEMP_GAIN                               (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCGNTEMP_GAIN                               (20U)          /* Gain Error Correction */
#define BITM_ADC_ADCGNTEMP_GAIN                               (0X000FFFFFU)  /* Gain Error Correction */

