mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          COMPIRQSTAT                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_COMP_COMPIRQSTAT_COMP0                           (0U)           /* Comparator 0 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP0                           (1U)           /* Comparator 0 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP0                           (0X00000001U)  /* Comparator 0 Interrupt Status */
#define BITP_COMP_COMPIRQSTAT_COMP1                           (1U)           /* Comparator 1 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP1                           (1U)           /* Comparator 1 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP1                           (0X00000002U)  /* Comparator 1 Interrupt Status */
#define BITP_COMP_COMPIRQSTAT_COMP2                           (2U)           /* Comparator 2 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP2                           (1U)           /* Comparator 2 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP2                           (0X00000004U)  /* Comparator 2 Interrupt Status */
#define BITP_COMP_COMPIRQSTAT_COMP3                           (3U)           /* Comparator 3 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP3                           (1U)           /* Comparator 3 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP3                           (0X00000008U)  /* Comparator 3 Interrupt Status */

#endif  /* end ifndef COMP_ADDR_RDEF_H_ */


#ifndef PGA_ADDR_RDEF_H_
#define PGA_ADDR_RDEF_H_    /* PGA: Your module description, here. */

/* ====================================================================================================
        PGA Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_PGA                                                 (0X40069000U)    /* pga: */

#define MASK_PGA                                                 (0X000001FFU)    /* PGA: Your module description, here. */

/* ====================================================================================================
        PGA Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_PGA_PGABIASCON                                      (0X000U)    /* PGA Bias Circuit Control Signal */
#define IDX_PGA_PGA0CON                                         (0X020U)    /* PGA0 Control Register */
#define IDX_PGA_PGA0CHPCON                                      (0X024U)    /* PGA0 Chop Function Ctrl */
#define IDX_PGA_PGA3CHPCON                                      (0X028U)    /* PGA3 Chop Function Ctrl */
#define IDX_PGA_PGA1CON                                         (0X070U)    /* PGA1 Control Register */
#define IDX_PGA_PGA1CHPCON                                      (0X074U)    /* PGA1 Chop Function Ctrl */
#define IDX_PGA_PGA2CON                                         (0X0A0U)    /* PGA2 Control Register */
#define IDX_PGA_PGA2CHPCON                                      (0X0A4U)    /* PGA2 Chop Function Ctrl */
#define IDX_PGA_PGA3CON                                         (0X0D0U)    /* PGA3 Control Register */

/* ====================================================================================================
        PGA Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_PGA_PGABIASCON                                      (0X3F) 
#define RSTVAL_PGA_PGA0CON                                         (0X19) 
#define RSTVAL_PGA_PGA0CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA3CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA1CON                                         (0X11) 
#define RSTVAL_PGA_PGA1CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA2CON                                         (0X19) 
#define RSTVAL_PGA_PGA2CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA3CON                                         (0X11) 

/* ====================================================================================================
        PGA Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          PGABIASCON                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PGA_PGABIASCON_PD0BUF0P2                         (0U)           /* Buf_200mv Power Down */
#define BITL_PGA_PGABIASCON_PD0BUF0P2                         (1U)           /* Buf_200mv Power Down */
#define BITM_PGA_PGABIASCON_PD0BUF0P2                         (0X00000001U)  /* Buf_200mv Power Down */
#define BITP_PGA_PGABIASCON_PD1BUF0P2                         (1U)           /* Buf_200mv Power Down */
#define BITL_PGA_PGABIASCON_PD1BUF0P2                         (1U)           /* Buf_200mv Power Down */
#define BITM_PGA_PGABIASCON_PD1BUF0P2                         (0X00000002U)  /* Buf_200mv Power Down */
#define BITP_PGA_PGABIASCON_PD0BUF1P25                        (2U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD0BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD0BUF1P25                        (0X00000004U)  /* BUF1P25 Power Down */
#define BITP_PGA_PGABIASCON_PD1BUF1P25                        (3U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD1BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD1BUF1P25                        (0X00000008U)  /* BUF1P25 Power Down */
#define BITP_PGA_PGABIASCON_PD2BUF1P25                        (4U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD2BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD2BUF1P25                        (0X00000010U)  /* BUF1P25 Power Down */
#define BITP_PGA_PGABIASCON_PD3BUF1P25                        (5U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD3BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD3BUF1P25                        (0X00000020U)  /* BUF1P25 Power Down */

#define ENUM_PGA_PGABIASCON_PD3BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD3BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD2BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD2BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD1BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD1BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD0BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD0BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD1BUF0P2_ENABLE                  (0X00000000U)  /* Buf_200mV Enable */
#define ENUM_PGA_PGABIASCON_PD1BUF0P2_OFF                     (0X00000001U)  /* Buf_200mv Power Down */
#define ENUM_PGA_PGABIASCON_PD0BUF0P2_ENABLE                  (0X00000000U)  /* Buf_200mV Enable */
#define ENUM_PGA_PGABIASCON_PD0BUF0P2_OFF                     (0X00000001U)  /* Buf_200mv Power Down */

