mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          PGA0CHPCON                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PGA_PGA0CHPCON_CHOPOFF                           (0U)           /* Disable Chop Function */
#define BITL_PGA_PGA0CHPCON_CHOPOFF                           (1U)           /* Disable Chop Function */
#define BITM_PGA_PGA0CHPCON_CHOPOFF                           (0X00000001U)  /* Disable Chop Function */

#define ENUM_PGA_PGA0CHPCON_CHOPOFF_CHOPEN                    (0X00000000U)  /* Enable Chop Function */
#define ENUM_PGA_PGA0CHPCON_CHOPOFF_CHOPDIS                   (0X00000001U)  /* Disable Chop Function */

/* ----------------------------------------------------------------------------------------------------
          PGA3CHPCON                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PGA_PGA3CHPCON_CHOPOFF                           (0U)           /* Disable Chop Function */
#define BITL_PGA_PGA3CHPCON_CHOPOFF                           (1U)           /* Disable Chop Function */
#define BITM_PGA_PGA3CHPCON_CHOPOFF                           (0X00000001U)  /* Disable Chop Function */

#define ENUM_PGA_PGA3CHPCON_CHOPOFF_CHOPEN                    (0X00000000U)  /* Enable Chop Function */
#define ENUM_PGA_PGA3CHPCON_CHOPOFF_CHOPDIS                   (0X00000001U)  /* Disable Chop Function */

/* ----------------------------------------------------------------------------------------------------
          PGA1CON                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PGA_PGA1CON_PDPGACORE                            (0U)           /* PGA Core Power Down */
#define BITL_PGA_PGA1CON_PDPGACORE                            (1U)           /* PGA Core Power Down */
#define BITM_PGA_PGA1CON_PDPGACORE                            (0X00000001U)  /* PGA Core Power Down */
#define BITP_PGA_PGA1CON_MODE                                 (1U)           /* PGA or TIA Mode Selection */
#define BITL_PGA_PGA1CON_MODE                                 (1U)           /* PGA or TIA Mode Selection */
#define BITM_PGA_PGA1CON_MODE                                 (0X00000002U)  /* PGA or TIA Mode Selection */
#define BITP_PGA_PGA1CON_PGAMODE                              (2U)           /* PGA DC Mode or AC Couple Mode Selection */
#define BITL_PGA_PGA1CON_PGAMODE                              (1U)           /* PGA DC Mode or AC Couple Mode Selection */
#define BITM_PGA_PGA1CON_PGAMODE                              (0X00000004U)  /* PGA DC Mode or AC Couple Mode Selection */
#define BITP_PGA_PGA1CON_PGAGAIN                              (5U)           /* PGA Gain Configuration */
#define BITL_PGA_PGA1CON_PGAGAIN                              (3U)           /* PGA Gain Configuration */
#define BITM_PGA_PGA1CON_PGAGAIN                              (0X000000E0U)  /* PGA Gain Configuration */
#define BITP_PGA_PGA1CON_TIAGAIN                              (8U)           /* TIA Gain Configuration */
#define BITL_PGA_PGA1CON_TIAGAIN                              (3U)           /* TIA Gain Configuration */
#define BITM_PGA_PGA1CON_TIAGAIN                              (0X00000700U)  /* TIA Gain Configuration */
#define BITP_PGA_PGA1CON_TIAVDACSEL                           (11U)          /* TIA Vbias Selection of VDAC Channel */
#define BITL_PGA_PGA1CON_TIAVDACSEL                           (2U)           /* TIA Vbias Selection of VDAC Channel */
#define BITM_PGA_PGA1CON_TIAVDACSEL                           (0X00001800U)  /* TIA Vbias Selection of VDAC Channel */
#define BITP_PGA_PGA1CON_DRVEN                                (14U)          /* Sink Current Ability Improve */
#define BITL_PGA_PGA1CON_DRVEN                                (1U)           /* Sink Current Ability Improve */
#define BITM_PGA_PGA1CON_DRVEN                                (0X00004000U)  /* Sink Current Ability Improve */
#define BITP_PGA_PGA1CON_TIASRCEN                             (15U)          /* Select Between Source Mode and Sink Mode */
#define BITL_PGA_PGA1CON_TIASRCEN                             (1U)           /* Select Between Source Mode and Sink Mode */
#define BITM_PGA_PGA1CON_TIASRCEN                             (0X00008000U)  /* Select Between Source Mode and Sink Mode */

#define ENUM_PGA_PGA1CON_TIASRCEN_SINKMD                      (0X00000000U)  /* Sink Mode */
#define ENUM_PGA_PGA1CON_TIASRCEN_SOURCEMD                    (0X00000001U)  /* Source Mode */
#define ENUM_PGA_PGA1CON_DRVEN_DRVDISABLE                     (0X00000000U)  /* Disable Isink Ability Improvement, Normal Drive */
#define ENUM_PGA_PGA1CON_DRVEN_DRVENABLE                      (0X00000001U)  /* Enable Isink Ability Improvement */
#define ENUM_PGA_PGA1CON_TIAVDACSEL_VDAC8SEL                  (0X00000000U)  /* Select VDAC8 as TIA Vbias */
#define ENUM_PGA_PGA1CON_TIAVDACSEL_VDAC9SEL                  (0X00000001U)  /* Select VDAC9 as TIA Vbias */
#define ENUM_PGA_PGA1CON_TIAVDACSEL_VDAC10SEL                 (0X00000002U)  /* Select VDAC10 as TIA Vbias */
#define ENUM_PGA_PGA1CON_TIAVDACSEL_VDAC11SEL                 (0X00000003U)  /* Select VDAC11 as TIA Vbias */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES250                       (0X00000000U)  /* TIARES=250ohm */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES750                       (0X00000001U)  /* TIARES=750ohm */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES2K                        (0X00000002U)  /* TIARES=2kohm */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES5K                        (0X00000003U)  /* TIARES=5kohm */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES10K                       (0X00000004U)  /* TIARES=10kohm */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES20K                       (0X00000005U)  /* TIARES=20kohm */
#define ENUM_PGA_PGA1CON_TIAGAIN_RES100K                      (0X00000006U)  /* TIARES=100kohm */
#define ENUM_PGA_PGA1CON_PGAGAIN_GAIN1                        (0X00000000U)  /* Gain=1 */
#define ENUM_PGA_PGA1CON_PGAGAIN_GAIN2                        (0X00000001U)  /* GAIN=2 */
#define ENUM_PGA_PGA1CON_PGAGAIN_GAIN4                        (0X00000002U)  /* GAIN=4 */
#define ENUM_PGA_PGA1CON_PGAGAIN_GAIN6                        (0X00000003U)  /* GAIN=6 */
#define ENUM_PGA_PGA1CON_PGAGAIN_GAIN8                        (0X00000004U)  /* GAIN=8 */
#define ENUM_PGA_PGA1CON_PGAGAIN_GAIN10                       (0X00000005U)  /* GAIN=10 */
#define ENUM_PGA_PGA1CON_PGAMODE_DCCOUPLE                     (0X00000000U)  /* PGA DC Mode Enable */
#define ENUM_PGA_PGA1CON_PGAMODE_ACCOUPLE                     (0X00000001U)  /* PGA AC Coupling Mode Enable */
#define ENUM_PGA_PGA1CON_MODE_PGAMODE                         (0X00000000U)  /* PGA Mode Enable */
#define ENUM_PGA_PGA1CON_MODE_TIAMODE                         (0X00000001U)  /* TIA Mode Enable */

