mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        PLL_MMRS Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_PLL                                                 (0X40069200U)    /* pll: */

#define MASK_PLL_MMRS                                            (0X000001FFU)    /* PLL_MMRS: Your module description, here. */

/* ====================================================================================================
        PLL_MMRS Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_PLL_MMRS_PLLPDCTRL                                  (0X000U)    /* No description provided */

/* ====================================================================================================
        PLL_MMRS Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_PLL_MMRS_PLLPDCTRL                                  (0X3F) 

/* ====================================================================================================
        PLL_MMRS Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          PLLPDCTRL                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLL_MMRS_PLLPDCTRL_TOTPDB                        (6U)           /* PDB of PLL All */
#define BITL_PLL_MMRS_PLLPDCTRL_TOTPDB                        (1U)           /* PDB of PLL All */
#define BITM_PLL_MMRS_PLLPDCTRL_TOTPDB                        (0X00000040U)  /* PDB of PLL All */

#endif  /* end ifndef PLL_MMRS_ADDR_RDEF_H_ */


#ifndef VCM_MMRS_ADDR_RDEF_H_
#define VCM_MMRS_ADDR_RDEF_H_    /* VCM_MMRS: Your module description, here. */

/* ====================================================================================================
        VCM_MMRS Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_TMPSNS                                              (0X40069600U)    /* tmpsns: */

#define MASK_VCM_MMRS                                            (0X000001FFU)    /* VCM_MMRS: Your module description, here. */

/* ====================================================================================================
        VCM_MMRS Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_VCM_MMRS_TMPSNSCON                                  (0X000U)    /* No description provided */
#define IDX_VCM_MMRS_TMPSNSCHPCON                               (0X004U)    /* No description provided */
#define IDX_VCM_MMRS_VCMREFCON                                  (0X008U)    /* No description provided */
#define IDX_VCM_MMRS_VCMBUFCON                                  (0X010U)    /* No description provided */

/* ====================================================================================================
        VCM_MMRS Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_VCM_MMRS_TMPSNSCON                                  (0X2) 
#define RSTVAL_VCM_MMRS_TMPSNSCHPCON                               (0X0) 
#define RSTVAL_VCM_MMRS_VCMREFCON                                  (0X0) 
#define RSTVAL_VCM_MMRS_VCMBUFCON                                  (0X13) 

/* ====================================================================================================
        VCM_MMRS Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          TMPSNSCON                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_VCM_MMRS_TMPSNSCON_ENTMPSNS                      (1U)           /* Enable Temp Sensor */
#define BITL_VCM_MMRS_TMPSNSCON_ENTMPSNS                      (1U)           /* Enable Temp Sensor */
#define BITM_VCM_MMRS_TMPSNSCON_ENTMPSNS                      (0X00000002U)  /* Enable Temp Sensor */

/* ----------------------------------------------------------------------------------------------------
          TMPSNSCHPCON                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_VCM_MMRS_TMPSNSCHPCON_CHOFFTMPSNS                (0U)           /* Chopping Disable = 1 Enable = 0 */
#define BITL_VCM_MMRS_TMPSNSCHPCON_CHOFFTMPSNS                (1U)           /* Chopping Disable = 1 Enable = 0 */
#define BITM_VCM_MMRS_TMPSNSCHPCON_CHOFFTMPSNS                (0X00000001U)  /* Chopping Disable = 1 Enable = 0 */

/* ----------------------------------------------------------------------------------------------------
          VCMREFCON                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_VCM_MMRS_VCMREFCON_PGAREFSEL                     (1U)           /* 0.2V or 0.5V Selection for PGA */
#define BITL_VCM_MMRS_VCMREFCON_PGAREFSEL                     (1U)           /* 0.2V or 0.5V Selection for PGA */
#define BITM_VCM_MMRS_VCMREFCON_PGAREFSEL                     (0X00000002U)  /* 0.2V or 0.5V Selection for PGA */

#define ENUM_VCM_MMRS_VCMREFCON_PGAREFSEL_SEL0P2V             (0X00000000U)  /* Select 0.2V Reference */
#define ENUM_VCM_MMRS_VCMREFCON_PGAREFSEL_SEL0P5V             (0X00000001U)  /* Select 0.5V Reference */

