mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ----------------------------------------------------------------------------------------------------
          VCMBUFCON                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_VCM_MMRS_VCMBUFCON_PDBUF0                        (0U)           /* Power Down Unit Gain Buffer0 */
#define BITL_VCM_MMRS_VCMBUFCON_PDBUF0                        (1U)           /* Power Down Unit Gain Buffer0 */
#define BITM_VCM_MMRS_VCMBUFCON_PDBUF0                        (0X00000001U)  /* Power Down Unit Gain Buffer0 */
#define BITP_VCM_MMRS_VCMBUFCON_PDBUF1                        (1U)           /* Power Down Unit Gain Buffer1 */
#define BITL_VCM_MMRS_VCMBUFCON_PDBUF1                        (1U)           /* Power Down Unit Gain Buffer1 */
#define BITM_VCM_MMRS_VCMBUFCON_PDBUF1                        (0X00000002U)  /* Power Down Unit Gain Buffer1 */
#define BITP_VCM_MMRS_VCMBUFCON_MUXSEL0                       (2U)           /* Selection 0=2.5V 1=1.25V */
#define BITL_VCM_MMRS_VCMBUFCON_MUXSEL0                       (1U)           /* Selection 0=2.5V 1=1.25V */
#define BITM_VCM_MMRS_VCMBUFCON_MUXSEL0                       (0X00000004U)  /* Selection 0=2.5V 1=1.25V */
#define BITP_VCM_MMRS_VCMBUFCON_MUXSEL1                       (4U)           /* Selection 0=2.5V 1=1.25V */
#define BITL_VCM_MMRS_VCMBUFCON_MUXSEL1                       (1U)           /* Selection 0=2.5V 1=1.25V */
#define BITM_VCM_MMRS_VCMBUFCON_MUXSEL1                       (0X00000010U)  /* Selection 0=2.5V 1=1.25V */

#define ENUM_VCM_MMRS_VCMBUFCON_MUXSEL1_BUF1_2P5              (0X00000000U)  /* Buffer1 Input 2.5V */
#define ENUM_VCM_MMRS_VCMBUFCON_MUXSEL1_BUF1_1P25             (0X00000001U)  /* Buffer1 Input 1.25V */
#define ENUM_VCM_MMRS_VCMBUFCON_MUXSEL0_BUF0_2P5              (0X00000000U)  /* Input Buffer0 2.5V */
#define ENUM_VCM_MMRS_VCMBUFCON_MUXSEL0_BUF0_1P25             (0X00000001U)  /* Input Buffer0 1.25V */

#endif  /* end ifndef VCM_MMRS_ADDR_RDEF_H_ */


#ifndef DAC_ADDR_RDEF_H_
#define DAC_ADDR_RDEF_H_    /* DAC: Your module description, here. */

/* ====================================================================================================
        DAC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_VDAC                                                (0X40069800U)    /* vdac: */

#define MASK_DAC                                                 (0X000001FFU)    /* DAC: Your module description, here. */

/* ====================================================================================================
        DAC Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_DAC_DACCON0                                         (0X000U)    /* DAC Control Register */
#define IDX_DAC_DACCON1                                         (0X004U)    /* DAC Control Register */
#define IDX_DAC_DACCON2                                         (0X008U)    /* DAC Control Register */
#define IDX_DAC_DACCON3                                         (0X00CU)    /* DAC Control Register */
#define IDX_DAC_DACCON4                                         (0X010U)    /* DAC Control Register */
#define IDX_DAC_DACCON5                                         (0X014U)    /* DAC Control Register */
#define IDX_DAC_DACCON6                                         (0X018U)    /* DAC Control Register */
#define IDX_DAC_DACCON7                                         (0X01CU)    /* DAC Control Register */
#define IDX_DAC_DACCON8                                         (0X020U)    /* DAC Control Register */
#define IDX_DAC_DACCON9                                         (0X024U)    /* DAC Control Register */
#define IDX_DAC_DACCON10                                        (0X028U)    /* DAC Control Register */
#define IDX_DAC_DACCON11                                        (0X02CU)    /* DAC Control Register */
#define IDX_DAC_DACDAT0                                         (0X030U)    /* DAC Data Register */
#define IDX_DAC_DACDAT1                                         (0X034U)    /* DAC Data Register */
#define IDX_DAC_DACDAT2                                         (0X038U)    /* DAC Data Register */
#define IDX_DAC_DACDAT3                                         (0X03CU)    /* DAC Data Register */
#define IDX_DAC_DACDAT4                                         (0X040U)    /* DAC Data Register */
#define IDX_DAC_DACDAT5                                         (0X044U)    /* DAC Data Register */
#define IDX_DAC_DACDAT6                                         (0X048U)    /* DAC Data Register */
#define IDX_DAC_DACDAT7                                         (0X04CU)    /* DAC Data Register */
#define IDX_DAC_DACDAT8                                         (0X050U)    /* DAC Data Register */
#define IDX_DAC_DACDAT9                                         (0X054U)    /* DAC Data Register */
#define IDX_DAC_DACDAT10                                        (0X058U)    /* DAC Data Register */
#define IDX_DAC_DACDAT11                                        (0X05CU)    /* DAC Data Register */

/* ====================================================================================================
        DAC Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_DAC_DACCON0                                         (0XD02) 
#define RSTVAL_DAC_DACCON1                                         (0XD02) 
#define RSTVAL_DAC_DACCON2                                         (0XD02) 
#define RSTVAL_DAC_DACCON3                                         (0XD02) 
#define RSTVAL_DAC_DACCON4                                         (0XD02) 
#define RSTVAL_DAC_DACCON5                                         (0XD02) 
#define RSTVAL_DAC_DACCON6                                         (0XD02) 
#define RSTVAL_DAC_DACCON7                                         (0XD02) 
#define RSTVAL_DAC_DACCON8                                         (0XD02) 
#define RSTVAL_DAC_DACCON9                                         (0XD02) 
#define RSTVAL_DAC_DACCON10                                        (0XD02) 
#define RSTVAL_DAC_DACCON11                                        (0XD02) 
#define RSTVAL_DAC_DACDAT0                                         (0X0) 
#define RSTVAL_DAC_DACDAT1                                         (0X0) 
#define RSTVAL_DAC_DACDAT2                                         (0X0) 
#define RSTVAL_DAC_DACDAT3                                         (0X0) 
#define RSTVAL_DAC_DACDAT4                                         (0X0) 
#define RSTVAL_DAC_DACDAT5                                         (0X0) 
#define RSTVAL_DAC_DACDAT6                                         (0X0) 
#define RSTVAL_DAC_DACDAT7                                         (0X0) 
#define RSTVAL_DAC_DACDAT8                                         (0X0) 
#define RSTVAL_DAC_DACDAT9                                         (0X0) 
#define RSTVAL_DAC_DACDAT10                                        (0X0) 
#define RSTVAL_DAC_DACDAT11                                        (0X0) 

