mphalke/adxxx_iio-application/EWARM/ADuCM410_HAL_Driver/ADuCM410_addr_rdef.h
/* ====================================================================================================
        DAC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          DACCON0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DAC_DACCON_N__EN                                 (4U)           /* DAC Input Data Clear, Won't Be Controlled by Sync Mode. */
#define BITL_DAC_DACCON_N__EN                                 (1U)           /* DAC Input Data Clear, Won't Be Controlled by Sync Mode. */
#define BITM_DAC_DACCON_N__EN                                 (0X00000010U)  /* DAC Input Data Clear, Won't Be Controlled by Sync Mode. */
#define BITP_DAC_DACCON_N__FSLVL                              (5U)           /* Select Output Full Scale */
#define BITL_DAC_DACCON_N__FSLVL                              (1U)           /* Select Output Full Scale */
#define BITM_DAC_DACCON_N__FSLVL                              (0X00000020U)  /* Select Output Full Scale */
#define BITP_DAC_DACCON_N__PD                                 (8U)           /* DAC Top Power Down */
#define BITL_DAC_DACCON_N__PD                                 (1U)           /* DAC Top Power Down */
#define BITM_DAC_DACCON_N__PD                                 (0X00000100U)  /* DAC Top Power Down */
#define BITP_DAC_DACCON_N__DRV                                (9U)           /* Drive Ability Boost Enable, Can Drive 10mA Load. */
#define BITL_DAC_DACCON_N__DRV                                (1U)           /* Drive Ability Boost Enable, Can Drive 10mA Load. */
#define BITM_DAC_DACCON_N__DRV                                (0X00000200U)  /* Drive Ability Boost Enable, Can Drive 10mA Load. */

#define ENUM_DAC_DACCON_N__DRV_NORMAL                         (0X00000000U)  /* Normal Work Mode */
#define ENUM_DAC_DACCON_N__DRV_DRIVEBOOST                     (0X00000001U)  /* Drive Ability Boost Mode */
#define ENUM_DAC_DACCON_N__PD_DACON                           (0X00000000U)  /* DAC Top Enable */
#define ENUM_DAC_DACCON_N__PD_DACOFF                          (0X00000001U)  /* DAC TOP Power Down */
#define ENUM_DAC_DACCON_N__FSLVL_OUT2P5                       (0X00000000U)  /* Full Scale is 2.5V */
#define ENUM_DAC_DACCON_N__FSLVL_OUT3V3                       (0X00000001U)  /* Full Scale is 3.3V */
#define ENUM_DAC_DACCON_N__EN_CLEAR                           (0X00000000U)  /* DAC DATA Clear */
#define ENUM_DAC_DACCON_N__EN_CLEAROFF                        (0X00000001U)  /* DAC DATA Normal Input */

/* ----------------------------------------------------------------------------------------------------
          DACDAT0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DAC_DACDAT_N__DATAIN                             (12U)          /* DAC Input Data */
#define BITL_DAC_DACDAT_N__DATAIN                             (16U)          /* DAC Input Data */
#define BITM_DAC_DACDAT_N__DATAIN                             (0X0FFFF000U)  /* DAC Input Data */

#endif  /* end ifndef DAC_ADDR_RDEF_H_ */

#endif /* ADUCM410_ADDR_RDEF_H */
